{"meta":{"title":"Jeff Chung","subtitle":null,"description":null,"author":"Jeff Chung","url":"http://jeff-chung.com"},"pages":[{"title":"分类","date":"2019-05-06T04:24:36.498Z","updated":"2019-05-06T04:24:36.498Z","comments":true,"path":"categories/index.html","permalink":"http://jeff-chung.com/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"Why I choice jest as test tool, what I think a good testing tool should have","slug":"program-design/effective-usage-jest","date":"2019-05-10T02:28:21.000Z","updated":"2019-05-10T09:10:14.830Z","comments":true,"path":"2019/05/10/program-design/effective-usage-jest.html","link":"","permalink":"http://jeff-chung.com/2019/05/10/program-design/effective-usage-jest.html","excerpt":"","text":"FastRemember to use these version 123 \"jest\": \"22.4.4\",\"ts-jest\": \"22.4.4\", Allow Watchingrerun test after modification of code 1npm run jest --watch Allow spying and mockingWhich is necessary for unit test Spying1jest.spyOn(catsService, &apos;findAll&apos;).mockImplementation(() =&gt; result); MockingAllow run test on specific file123456789101112131415161718192021222324252627282930313233import SoundPlayer from \"./sound-player\";import SoundPlayerConsumer from \"./sound-player-consumer\";jest.mock(\"./sound-player\"); // SoundPlayer is now a mock constructorbeforeEach(() =&gt; &#123; // Clear all instances and calls to constructor and all methods: SoundPlayer.mockClear();&#125;);it(\"We can check if the consumer called the class constructor\", () =&gt; &#123; const soundPlayerConsumer = new SoundPlayerConsumer(); expect(SoundPlayer).toHaveBeenCalledTimes(1);&#125;);it(\"We can check if the consumer called a method on the class instance\", () =&gt; &#123; // Show that mockClear() is working: expect(SoundPlayer).not.toHaveBeenCalled(); const soundPlayerConsumer = new SoundPlayerConsumer(); // Constructor should have been called again: expect(SoundPlayer).toHaveBeenCalledTimes(1); const coolSoundFileName = \"song.mp3\"; soundPlayerConsumer.playSomethingCool(); // mock.instances is available with automatic mocks: const mockSoundPlayerInstance = SoundPlayer.mock.instances[0]; const mockPlaySoundFile = mockSoundPlayerInstance.playSoundFile; expect(mockPlaySoundFile.mock.calls[0][0]).toEqual(coolSoundFileName); // Equivalent to above check: expect(mockPlaySoundFile).toHaveBeenCalledWith(coolSoundFileName); expect(mockPlaySoundFile).toHaveBeenCalledTimes(1);&#125;); Allow Run in parallel/sequentialIt it parallel by default sequential 1npm test -- --runInBand Various expressive matcherExact Equality123test(\"two plus two is four\", () =&gt; &#123; expect(2 + 2).toBe(4);&#125;); Object12345//exact matchexpect(&#123; age: 11, name: \"jeff chung\" &#125;).toEqual(&#123; age: 11, name: \"jeff chung\"&#125;); 12345//partial matchexpect(&#123; age: 11, name: \"jeff chung\" &#125;).toMatchObject(&#123; age: 11, name: \"jeff chung\"&#125;); String1expect(\"Christoph\").toMatch(/stop/); Array and iterables12expect(shoppingList).toContain(\"beer\");expect(new Set(shoppingList)).toContain(\"beer\"); Exception Throwing1expect(compileAndroidCode).toThrow(ConfigError); Other Good Await/Async Setup and teardone Coverage RefImprove Jesthttps://itnext.io/how-to-make-your-sluggish-jest-v23-tests-go-faster-1d4f3388bcdd Good Unit Test100% unit test coverage on component of reducer&amp;helper http://learntesting123.blogspot.hk/2015/03/21-practical-guide-to-software-unit.html https://github.com/ghsukumar/SFDC_Best_Practices/wiki/F.I.R.S.T-Principles-of-Unit-Testing","categories":[{"name":"Program design","slug":"Program-design","permalink":"http://jeff-chung.com/categories/Program-design/"}],"tags":[]},{"title":"Hong Kong Hosting for China Connectivity","slug":"it-management/china-it-connectivity","date":"2019-05-06T02:28:21.000Z","updated":"2019-05-10T07:26:29.801Z","comments":true,"path":"2019/05/06/it-management/china-it-connectivity.html","link":"","permalink":"http://jeff-chung.com/2019/05/06/it-management/china-it-connectivity.html","excerpt":"","text":"Why Hong Kong HostingNo ICP registration need! Searching Finding following terms by ‘三网直连’,’CN2’,’china direct connect’,’optimized china network’,’china route’ in Google https://www.whtop.com Pricing China Connect route is most expensive Server RoutingBig Four Network Company 中国电信(good but expensive) 中国电信CN2(good but expensive) 中国联通(cheap but bad) 中国移动(cheap but bad) Routing Method NTT直连(Bad) 绕美(Medium) 直连(Good) KDDI直连(Low-Medium) Result Hosting Provider Bare metal Web Hosting Cloud Direct China Route when host in HK Website Price Reliability Developer Orientated Dataplus Yes Yes No Yes https://www.dataplugs.com/en/ Medium High Medium gigsgigscloud Yes Yes Yes Yes https://www.gigsgigscloud.com/hongkong-cloud-vps-kvm/ Low High High Layer Stack Yes Yes Yes Yes https://www.layerstack.com Medium Medium High Simcentric Yes No No Yes https://www.simcentric.com/tc/ Medium Medium Low koddos Yes Yes No Yes http://tool.chinaz.com/speedtest/https://koddos.net/web-hosting-hong-kong.html Medium Medium Low udomain Yes Yes Yes No(Partial, Only China Telecom) https://www.udomain.hk/tc/service/cloud-hosting/china High Medium Low Tencent Cloud Yes Yes Yes ? https://intl.cloud.tencent.com/global-infrastructure Medium High High Ali Cloud Yes Yes Yes No https://www.alibabacloud.com/help/doc-detail/40654.htm Medium High High Azure Yes Yes Yes Partial,Only China Telecom https://docs.microsoft.com/en-us/azure/expressroute/expressroute-locations Medium High High Amazon Yes Yes Yes Partial,Only China Telecom https://aws.amazon.com/ Medium High High AWS Reachability test Testing Tool http://tool.chinaz.com/speedtest/ https://icp.chinaz.com/ https://www.whois.com/ https://viewdns.info https://check-host.net http://ping.chinaz.com/ Tracing Tool https://traceroute-online.com/mtr/ http://www.monitis.com/traceroute/ https://tools.ipip.net/traceroute.php Suggestion Tencent Cloud - 96.5/HKD per month Ali Cloud - 39/USD per month GigsGigsCloud - 39/USD per month KVMLA - 80/RMB per monthIf you don’t mind China Hosting Company, we can use Tencent cloud. If you do mind China Hosting, we can choose GigsGigsCloud.","categories":[],"tags":[]},{"title":"First Week in my new company as IT Specialist","slug":"it-management/first-week-in-new-company-as-it-specialist","date":"2018-10-06T02:20:15.000Z","updated":"2019-05-06T04:24:36.277Z","comments":true,"path":"2018/10/06/it-management/first-week-in-new-company-as-it-specialist.html","link":"","permalink":"http://jeff-chung.com/2018/10/06/it-management/first-week-in-new-company-as-it-specialist.html","excerpt":"","text":"This week is my first week in my new company as IT Specialist. I feel the new job make me growth as follow I can do + I want to do + it needs me = Core valueAbility to use IT to significantly increase existing operation efficiencyKnowledge Communicate and study with current colleague to understand the current operation Design how to use IT to increase existing operation efficiency Resource evaluation and planing to show to manager how the operation efficiency will increase with IT help Personal experienceI just write my first in-house IT project-proposal. It is different from software development contract but related experience can help Ability to implement proper software development flowKnowledge Know what problem(communication,development…) need to be solved in software development in existing project Know different existing software development methodology and tools Personal experience Knowing scrum vs waterfall is a basic requirement. You need to know existing team member preference and project requirement. Redmine and it’s provider easy redmine are really good because the Gantt chart and Task(issue) tracker. It allows everyone have a whole picture and their task efficiently. Ability to design and implement proper algorithmKnowledge Set the goals of algorithm Related message(e.g if you want to create analyst tool,math and statistic is a must) Present and communicate about the algorithm goal,design and implementation Design verification of algorithm Ability to gather data for algorithm Personal experienceFinally have the ability to use calculus and statistic again after high school:).The graphical representation of statistic data is also a good tool for presentation.","categories":[{"name":"management and cooperation","slug":"management-and-cooperation","permalink":"http://jeff-chung.com/categories/management-and-cooperation/"}],"tags":[]},{"title":"How to explain you need aws(or cloud server) to non-IT guy","slug":"it-management/how-to-explain-you-need-aws(or cloud server)-to-non-IT-guy","date":"2018-09-10T02:20:15.000Z","updated":"2019-05-06T04:24:36.283Z","comments":true,"path":"2018/09/10/it-management/how-to-explain-you-need-aws(or cloud server)-to-non-IT-guy.html","link":"","permalink":"http://jeff-chung.com/2018/09/10/it-management/how-to-explain-you-need-aws(or cloud server)-to-non-IT-guy.html","excerpt":"","text":"Metaphor Web application(software) is a Movie Server is cinema BasicYour web application is like a movie.It needs to be playing in a cinema(Server) to let your customer to watch it.Traditionally,it is played in private cinema(Private server) which is maintained by ourself.However,there is more and more public cinema(cloud server) that allow us to played our movie(web application) without maintain our private cinema. What is the advantage of cloud server? Cost saving(don’t need the money(hardware+human) to maintain your own private cinema(private server),just pay for the service) Reliability(e.g AWS has 24hour on-called IT team,and proven record to be reliable to been used by many enterprise customer) Manageability.You have higher management efficiency to server.(E.g If you want a private server,it need to purchase hardware,installation,network configuration,but if you have public server,it can be done by clicking few buttons on their website) Strategic Edge.You can cancel or purchase your public server anytime. What is the disadvantage of cloud server? Restriction.To ensure security,a little bit restriction will be set to your web application.It is just like the movie played in specific public cinema will need specific blu ray format. Security.Although cloud service provider like AWS has the best security standards and industry certifications,the cloud service provider still have the access to your business data.Therefore,banking and health industry still has their concern to public cloud due to their regulation law.","categories":[{"name":"management and cooperation","slug":"management-and-cooperation","permalink":"http://jeff-chung.com/categories/management-and-cooperation/"}],"tags":[]},{"title":"Wine IT position","slug":"it-management/technical-growth-of-it-team","date":"2018-09-04T02:20:15.000Z","updated":"2019-05-06T04:24:36.302Z","comments":true,"path":"2018/09/04/it-management/technical-growth-of-it-team.html","link":"","permalink":"http://jeff-chung.com/2018/09/04/it-management/technical-growth-of-it-team.html","excerpt":"","text":"Ability cycle Why we need to positioning my ITWhat kind of IT team have the power to speech.Simple,the team that being highly dependent.To become highly dependent,we need to define our position well. Wine IT internal team positionNew generation wine selling platform for following customer.We respect this is high involvement purchase instead of modifying it. Customer I can find my rare and old bottles efficiently I can purchase rare and old bottles smoothly Seller I can sell my bottles at good price efficiently Business owner Ability to find the best question to customer and seller and answer it. High maintainability = low maintenance cost = less man cost Dockerize deployment = speedy and repeatable deployment = Response to market change quickly Web and mobile web application = High conversation + Speedy update Stable service = high customer satisfaction rate Good manager focus on potential value and space to grow I can do + I want to do + it needs me = Core valueAbility to use IT to significantly increase existing operation efficiencyKnowledge Communicate and study with current colleague to understand the current operation Design how to use IT to increase existing operation efficiency Resource evaluation and planing to show to manager how the operation efficiency will increase with IT help Ability to implement proper software development flowKnowledge Know what problem(communication,development…) need to be solved in software development in existing project Know different existing software development methodology and tools Ability to design and implement proper algorithmKnowledge Set the goals of algorithm Related message(e.g if you want to create price estimator of specific item,statistic is a must) Present and communicate about the algorithm goal,design and implementation Design verification of algorithm Ability to gather data for algorithm Ability to design high efficient user interface and smooth flowKnowledge UX design Learning model(flow,deliberate training,study intensity,Feiman method) Communication Ability to manage and implement complex front end interfaceknowledge Ability to define and solve ability Ability to evaluate task proper cost(time,price) accurately Deep understanding of programming design（Principle、Complexity Model、Data structure and Algorithm） Strict coding convention(e.g airbnb) Test driven development Sharing culture in development team Willingness to adopt open source community Tools Jest React Redux Prettier Swagger Speedy,repeatable and reliable deploymentKnowledge dockerize deployment AWS Develop high efficiency web applicationKnowledge Deeply understand web rendering model Deeply understand(React) rendering model and philosophy Deeply understand browser event model&amp;event delegation Deeply understand http policy Deeply understand Web Worker High network efficiency and low latency implementation Signature of remote IT communication Problem Over-fetching (Overall entity) Too many Round-trip (Different end point) Knowledge GraphQL &amp; Rest Pagination Filtering Ability to ensure stable&amp;quick feedbackToolRedmine issue tracker Knowledge Clean cut responsibility model(developer,tester,reviewer,deployer) Prioritizing Cost analysis Domain valueWineData structure of wine I can do + I want to do + it don’t need me = potential valueI can do + I don’t want to do + it need me = routine workI can do + I don’t want to do + it don’t need me = backupI can’t do + I want to do + it need me = space to growthAbility to hire Awesome hiring process Strength Model instead of weakness model Ability to remote working rework(great book,concept like co-working time) Ability to formal business communicationKnowledge Remote digital signature Communication have both content and relational directional Continue feedback for UX improvementKnowledge A/B Test Analytic Highly collaborative web applicationKnowledge Web socket I can’t do + I want to do + it don’t need me = personal pursuitI can’t do + I don’t want to do + it need me = IncompetentI can’t do + I don’t want to do + it don’t need me = No need to pay attention","categories":[{"name":"management and cooperation","slug":"management-and-cooperation","permalink":"http://jeff-chung.com/categories/management-and-cooperation/"}],"tags":[]},{"title":"How to explain Version control(git,svn) for non-IT guy","slug":"it-management/how-to-explain-version-control-to-non-IT-guy","date":"2018-08-28T02:20:15.000Z","updated":"2019-05-06T04:24:36.277Z","comments":true,"path":"2018/08/28/it-management/how-to-explain-version-control-to-non-IT-guy.html","link":"","permalink":"http://jeff-chung.com/2018/08/28/it-management/how-to-explain-version-control-to-non-IT-guy.html","excerpt":"","text":"Metaphor Software is Movie Programmers are the screenwriters Programmer write source code(Screenwriter write scripts) Movie Script ManagementScreenwriter write their script in their computer using MS word or Text Editor.However it’s dangerous when their computer break-down and causing the script lost.They also want to share script they written or collaborative write script. Therefore,they backup their script by uploading them to remote hard disk(like google drive).Like Revenger 3 - 20-5-2017.doc,Revenger 3 - 22-5-2017.doc. Source code management The programmers also need to do the same thing but their tool is more advanced,they called is version control.They use tool like git,svn(your local google drive synchronization tool) and service provider like github,bitbucket(just like google drive). The importance of version controlNo version control is similar scenario that you as the movie producer,and your screenwriters scripts are No backup,when their computer broke down,all your scripts will be lost. Extreme low collaboration efficiency between screenwriters,screenwriters hard to know what other screenwriter script about same story,which lead to terrible movie script and movie,just like terrible source code and software Service providerSome non-IT guy are strongly against using service provider like github.In fact they are more reliable option when you don’t have dedicated IT team. Using own git server is like using your internal remote hard disk.It is maintenance by your internal team which lack of functions and not stable when you don’t have dedicated IT team. Using own github server is like using your google drive.It is maintenance by your google which pretty functions and very stable","categories":[{"name":"management and cooperation","slug":"management-and-cooperation","permalink":"http://jeff-chung.com/categories/management-and-cooperation/"}],"tags":[]},{"title":"Remote digital signature of contract","slug":"it-management/remote-digital-signature","date":"2018-08-27T02:20:15.000Z","updated":"2019-05-06T04:24:36.302Z","comments":true,"path":"2018/08/27/it-management/remote-digital-signature.html","link":"","permalink":"http://jeff-chung.com/2018/08/27/it-management/remote-digital-signature.html","excerpt":"","text":"Important of remote digital signature of contractFirst impression,very important task NoteFormatMust ask what form they accept Smart signature program Hard signed and scanned(if this is the only case,you should wait and ask for confirmation when you are standing next to scanning machine) Entity Send back the whole(e.g they give your the contract and NDA pdf file,you need to send back 2 pdf file) Remember in most case You need to send and sign with the NDA PricePrinting for 3 dollar and scanning around 10 dollar is acceptable. Toolhttps://smallpdf.com/cn/sign-pdf https://www.makeuseof.com/tag/how-to-sign-pdf/","categories":[{"name":"management and cooperation","slug":"management-and-cooperation","permalink":"http://jeff-chung.com/categories/management-and-cooperation/"}],"tags":[]},{"title":"Find market/company need and transform IT team and IT development cycle(Core competency of real successful IT manager in Hong Kong)","slug":"it-management/core-competency-of-successful-it-manager-find-and-adapt-market-need","date":"2018-08-25T02:28:21.000Z","updated":"2019-05-06T04:24:36.276Z","comments":true,"path":"2018/08/25/it-management/core-competency-of-successful-it-manager-find-and-adapt-market-need.html","link":"","permalink":"http://jeff-chung.com/2018/08/25/it-management/core-competency-of-successful-it-manager-find-and-adapt-market-need.html","excerpt":"","text":"What is find market/company need in real life?For example,here is a startup CEO I have talked before.His company has a very successful product.He don’t specific mentioned his thinking process,but I notice his IT team and development cycle. High frequency and reliable upgrade of productBecause his product has many customer and his product need rapid changes to catch up the market change.His team focus on the continuous integration and continuous delivery(CICD).It allows his product can delivery feature update every day/hour.The delivery can rollback(it mean switch to previous version) immediately when things can wrong. Long life cycle product and rapid developmentBecause his product has very long life cycle and need to develop fast according to market change.His team focus on code quality and code standard","categories":[{"name":"management and cooperation","slug":"management-and-cooperation","permalink":"http://jeff-chung.com/categories/management-and-cooperation/"}],"tags":[]},{"title":"Backup&Restore centos or other linux","slug":"it-management/backup-centos","date":"2018-08-25T02:28:21.000Z","updated":"2019-05-06T04:24:36.276Z","comments":true,"path":"2018/08/25/it-management/backup-centos.html","link":"","permalink":"http://jeff-chung.com/2018/08/25/it-management/backup-centos.html","excerpt":"","text":"Bootable Usb that contains clonezilla Download Clonezilla iso https://clonezilla.org/downloads.php Use ISO2USB - linux, or win32diskimager - windows to create the bootable usb. Storage Medium1024GB BackupClonezilla Back up the Disk Image, Select Disk Back up(Mount)clonezilla live boot usb + storage medium(1000GB) Restoreclonezilla live boot usb + storage medium(1000GB)(with image)select local disk as target device,start cloning Referencehttp://storysky.blog.51cto.com/628458/291587/","categories":[{"name":"management and cooperation","slug":"management-and-cooperation","permalink":"http://jeff-chung.com/categories/management-and-cooperation/"}],"tags":[]},{"title":"新世界四季御园2棟505","slug":"investment/real-estate-shenzhen","date":"2018-08-24T02:28:21.000Z","updated":"2019-05-06T04:24:36.275Z","comments":true,"path":"2018/08/24/investment/real-estate-shenzhen.html","link":"","permalink":"http://jeff-chung.com/2018/08/24/investment/real-estate-shenzhen.html","excerpt":"The article has been encrypted, please enter your password to view.","text":"Please enter the password to read the blog. Incorrect Password! No content to display! U2FsdGVkX1+cgsRoZwUQeaLxreEDccBnAnv45V+fXMDPi1F6s8Oi02LdxbGlbsAnH0/RfbX4qWVXVVXX31sgqS6qaSWzcxiH8QEJ4H7jen1McOCkpEMtw/vp4xwq9iu6ZrtgysPfVv90G46mu2jawJQ8/IxQzaz9DOywYn036lMK8gOmHx1VUbkh3x4thMllkMQkRdOJABLplQYA4npDZq8yjp2BMUDNhulNjdBoNAP5a9+jn5OAJ7ltfOaXmIb5LOVms4xFPPG5jxS3uO1oyBF7lQa+N/0V/QudhIW2QmpWdAMhdzvEtuhjSrRzH8GRy/bqmh1Vz4/3Os3iXBwAKFhOZnLQZ0mXeyOVD45Tqe8fKPOj5Z9xjHt7WDb+1cdfskMBEOtkCtqBq7inkFBE9MLFVaqrGeFvq9VXOZ2IqrkcdxfgwIdWp5Fpf0+lcYY1HlwedCs4vbkNbWQn3Su0Nqb58ZvXnjRMh0+3yAF4dmcTAgQUJvx6Ocs/Y6oNyOODNxuLOZLyDPCC/eciq9mmW2qXQU7cUIE8DIP0mR/sI/ul+GJTVt+A/YpjqAW1kYwy7izZJFjj8gzvlavW3rFNLB+axvoDi/U8i69Pa+hxZ81GLJOoAuk8vLhtTaz5q716niySQcw24IMK9CRJwXYSlYho/wyUI4eKYG+W6enmWMmcVN1iJ9bA7GGpnoxxJ7V2TPltmTOkLBV47lNs9m236tdGvV7ZkceCCyfVa8FtkwPpW+KGdNIBGXWik6UG4Nj39WVyjcZdwb5P23IhPjzKhJ5LRkqjrAWRmaEblaiBM5xhtyWKkcOqIj2BwV6F6/mp3k4GKyaqc5HRCCz14+VtDCJ+qnM99MMstPXgG63KG2YqEfjSG3dVS+zFmUMOEdqO2TC0EIFyN9EcbVfKWLzzda17y88uphCXilFcaotgD0d+FCnmw1LXQRsKsLunJ9VJsUGFdzqKiu7g2HDpCJjnWb0fz3Weh6yIHAvotgoZStqxsR/VNe089LFkXl7EFtwFoF0rqC4on7zVSevjvuMFhUL5fM9y3WpI6t7WkmI+J43czqrIWgtO/wnqhHIwP2zfbweVoIFETTLVo31oN4MvWoVfAKZfoWhkd0Az0aGEDqSiBJi9/7xGB/suGDGP+hwJNoKDZM41VU3P6QBprNwN+KnwqiNMe5Pf052ZLJbUyc7h2Syo8heE8Ydlc4sjzfYTgEGXrf01LtrzDo8s25JYL9uq5vWGPYsyLJZjZKvZbBcPlfMEk7KhCYIjlu4jCjTuT/jN3Z5injCDG6hnWuMoASkCyw7qnE5ZESIMkVcU4bUjzd6sWUZRcE8VEqigUHl+swXV8O0m+sZMmdXuad65m4Vsy7Dpqo3rKLZLyeIVRzjJuuM1hgW9g5uhAz8eh6LhLKeQc71QkJBjvHlsTjhPK+5DUWuVqKSAf6wSDw2umYMidh+8DOAdXVeZ8vHcVMEk0gCEjDnPBuEcCKJ5nAc2R3EBQftJwNU6W4yqboU9WlvqV0G3kbboJPvvO9ZLwXyclhGk6htbatbwrJ2znGbHaKYQiaVj4ufQrMARCA1vzkwrOt5rt3L9MTs/LBgcNYANP15P+pzX7qd3mmjhqudJlGPh2b5RgjuZ2PPgaAH+AVz+7M6L4FNJMYUuMWnnr46pahQNqKRXNGuUykNGoBNA+vGhP2iX46wABWW9VqoPOxRqjz+yuLJduT3LhnW70q02MhvATVP4DODq2hrzLr+evBT2xmQ00OTdDZH9nVpfhoWvYh1PkWNvIzVj8Q44yh9pS36qi9qkgpSqSbDTTuxKyU9EYrYnb9Pts14lpaCNt+jFU2y9FaeHez0Dc/3a7PFoXKuJoFt6SaHD0UNmWZnbcFQSB614QkeQBbTp45e0CLVJJAKVzh9odE57Mswhsh/aKMqx1SydxEDFxpVcFfkOLMeB7sCL6/g3CSFFFlMaGw+TwlPnmm5TkQT67N2fOjE+kAdjPlw2qzX2ykZ7qXB59LqhRTze7gvt0VG0Ljnem4x/d6nvsx8/By3VQwsGgu8GDnKOkJiXgmis3UqdtpTW6NTL8F4GFs6BHxVGm6kAMqTwyusnzinFRb8Iya4potaeeKVX/n7zcrPrwvTTlp5Qf4r5+0AiIio1i0+uUm+RMaxQe46h5itD+eC3taUAK7dSODhWi5ATo5M+agQ8OkR1IK3TdKBrihDR92urvTnSTVaYemHFfEuuj2Q4Be41V+LB1ah5yOjcIfqniZEZuH8F4hecazShIn9l6L83L4UY/U3tMrCrT3OxKqUqrgfWztUz3ha/AJPgN4055ZnvAU/8CoTctPrSKhrAc0ds5h7Tt7kYypWr/REBGI5DFdBytEPQ2o5NbxZxImFMJ3M9yM+vgsvKxGacuwwCPj9wtZk/2yZGuQCIztITiuW+H/t3s3XBSKiuXrhDdky4Q2MwEtvs1U9prb9xBGN3UH2vzhH7ZevQJDYFJMiKZiRk/BKzW0AaXJgDLtAn3nzGp7eGo9kjI/fzNVyFUtJ+SbSpZY+HzC9K6ipaW/uxcqzZ6ag9ftDAGVkqX7IRmrK9ChtOW3GfWX7Ec/08gZSsiqWEjHYe2YtJINcvmSluUirqaz5MMICDqyXuiRJtVu8DEFFYrtI5QO1DbL63XSsovnV2kcU4LxlFH7h1JCZ0cXWwgGmBcsmhhYG6XiBAige9FqGscEEpHL7MCYiZNq9CBV7myJgHqdRn3+sfEPQo7zE9qdMYoOJKFfymfnC/OIeF/O6QjskitRiVDqD6aGM76L64VEjnkVqyh5KXp8AqxN9djWmofp3FKhZCiNJp2Jwkv2NyQv/PnvaYrihQiPnzlTab/CxWtta40j7bRX6jryU/A8609rblDr7naYjSCSKi5o3qPbQ3RkVPFDS7wiOsxLii8CfNXFpbFbIyC9thWfe33F8csssQ9eOecjja8ShE7tA2d8Xev896F1uyKNJS90k98IKcOAu/cjCOeD6uWy6brXoqdDRq29UEHgTzKHp2a6RwVBJo11B3Ca7NW/l0aBb71RsvyJWlSUXcipDJaB2Uyf8AZ9elnY9+0cwQsUmis+ahdcyPoFkA/p0ACU7RGXVfi46k7XS8RO/IqMarky+0o7RmHC/RDysWmyOHpywYskVLyddxyvTs03ietWoAdTscnowP2SjI8MfkaO8Eu/4HKG/FWKpjT7hrs8nVkBfIH7E8HjWFIfgJgDic+/pcMjMj/scKTN93DIY0BKZdayzQ4e8wrfxOAooxc6ZyGH8zF6j+U7CvoTrRlngWZdo9dYidVyO11xX1b1S1lPjG7seHMYh2Z9yIMBWXMHnjZVrZoy+/WLFCpkc8L+UfYZ6XoUypp2jUDuJHOnKpKerptaAWSwJiyGvZ+t00DC4xcuUmhlQqw1qR0+oUS8nddbJnFX8h2rOiG4DwmbBVF4se5NR5PbDhvIYGVDzwsKGqZE3G5B7isS5CpcHjy7bu5qrWlxlNvlVGFjW5bTcDryzueZgkGAjk67cDYlEUyo2lJO6uGpWInCRYgK6fLWPByWzjSbkJEb/ODFDz7c91/ijqfz+FHPbrqHtn/P9aA+bGKr+SewsijyMNBpAqx9ucAJOPloDxhaNVIAlvljNzKYZFBUfOS6YZ2BEhxAn8KA6fLl+uFG45lyGWH+F7GqjDleE0kCDzAaepqLk2jc3JhgOe/pnPucOq9CcdZg6S7sUccEcqXaxK2oO4KntNSwNHL8mlvlJQXI1IgtEpPbJZ936TVZlz9ZcqMnrVwM3TGx6DdFC5RqqTy9h1XrJ2tmqdYk5uK3BkBQTmfdqwd96Vqcd070zc/sR6wG8b0yZPQl8TE++9N/osRUQx77ENyhz52vBy/biUMULgH/xihK/k2az1MFjsiYCM0rRBIXvv1Pz/PvUrZWo+o5gj3LPwOQK+JToHppKyPBMdCeq4A/U66M9vDs22LZNGQyMjkqY6pIYHcWNjtg3Qw9ZB8YQEBfPkraYiV3HF/K9rUi9vQLI38YwZBbNtu8cAE12LSBKu1exKCDevQiQpltLOknaOX9K8vWe4jhqxM9fzsvNI6UpTWNaw+xE0jEQmhMmLfLmj839Jc4F8sdYVaUxwej1xesvhwlcADc43aZf9CDZRtCgP9qpb9EzHheL1feMFZR1v0hgNIlqenlhZBffVslgfXFn1ywdN90CIqoLLYrAZX9G8UIwkAZIbIULO+u8idX+mtXLvq6dbTAcUNiEMNSiO+/EaPx6i1B/5eF0cUmXwVKmF6FIdEUqa84nP4kfPDo6LXYvr7GHZhFOxfB2jQiolTeKGrRdKj9cHK2/zx/OC5xgSYZD7zs+uuYMoQy9/REAfcaObJXhebZhMWyq35SaqJx/vRjszldeMBLdR/J+qd1+Jw9dKYHQKezYms06fKa6vN9+FRQTfd6rM6A3cunrtZu20c54XUKqRZc4T8xsQu8yOwdSxshMNTdATps8QrVw70S0FhHPSqxdBXEhpKSL+/qt61F3OfD6DZgmW1vewbpnSmRYWAKFMWJ8XSdaQY+iUUPIG3YygEguoih3LNjJfU4F/Ac9vxnkYdVwAUGS+Fkh2/xX6kjHaZm5WHkC1VvPAb1B6JZkJADVTuf3lzL991OeiTRJTSMowbYEkFjV9Se/8es9BDeNeZEoJrYhdsRZO6t9SCXBFaXXs/oW/XdVAYueTmUd38WdOMP4ZBD24wVS+5570i5M2OcWz5vi39EJAm9C8cDJb0+S+QgYwuiaF5V0n7R/Gl7QAUsVYgHe+2mSjDJSHptdqDmnGvYROdv8VOF8iHb0p45IM6rpIQvKIFxym1ntd7qNAD9zNFVqQTcxyfXD/FriHeiztgUmBfS1TitNRgEyZoMwMZcMhnefQJ++r8XM+OijOGKjjRNzd95s5Hu7+99kaJrRDw2TAqmBHtEs6N2yZyl8ArJOQWaloMdnjR6dJ7tshnaY2K8Mb5fxg+1Atz5Y5FlXq1JrPGItI4EG1O2Qx8nAp5TFb3vCwLRWon4Q8jaQgiIwYhTDK0Y1gUSaIaYg2JwguOIcOjhipd5pPIMX+XT1PoKI/a0viRNMng6pagX787DZ7z5lKh3SyY9z5ji8f6W71CbqFaTaMYPqXil49XB44Y9eXzee7qBtpDz7hNuTBQsQzMc2856xY3ohdSwwJBiYbXwXqRsscQIEXOKYjB5kjzp0zDO0PEY/8XUndW8Yz97FLAGE0k6csFK/yroVjY+FISy3PrRJqtSt25bcD7Vs1eQ5kmzULKX2OZUomVRrdKh3GeshZ/TwnReQsQHvIzfJbSlG9gV4b+FI8sa6JAovkmzmM87k+WSm1+BOSYnDqdL/b5QRo1mdM9zp84iSaK8pU1USnCY+q2tppi4lSR9iHYGl9hN0MUUYlmq3/w9Kb+ZIGleWUnnjnSe17g6n/RqmNBGJ7qWlRBYAAnTrtML9CJsYNFDChucS+ce9OY3HwPk2p4qZ3Cj5dTrWsopdhrkixfdYWiXIkkeHg8X080kK3wpVe1DD616FKaFpwf2luRkGLUKK3Tu1Uw1gbfnly2wK/6PCOKfVeL8btwJm64YD5vyh0aiffDd7BWS8bHdXHFxUK/3t66vGieqBicqv1LbrZRS3HG2Xsumcd14Sm9DVc8RtRqsvrC2wgj54uvVuGtf1PNm90uFzJ/g5VYlUglk6Szs4YhcL5rngDF/xy2UZzDQg6ZvYbfBrISKuhHtpwKnvA4lLxq57cpi/3XUa85IL2610pc1wjEXKKwW2VtwlW3mOtmW2IPd0TNt5v/fIOCPN6pmn70PkzDvpsuKCfBFArRYCWsH29inWrv6OmYpb1FbijDcIs9Vki3cg7pkzaxPUmsNGxEPfsbFKYLeQJ+ljudhEHwQCyAApbn1JLYNaI1iRQmyd8DJQIG/iYTI0HnWCBaNSpLV/QjMtjSFmCHe4GwQM8kVjh6zIKKhhakr2/aahigBzvELo6qQll1py23CbPqaK2K4NXUmfj4PdKYdhjjZ3dqeH7khdnT33RLQOD0dM3n87SlntlJqB0kPR36OWyCjt6nNF9srEwxeL3QgMbpbNU4mfQu+yZzIVR0PUAu19Kl/sr/xm5igNaAC4UWF6XNQDcX36/LzDuFodqYxt2bRmHyKWQ1nO4mwl3dTLMyqtXoawEkAx76Y+bWFBS03UrsgQF0m7YtZGBVu1jFqqfs2UqKNKs3/dCULbiW7ZoACO9ffLwU+fdGaYNjZA/t0e3Jccc/y7NiL+f1oJ067bEPmVXREPaYPdq4pv8pRUZM0p93CZiUgEYfefyUO/Wno+mKuVcEjkoy3kHgXfhRWYQB0/XVKXphFKHT6MhqWb+KeXYjx1BsC1nTv7DDRbV7nzLshmBvdc9OK+99D08Yjy4V24eSx4TJ4PCo0vGqI5pvktCn+hTYZRv+rbradBMe9tBdvdqsuBfPkRsA9HwL0TmxW/rVTupttJJj+g2bptfOs0oRpVMYwcnHDodmb5829U5adwaiBiX6UG9FtmHA18l6VWLdXBGjhUaL23ILgNRxtSgIh6ornEHEAAIF0yyuvWkLSIvsBtEWdGoiTQECvz33UJoX54Frcttq8ETF4wWcv2O6/KRBUToQrsH7IN7XPMvTrBRwFqp8/8lGJbPwfZNn2ctScL5CzWjysB8sQy6isDybEXhgBYtIlYvwsv4A9msWZYmILDGDJjczeXS5ZdLIOK0ZHrCAR5kuYZumY7DhY+L8S9jprsdKJzh3sDBZtHqv8q0wAswV3mSpEKOvQvifQaNnqSer0dO+R6XUA8K7HcFAHR00Vvx5CtiItZkF9/mz2tFJ3BkQA+yN9f6gOvdnAhbFc/GfuqZLP6T6ouG6ffmtQZqYvAmC7bJruhd79F9QVy/2m12yPZeGIeHcjt+wshyXa4+xWSCH0mHfVQszfkzMCNHJwMK9P6F5bGjMtdmd9NKDmkmUB9Lalh2niP61SReATUBMtT43nKZBHu4QlrGw6wuK6p4K9vIupDBBIKNRNUDRRpgchTGlOx5vZeeaAHEijpYZWSo6dkNUouXYElQzha7VT9FFSvUkFSTGxolhO8sdiE1y6L5e7/oTw88SdOiO0otHSJXOt8Rpc5BusJdGxOH6JOry3PfATJA28dVoqqKbylwEJqw3sUD0T+zWRruPeUH2TnHpekg4vGuo8g90Ig4FwQl5Ca+esqAgI98we4AJYSMAwrE4NyssMziRRX5eJ4Eny6JH/RBjrLIMVeo623CBD9299NSAqs/5eyH2zDQV8ac7sokAI8fzISAjVpb+nG54kK/OHSz2FWfHmRB4AvrvaYEHlwImMY84snWB/M3cPKUMFR69rBkiTUSSfYe72WXDcp1TrBBzHvzg/jDwwW9+kVqwX4lIZBK3UIwlUlC7NsIsnPewR+UFcrIM8YX3oqRxpIC7QGDVxj5+NG+Qw3V9f/Tm1szMmHzhBSB90X2F/zwOefwOVzlFqr+M+oyJkMuB18tgiMQX3YM1Xti0l9PcGfSA/7if6SPc9Rwk30vVAHtfa0ZImlYiTFOdd9gLPespZnuv41+78/XttfSfbsaco+pvEZ20fv1jQL3AmgzNhSJBVjPJO/EyYUWTWb2oJtVjN9c74AhAFKorwUxFtoEOE01H9Dl+684Rme8292U0auZ46xE6nMgJl4FDedAatH7Z+7aEWuXb6x2PAPI/w9zbEuMYS8JYL78bMTklYOATPwUIcBYKxaKNgJPCLUie+vxEaWU2dGbZLxhHJAgPN95UBt+1o5ylU5Zd2pbTPvm9NdE7gBgXP/aU4HyF3xAczW0lHmrOI5XSuCuEX4RabNC5h8BULYQ6SGwfWESJOkVizR4k5pkqT9eBIbBCazda/VBCB94Hz+MC2ukiV+vZPRWzdrk6+QDBESTltw521ffqrd8TXRnZc7/u2tMksbuQX/l4Q2xelgdfsuJiwDlwIIEkIcXp2epTVUKBXBxesD5Bh1bPg9+FjVQJV1KcrfGXZotPawlrWb9NQdme1+CYc/odrG2fRnOj/wiwRMvsim7L7gFgPsAMlUlbyhNs87L4I1OkMqRX9Dy6rZep1OokQc8MNMR5fkXKTuu7ZcuF7RYE1lBzszOrF40/u1wVV64TAWrB/raDB0soFt48SS6UoQPgCmhN1aGpjVIx41LR6SMlr19HwDcObEToTOQTTzyQIKDejq3Jm/mXjcxIDqIdPJQfur/E1vR7eOIDAdkCUYei/P989TRFRjF2Om3YXYo/4RVHDBtJR4vBTCqBfyHssxHy8PzHinTa1pcCegLfBkqlbgddoJDl6VPZORGaVg0UbQl4K9Zn7eKXekMJ7aac2jz3G+D7X1Zihd7oL9sAUUqrqEjHJ1PI3I9THGuXGC3UoiT96q19FguBCqKuPspolj1AZ4hJvOnE3IRpCDhOeYsKADNpVpX0uRzzPd5+xE2uGmPgV+wMbcsSjtBtiuT+JlAUwt+81EJsDPL/axJQa0aHZn2X18e8gg6dJj7kp/WppYyUCY9iRghP2YhXWTY8vjDXqZqNU4wKZCBUxh1Y48GvS+MgMUnQO/IM0LGK0C3lFy3+TaVBA58xIni4doBVvWGdIrerKpPZmRgp6DlPXLyvAawSbTR2X00VQ2iAoL/+SZWSIDlkt4840JgRVGDDpGPPbXe2jVmKKhNxUVxbCDcrk3Zvg4UMG1NTKqePdr/ZnOe+9nJWQr5DWiMXgP8bN4hdTH9PUVQUs4XQJeMsqj+aeIjHKy4RaCK01ahQWAOIRCQzDFKb+3pglf1jgXuET06bPVhUNoyX6hSIU4eMIXiJk/TX+ZwHMHa/9k0U01pGbwBMJxhVowJrid96ii4z7kOAFLMxUhjRTvZgumb+CN6Cf9t8YMgWLgGuk5KIpxVPm4TgEyE2UXe81D62S+A0FakVICJd72vbw/vWgVeFSlvgx2RokJIkhPWrkMUOdet7j10pHy6Aq4x4Q8it9tkB+E+aHCpYbzTGS+/D6iJjzGvZaT4Mw0le4/XBSluhAx7g8fUnlc8MLyOWXWaDtHbCNRXdlkxk45WuW49+G4NB6031tLe0tK/5BEN6UfLYZvhr5/k7aCy6tN5kY/Mj8IXcNWWcU6v4ok31Itc8xudfidoF6U3D0oJC5R2mlv3Lb7llqh7uYf69Eup82uY95DDSAu7500Zrq/fdIcz1/HS9NY5aPkaZ1p+z8pndjzleGNCm/3E4YDR32/x0lrnbaCIFpCfSdEAcrYimQID54q+D1n9o7ligCF3ZUgO2D8ja4NUe9bc9FLa99rXau0og0/hxv9lB+y7P6i6VZr/kmSGTEx0X9sXu+C0Hx3ZIbFoQpkWKBxsASfR2o6qF+8VefWH+8poeldKi1n+0LUfI+fiWv3cwMf59Y6r5jfWiV5BY0QUp8KPAapUeVbdXAwsMkE/3INQk1ib78EHnvUyOAxt9A60sDF6m1FHDIfM3ENjhx3jbVwaSqbUloPuYoVTPKhzoItH9mw/BLh8M2/itgp6HxypaP0sl5rusucYa40q/U9NbKxMWo5D8dtiAIjfpVEPuGbWu3ryp0oUyo85Mkc9VH45z+dZNFr2i5pe4HqObHAElePhopqwxYuX6TujPqjG/SOIPmw0AOGk4ce3R/Bu58IYY8sl7wAK3GluoLE+DyVnvQjhwHK/vlhwtby5hINZrhbJoi33FzJgFVHC5wcH61fMxI9TUJg3A9bcJF1CKBkLrRYyKzwZiXGq52B/DGbHQJF7jIzz7IGtbHNlbFiSTtKoMwvoxiD1SZG8OpFNVa9vmnndnsB/hwxSrk4ufUYTksMDpMsoqCbzybysuBMmCxn4G2ykO4l/Q7s/hCV76F7Bw9vlCn+cTNyAGQ4mHIHzSxKaKCmvrNeXvPmEEs7/g0F6RWsY2d9wEABwVkyVlKHFHdVjARjwXVEkrnVqXOhrI6a4BH0KyhX0KK9PxEl6nmi2u0/99C5JuKCBcvqbPVabdUiE2JyH4l1q3Bhlpxgccs73RevKe5479OLVNY1GkQ9FCe4MACtwY5MY0/hFEgJs3kCTFW+YyDnQMf2FO90fYMXgUg5RuIH65FTw0q5SE7P/HePTQ0acGXkZhjolyWzU7+MHAhEiaewtnrSD1jT9cMjJTdypzQiYhpONPOf3SrpH4evPviwoYlkoeo3cN5gUoEGzfUjw3UTTchf+C5bL0nOKto/C+/dHrSGJQ+9dO3wKQN02FwjcINxGoErwi5MMKVf9hIELNY/5gWTl/L2jSoV8X6lEOyH0lCtsLMuvCJ4WwkG13Od8Jq8ITtxH8NO9vBcIYyWNtuOSvHv9tBkMPCTMvNd/zlyAC9Qek+HlqMwDPGNfH6aQOs0neCEI52AEvKKdG51lOIzxUFhCSWtpT/94dmPD8o9lPlxHIsCiJE/4T9cEEUNfEkqlxNGAkzeVFABbggyc4Jdio+PercGXPRfBLUTmK9arPoFjbmcw2ZKauk+h/cXHmuAIzJLNqDzQa/ayUdmqfb6JUjWPHd+IVoq1qN6Kr2ngiKISU4TwWT/fDcwHuivLEIcwyfM4B56+Nz7IFYvhuuf3iDsKiFphzNi7Qfpmwn63/TXJqgoow4EsDLM0HeJ6eykjuQgElN6I6MN38SxeOFQK4iPKrUWQHwBsk+KiKCJvWqrSFfah5vqVG8NW0Q18c/FBk2nkz7uguQMAuOQ0zvMoN5TLKE2JDt4TLSAdSvOJ43j/HA18B5qoCtN66kAu5njUfa8zNhTCwX6glMz3aVdP6F1FsG5YfymAtuziUa8LFfIHKugFldGGAeyEG7vwWAhaXX0PErkJZQZmOZN8ZMBtXwDOchjaAQ5YnovBjooHTD023GLtgN1BkM8NZwkeEaMTRexKuj3LUX6Wv0AOLNwCXaerQYuMJJ3TqvH5wQu//aVfPdbZsA/Ri+AczTwNHjj6jVQcJQ/NGwS/nGPeU8Pu20qgidhutzibsM6OGlgGAFW4gSWLlHF7tYMkZe3ZTQSCwcLA0aivThFHPiyy97uaTHcb2dy2agB4UDvBFu+LHWbyJxbKcm2WskmePEXk3juyntWVYKfD3LiUzPn+XpD5uXa6dEf+KPHxALFUqYIWbp4shJQYQJJK1t6gzDvqOjO3SW9s6By2WMjaOO61jn8TUPTAJ3ocKnbL0OLg9Gr6zcsq10GXnM/yGgo0mKZLdnmSzOQQy4e6ITBo5+0HIUFu2dEexTHDWDKf9GHmgvgiTh+mH8d+cakDaGyAEvUsmN1pgcHcJE85nKBve0TU2i6XLFU9nR1jyrx0qyTR5VUxB7mHuPVrKsY4JNpCjtSHEs1AVPSwFmAsmRuDdTH9u4WY8QwK2z0LSondV6RH//gjBR4lRu22NU+acAbaNOQoRLA4d/HGFubzCHyxHIypVtepFC7BYRZUtfiqr+BBUPq1/ywqBvk1Lak2ZRuwG44WNP3rXoJkB42YxFJnlkVkdOqTWvlG/ZDPF9IbYJgfrcjS9GRI3KzdOgO4w/Uny0PejSHzrG7/XiuGgmfU9hVLylqMb7BAwdQ1do8tQ+K/QsfdxcK7MbgWl+yW0spJQVE4GsF8cr0YiE8znMd6Yh5EKWGkiiVJB7Kyc3wX0jhB/jJ8kcID6gkcugLlpZS2La4aUwwJdKkJ2Q+NT6XrQkfo5vfetUycbCSWxgR5QXQnHHu+UPRVnbZMONWbnnAeVm5Jy9E7cU9Y39N4u5MX2mLHT+cm+aquBfEfVu4RrQqWCi9nHfCuFMJ1VK1Daelf6UzEP9csG72O65HqLVUq/yign9QaKvFJlCCSqUZQX8EU/anoUwKDZ+EqbNOfShyFj8kFSeyus910uqdANIXBWzV7BnFk26NWBapvEr2/uWc0rQD+CQQLl8pHBWKjYlWrr2Z2oDV2OBiFuLfE4thK4Nys9jF7hFsDUT2ia/DfaDrHQGuDZ04LnHNALNmfGNkYVdgysn3RU1x/pQq8GgkmDp4KMM7CdQpRYAhQ/Z3SyPJFXtWsf7eJbeUB16AX8k0B4WsefT1BukQ7RJ++QZwtpCna/xkNp2unCopjMyCaW4trUG6EyLdT0j/Y5nA3ZR0xwbKQRrnGOvEeJuKcJo112MESly2BzQu/r0T+Eda7PRiSJjcDcLVTA9gvzHmyaUQTHBM3scG8U7hTcHW0Vs5JMXnHG01ixm0S6xTBiIQ33RGV4m/I7rDza1q6BjVVJdOrAthcuq3Jxmhir8y9q8aF30wCHMD2vPUdTex8uzci7oVxXUuIAmveY185hI3jScZi8MdUOKAVgj/hR0DHaQZ6LMS+zq9FBEDzwYi+7KoY0/fMiUqa831dxuWqzX9p+FtkPaOLCOoDz6kIsSCPwTwTx64ofuHhdFChoy/O6yB7sSXYK3mh7FkKv84RX+4jhYQdStfFENgVyVK708XVxWlcLNhJTp0hc1Ay80aYA9nuQO5GXk562IlF2ZwdbwmO1gG5RXDUjSLWrCxDmDV9iFC6PQpdZW2ATcvZyXWmXsOF3nNCjvxZV6KI/YlDjm7t2ejEK8S/kuj4y6zgF0tPCBGoYT+64x1A53N2dKife27uw2GrVSaExGZSZC+otgZimwn7v2XZLS6Ds8aGfolGjxBwvj1IO2HfyGiI0oUDfdQrrdtMnJo5asoReAQTZglmFBMNH19KYg5HK8dEx7o7EsQEYcgnnMnofwgKeNVibV+lanugTIE0yf9xT8cpvRwyYU85lG/kX4sNlgOynfgSmPLdzT9U/hjce1AWjEV3SO9XKuU/ZZQPguFyH6CHVM3sQdo/Qvay5lo5O57dW1416WRn5x0hVwv6qaydJe5HLilkNMvDQb9cFSS85HDukPBXZIu3rQ1CDj2zMn4dS1TPMltrbqBsKZvG8zbGr0af5cKhHNJMahrthT3h7ZbGPmvdoD5eMDsU2cnDv6bPrRXmnDR+IuUbc/7dFHmBuVZUuZ46a0BhW2xP0ybJp//i8U3MAafn8BlZmSNZAu3DTW9YI1grwXRS+aq1gr07WEglioJh4ZORUdNj6JpC06nPD30C9TIgNEXrb/19jMlyMO3PkfFgAacQku/RBawZM/sjVDfTUMNOMMb5jgfjT1vZEogI8thAKqrMbklKUFfB7kDdh2LCYtBgzDr2rZ9dzd7nCsU2p83nBNFSdYS4L1/vsE9WWNF29TlfveXadu35llzvlLOUULqvozcS7i+sdaKzuHGPG6+vzmdhid2B1Md1kIkOKhnG1Ci7mJ8f3CIIQ6+hG/D1btiVDbJ1SMdxzt4zerqC02LIjD5ZenuHaoZRiFmQUlbwTQunUbK48AekLjcRlMgcLE5mzSvPnLqk1lEl1XFOr57XPdRDkwN+zmnVnAGp2Eu92LTUUedVSzvCVlS5//5378G+urzPxnRPttFxAw6XiFp+17oIVe+7ebxsJDYERI5CfC1Cx2A5gQOXGWvN9fgQbz0yb2MNhUkK+qbWyqbCehGPL1dN0OGevlON0JomA0RvHqxDU6YwsSctL7cuF/s3BrN9JP8LV+MA8kZPWBxywwOl5E+tIAV35HIC/MncAJxHhKd3Fwtrb4CmDnKIm4Awv/Wn6bSj9gR5+9OitlEnJwKaXNqlViHjEw+MrmdG0qikttA/FgGsYEWWcCJlkOLd9QpWdyevmZh1Zox4soklpTZ15RxEB/4orWioOi7bzRcEmK+K8W/n0NZN3d4nikZRhn+NQAT/8WMdhk2/u2ewIbt6GZ8pivNrKfsBo+1XXV1rvdgkAZodsdrvOCEwp8iYaERgNVQ5Q5sDlmH5giHzO5J5syEfB329FQ2rtviOALw0B12m+fEfToNqs5nGJM7Z2u8W/bm+jhb5kCke1SjDKsIaPLfltQIOlf46ZDnY1A2T8d2wXQGu8TSXazZB2nOUCAA1cluAbSJlBJhUjWePivh4HCAgvOVL7yE4/ljAjCCHMm8WK4zvBFCAWYsDf3FPn429gugeNy8kQT23iyWzQyeWjJHB3NM1goMOWxGsJ6lN+EhgL5EqHiZmz2e14A4dJHFxzw7ZFatEbT5N4S3egHMc0w7m/fOOhL3Owo+ehPAnYdkjV23C0IdCCnhfcuJK5NMINiJ/wj/zUwS+azflHR3/1xvty5t2eq/5gh8le5brsZjFP2uapRxwX51blR9UDXWC52H+z/uqc5419T5Tyj42X2iIqBV5aiLN/XB+0NVJi/yViiAzatWaCnW3JGSVp5vcWp6rY6O3/ESMw/CKSyGmXKklIeuCc8t+lNebdxfyrjolZ97ud9LsnAOJzZjRttOPSfJnEXSO6h231gQSAtsA8fHYTSRhd9ozoeSOtCdwdPoaDv6kejEraUBL9mR3jRU2QVQ/j4ojrcKW1+p6UMZcMqKkk7FV6hMbMnXFgU+vrukDgD0qK+gYtAlqxmfd9i5I/BsF2Eeu6bE4Qg+CdZeknmkEUhXYBsZzlZ/WXNnOIZ34B2VojyGv/CqOhsXd8qnX36c64BuAPXlnq3tyoRZstAX/grlXWvG5sBrkK9ZKCMANFeLyNTubjjk4fshZgjmh+HkKbz3VrYb2Odx/vW7gj+9gR5VXXaLmaJXCKsDFVuFSZ5BkvbzRM7seMDYxj85fjjN+9b2gi4AVHzXiZN/TUnN3LQSJ4EtdATX6JmDBjz2A2v4gR1L2XAATX317G/rFYKBK5yR4ITXUY6ruPspE7SKunytUvAUehbeoyxdmRJKHU7z+SBLWahS7M4PBHFUryMi98TRb7PMlFo1p8fC5MQidDhvACBdxRtSw/EfrJ3pyu9j+SEOWd/ylaQ9KFo/1XvuQ6WzVQWEOXmORJ1zxMhUhAqW4UVhcRf8+hIZUedEyCXT3eziJvNyPAYylBqdnbsAsT9kCexXn9Vi6fZTqMdvitabiw11hIWwQujZBbUvadldaQgN9yFelsM471ssiwnRZ8ZW4tjWsG8Od+8Iy3Z57t/fIhbZawZmnrrNksk+W4oPD6SPU9awr/xJ9CRzNtdJY1i09sXXGwE9MwT/gMEFetETfCaXT3I3HdZVIuRZYQ+1cHkXOvz+cfl+GVKsW2GLQKI953Y3o5BUYrj1TpruFq0mG4gbzJXoMuQym3clqlMeSKzuhQ3GpEl+BRBWDZ1F16BGZ2nbnS4YKrgS3jfl41/E6wOlbmm+2Kb5XM5JH3lxPiFpiBVsJMRnMeSIDm7oHSRpnaZ/Pt5yKCjXsUViJkrKXoQg67XxTIwy//eXd7HUNsxM6budBfn256UiOKU1BnIJZCCS4tpefDBKZhoSan7+gIW8TIz9B5oxVmjOjPs6UMe76dAim3XoNjRUgjCp3lxuJk2wO16257rVSF9rg434BwvpQMQmG9+CcooOFQUkT4pup2HkK58pJIj53CtUCLf7WjyPD5QS+gvEL53fb54uGJu1OmMPLDVoGrRbvFRIaLnClkPy96OZ+9cexesh8g2rkac8R6DfmNTIjkUB4XjyAnAqXsnKAq/cSpjzj3+RxtpcM3Qu2AoHawMl/NXcQGY5PCL+sCxSSDBcXZUXDzeI/tpTWivhgK6igGLvOsboqk1Gy8V/cuS49QGR5GmKtKm7U3EcMRnPEXqWjusOKjJgoCoWHpWun+sCA9m7tRI5+TBfgG/wZvF0uUEMMBVW+F5GyfMIzMttMly/svG7TriYHs6RICNmc4a02dSWX5Nj0QronbN4sHolMSP/6vwF/SISVn0Zh0Dfd/sSVPlppRASyevFykhZI6KSwFfQIGpExR5zzsT3R2gfdqdhHvvPGFAgS684fv5Zkco4s5G+Q7RVJ+jo/v1zTjzqgkPm08F+NGabqQ4DfN9WJZ2i+wenPx69nSr5jV3W/jx+wD68ZU4DixrwCdVB/Oni838WGoGz3591m8hkf+xD28kxnI1US9e1ldjVK1I88A5NsiLTMQzDhVxiIuCfLagGDKE99fpF71q1LOMkKcUzln9J080JOIGK1UuFWS47+btbSSrwv/nZp/igAnOWV3izFL4cofgY4MyNkuAi5vrunooKRNtLUXDNzKI0hIko2ruFLcegXqn98RPbMR2Uia9rqAgUUUaE5tn3a+ZrUHcp6GUDtOnq8mIfsDG9hi184ChL8ZbbFhJPPKXNLufrRJmZczQVN7y3AWAVLT/IPlIUW4+/y2BnH6G9pdoi23BpjUFiDbSwybPmx6BoFI2TF96CwXloLuzb1LRQZP6GhKEIi17gXUkel6cc63tHusjqId+X7bQYZesA9CqcRMkeDo2NMb4cmAChQoX+ByBRx//3+YOyJlPtabKrECC49wgCLkYRnMyH2zhv1zlfB/CY5idJbDDmCErg8XEseo44fzsPitwrdaA/3rrvt31EE2dhEweCTl/Cm7c46QcvJiqdFrmciD7PISWYoaPE1gTWgCQEusPUU464WcAjYaRpqQGdIe06MFmzCXz+G1j9QtVrbEn/Dcqv2koKv8nADiP8VtFMZ3DIV/15xIoH6yYdBRAD5FxZkoVEmjhkR649aEAQFZ6UlFV657lkGZWOQmqM+cay2LnZ4KXAlsvmf/ODP4kqo7lnmppU8LVpdAlrI68XIklXlVD82Nt3H0srB6nYiIUNjqo2Of/Z+8C8UYiLKYJ0s7ROGW2Y6lI2N3V5sah8/uNepoV3TNPIwNPkaYlbxsUQzFojj7B/I5TWbSilvZU6w38V8WqC/M/Wv6AXQ/p1p6aoP9KVXUx54DmmUjqXvqM1DFefo6BHpdUs39rJkFvQIv38Xx6Isc0YpFZIf+C9bxJyHaC6JyLHNI5O5BS8EtDrgBNEHDixJfJLHL8vhNGbYnMEHIhKWmjvJ1RO23Y2ZHaNiGyxjCNSVRI/75QgLbFFK2tDJ/76WQAW93lynIN46R8t5vWRf3SpeiUugdgAvE/huQGvFqks3pPb2F+9jyYw81iIEFqAymWMcjWZNkXKjtMTZ08iIWtwOrciCM/v5IAEO1qGUkKLEiNz2CYgJ4H3gP2O7WO5bldCg/CTJMe1G1bICCSN0B0QVaSzi6F5C5BokA4oN99is7GlQVLSncwzZ/oMcFRXMOWLNwaH2qWDBhMYNbm8lF+XkL6bm5v8AuwSQms6le/U2XOMlRp7Zfnm4dZvVmgzjrkGd7Ta7YHzM5p62BccHZMJr1S6fTf5IFLSyk4J1G/LbQYNwcyNI1DOeUtnWcqYW6Ma/C6/iUneGntS/7umykByW+7Ty0WoymovQ+yNeThK42q0hJJDYBWn781qihEkqVBtrbS5HOIoiJR3WHUqtqU2X/DgwfheXZB9L4XLNh6yfA5KIuS3zKvw+Dh/pV06XSk8smBqPXOZ6jS1Rp3MuPvbVKGB1W1HXOUmQwknu7g/qp9rC3P69lks/AEFAzY5Dc2X/CVqqELYLzghdSdMu60aNUAjiao579QeKdpvoRjF1XXV7qAH8ejpTa1CgZYCPXueaI1FePEH3iZQxTsjrSbXBOKjuDo5W+kZcPQMPwe0C0aMFVgrxUFXbWZefkBXMMAz42I5xTpzVlN7buxWCPvp2dzz/4DTK0imlRvfS5dCdAfDF+NN6YZsHz81TYJ/b66kQaOjpA4gw7nj7+u2NJV8IpWhnz/M5MCcNxVOqPphz2Oyu4Z2I/RELiFZ34TUh+2yQ8ZRpmmW7XyI+mVF2YWgj4o/N3zQKkxzIZicgPbzFnotU10ipOplauorXa1wEG97AWKQ/6o7nwWhNOSbJWQSL5qY5D1prLegTr7KLsUr5BkHZ3iIMfVphfAsTl/nSEqnVTRj+zCcpfidxhr07BIyQ6Y3RfkMVr0S+nUFlBB5W3M8V8vaFUKBaaDKc3+udIKYKBTXtnbZF0Xmw+4LL2P/SpTrtsql7rBxN/9wBB8TxhQfOF0imbOrMYKBjme2DjFWsympXfRUOZN2lA48ar7lqOWiFm3iHP2nwbUF7462L66OIBfyjDPx+XVeTMz6QhV6BrG/Ei5+RmT3Gk638YwNksYwGmXs7P1xx/7XnyGecLfhjJnsB100FED0vq7+14+IJejZ28preow2EQCJbT7uhhL04WQYUNcAavyswVcDn4Fo8ONXAP2vbB2ZmdxUtpw1sjF4ZCtZ9r6RvJ6ukSRgSW54hhTL43sBhPwzo9BtmvU21DS7SlGQztBmStIuOm5RIleXHLcl19hQi5sGWsjAJdpUv9M8NY1+kA+0dVpPIgKGw8Ge3fskgI6kKyuWts7i8DiHXSylaffEl9rXpBQF0fUIP2+ze0oBD24bnTyWG/zJAqyP9TOdsfE18l9qWY2EBw947gP3cgDIu9zRf+2i5fWPigBHIctjf/KDdu4RRG//7eZpzgf4ehwotR8pD3pKwwhMpXtgqbXiVGZu6Q9D6BxvQK+u9Sn+NexG1sgSMe0VX5Uqj0t54taZVJElVOtF7pSqeE1Xlf40oSDELpugLwamXRr+0fCt3zH4IjDK9wP9tao5C+DBIMTTUzjH8I+p2KEW+sfSRwr5klQAQ8ovDG0+ymqipVn0vc0X0KZGKxMMWVwpUfnQ+KHu0ig+laC30/iyvmCZsmXgxCBjJXIw4hnz2eUbOFlSj1UCbmTl9edBxptRg1MqjPXMSkVAr4hYbn5t4spNA+VqOkfx6jrNwRmwULzpDctEEjss91pVRDYQFC1v9jkgjw+Pqc0JWsmFYL+nBqeAOHy61Eaz0FJ/mFqs9GbP+F8KaXDmfz/W8NLxw/yAz7FbnIJTRghyK5Zx8DtFSixbtrFOcixvC9TlmUzItOJeQFiGZwzy6J8R4qnpROgiXB86qHZCo7LO1B2z6ZSBHOMNTqmKKiPMvmIPQZrL9xOrTDsS3+6n5PzSP+EVrjWcNBgRUBbrNMH/NKHoAsM3krlQMOeZ7KE6eL36TAfCQpl7VmiQbPPPqCzKg8rA8T6Up16/RQqETAcprCxHU2G36pOTF8hcN+DmqjVxmKyku03D6MYsSpZrY8eTXOIjEzfjXAC1HjN82/5XNuOYP/oAyxdygOrZFdr6zM3a+cSNBMWrNNXgTxRTlSs2kk5ShA0WXsMMTw5roBzMEyp4oLZqXapMKzqvXveM22FvQ9NAaTMFjRgAMwwGNjdaIxC8KonAdOGYXU+3JUZNIWzi2Wb1AUZksmbsmXr9o0qhlaIh745ne2ZPyWPF1XFBTBCbRaJkQLbWjxpj0NhEVYFN/tskU8NER1CHDxVbhKTxQ6ZqrjMDIIgOq+ecmCPz80WrS43I17INBv4Cgd13bDkqPfU771o6rcnm67HyEzoOWj0QC2RPcsP5dBgTlu9JJrzUhbfV/FbIsm7IvqXpyTeIgWgtP6rQR+Cp87VHzDaOOiRvyFKk4KVAb9YFZCKD0PVgXAIvrwIPEmT2ZcR1ead+m4n/gsgTuer7TbZ3KtIs3ihpgb7CIYQ5m3VNcOri2HWAnGEqQRqoJetxwKdh0zGvMINWmh6Y6d8wCfomwmp2HxjTfIPaXy1vAG/iiwrJ+OmuBX+agEDLsxmNrqqeOvPJDzcjHtqAuPvJoSPrV1USOovd+cBhFm9GGLy3jfDKnpuBNr9y6RvAkN3KsgsqEo1z7fMR/aNNDulCjnCVOFGi5mYrFLcYLJpgiZJtoFbh3sW/VvMF9l5XnHubQ810Q+F2E/+tNk1MOP/UwiPYR/3AJALYsvQbU8RYdVJQf0PSl4wVH9aowLexdvrUWczWXIuWwI4pIZKgP5/tSMYcB485jYxWKllMGB8jf426SoKeGNiUSmbV++UamXD+PcouP246R3v1y3pdlEpqsxECbw7mbhBDbKLLKkDEBkrhrwvS3sabv37WWi7jLwMaklObkLQpSYA8QLyLdjrjbB8mygIzKDk20UqETED0L251twaCAaSspVvIihaQQJZtL9KpIFeEk0vvli/t+iNRslRkmrpoEXqBWjng3P6L6GEOo5H4QXkLArcKXoaHN8y7wC8HQQZ6tRy/adX37fwTP8a43WaqUn2qCcJ8a1MauFepTzJrPpuzbWYAs54Pd7GJTmsg61NP0P1zn4GE43BoB4O/qsfEmM/1fIg29gSHnBFTk2KAbf7nplzXULADnsLoCuJtSU1prQXwVaje7wOUBvQFKWWF0b9MxaCnQSlKX0jWkpIkK8qzDzbnUea/hezW+jX8I+Q5KBrrHKGPB64lkWQ+zVnhbxDlZ+pmqXFfIKfbNcylKAseAwebiZNocjecautDTlV1zwPyNlIOgeADU8fXAopLaIkh05CAuwLKxHG51qj6wci5LRtxH5TGnSSkXCSykd5fV2gNBj3dP56y/gn1pEYlN1ok/MhBUNQCTWP8FAP6kcWcRjjOzRGJSBoQUWSf8d9T4ZZGKzdbnCKKTua1VsELT3XIb5rr9SRjreFylU/0ZnBTpBqU1KlL+DBzscSM8WshS7edGahoqTcRJi4nMiuECfXpqM9UzvSaCjxqsfgaBmg3zTNDgbzrQLYhP6q3LvaMn4UC+1Md+qeuKVdCLYRJk09jUhJjM2pUA81ZnpUBojtNvItDzKZ70hbdfQuxhhmMYM1UWd2rLq3DWFIydk3iXxXFH760NGLDpqRCkSsTIecsHSoHeFeKtbylMLx+TtksZ/6Ev2OMq1WvIDyIc1eWa/6SbRA1FP4zrlBz9ZTVO+3oYs89RT/i+Lpz6MB5LA88jAQUDhQsOmowVIltP+yXkD5e+z31iNlFeAYFxVRB6CvdBBMpW64KERzsNG/EedsKs1KJ5bW2FKxG3+RGRbSyqLFTwhEfAjaa2kChhf8P1RF1Mq5722Mfkzr4ORk+djYDFecGogc66IhExoIgsDfVbH64ROsfzeO/bCp4Y5EJm0j95fwGZL5xGW2OXqaCvWiYW0b7eCt7PW5Kxkx7utzXWUtfKe7MalkE9rPLtcfIZbGIru9y5fTxDn1zIiUxYjeCC+5XMzg+PKxD6sBEeNRGvQdolXy4=","categories":[{"name":"Investment","slug":"Investment","permalink":"http://jeff-chung.com/categories/Investment/"}],"tags":[]},{"title":"Real estate investment reference material","slug":"investment/real-estate-resource","date":"2018-08-24T02:28:21.000Z","updated":"2019-05-06T04:24:35.492Z","comments":true,"path":"2018/08/24/investment/real-estate-resource.html","link":"","permalink":"http://jeff-chung.com/2018/08/24/investment/real-estate-resource.html","excerpt":"The article has been encrypted, please enter your password to view.","text":"Please enter the password to read the blog. Incorrect Password! No content to display! U2FsdGVkX19gEwdPaX4X9POm6N2n7Raro6umQqBqCI/KnfZOfh+asIg50GBV0ODNxCBUyuvecCwsda4r4pADkLLJc2XGOAnV94FWVU6tDVIzMdQpqlYy3jP8bzgnJDGb76el2GR/AAKvr0Q0DSUyMQa6P5mT9PnnNXNbSdMP9ZOnXIlZmbkSXeq/EzUQ3EtqgjpBb7dRArYYyf5REVv0otF0NsIpYHaGsXLaGdwR39e6IU4hn2qv9rxeduD0n9+Xn67HHytVsE7MaiF5k6Kv1CxIVgdblygVGv6yH8XB76ZodMpEU+qE+gr0dycd0FdohmfwvgLV74w8mtjWyTnHeJ+mmQalWc9NDZdXFtX6t5OxWCIf3xCYo8q4BWnFoObRcyGiTSo3BVyBvo+9Y/kFNWz/5u5E8C7QXqcpOgCZ48O+2NhWmE0gf4yhggI+FgVjEQUtvDqXkKoVWegkNUVXSrSehr8KYURDdSCXI4CbsoRLRTO+xLNWTLrWyPLHQRCMrcKXWZ0VSFpMeparazMmASotOoXDSq/97doTMGiqj3EUyofM9VPe+4HzfIytDE/9DsikVLkma7p/DrndO0uVG17nCxGlXqR1Q/hcHmvFUaTcKTsqlwquxGt9LRA9K3/ORPwzk8bHXq6NSnjRyhQm9nZqFyNr8FEij59f7EvtT6IDKZMNAtoNCUgb2wlZTcxmuKrtoQDRmN0yX8HuSqmGTRwpdIYbyYUxIwAxgY717NWxXKMD9dHlcup6SIhNp4LzTo1yVO8ktsMD0Ehxkyfmg6/rcPluBUwse3zsLnZcjxWsDS41U/W3eQJFDIMzVPcc3SWNlGUhYqPYjL6z8Hjuyg/e0ZnSTnXnuNCWKjRUf2KxObU9LDXJw87uEPhN0dQZSPVAaqW2Ui/UXIvni6CPruO/R/txylW9/VwIB6k6hPb5ateiL2ZcNo81jQjkiVPoxLmqc5y3uid9EG6mPIxqdpJ1zNO6dUl84K89f7vcJcM+MXLzyqvGXSr3MfD2iHIkea8PgMGvl4bcFDYXLs9igYV5L+QhH9utGJ2FGSV803GjgIngcHE8kpGdw3vYcbrv2QXy1c8t++sN/o147YWCLyA42fWmhYaqKqDCFXDzolapqsdQVSLQGcjlZTXuAJ++3EI8tmJhDbZE6rTsFN3Rrn1kBoiY/HTrhR9wr4LSmvlRVM+vrcGq+4aSn9dzqceL2rIVv2u5F52Ni+M+h8Z4Dmdxbv4zahbgv9YwdAI1wZb8/pvmVfm8ZnHXaFKOvMMsJYmv9wDi3wXrbc4Ilh9ksCMqlLRdY3KAhuReTR6ixYUAlV4cdziYHtadDUS+SGm30spfic7UbqTq7bcthNNpsNl1zTRMe5HtbkjyaRTaR/MqDh8RZOACfZ6ECRsbEHBxczBnFhnWTP4CNdPnJ9T4WHOkbGZI+VwE7DsMFEfhh3+39JHE6Ed+9gbEXu7qG3nz7MMNNx3tfd/dMvDB9ZYqUIGlgTlply/gkA/X1el6PDwP/TodBtJ1AP6XoYcLEAj4To6XkWJrAI/Da3CjnWHWeyFfPsf2USld2ObEZks+dSozTEhm+rxr0KIRXd6Wf5+KBOggW8IRC3YBoAjZBs393wNZMDM/1sjNUP9GfIBljRQ29qlryIgpFWzLC+bq6bqwH0YfaGyYYFFB63l/AdYk7lBUmlKd9Z6P6Eg5UJYNpxTkk5k5HL/Cx4RtTd5hLuSXxpGtejJaDMKmFDjaE6e1bL/AKhSAzGJJY1pgUgFwf/xLP3Mi4Hz1duEtkTZWBLjF3ySpdk+h/qBJF1pQnmjLAKJVErAZe/GyHoa9fTiHDpk8cXLwCaGA68cHv5HvqpYFoKn0xympMuOcTD7yzpDHYVAGe2dTqLPwAwE4d4kwuy7uEQ1KbeCJdJB3V3lv79qOK2REG134EeYHX7bK2z1S9ZEMRHMrzcm1oPB9MMXqgySD+tZ8i3RqIt+PV+3FNeeA/FjyjAg1/usz3VXR1RZpdMZaY1/nRBilrM/rS7T2V+a9Z6SWo3Q6tN8oUkBaMGHUcNF/zyLsrPLFlsPlpZq9y8dkI5D9AH5tHsVTMu8gULRwwQ4TGfn2YpZrNDXQC5J7vkJZt/JEs7fh4wer8DwB65PgqMw4GhLYShko6C+U9OPpqZILhCkQmbkSJnKKTVMZ8mfEx+fwoTkBevfWoMFQVccL+8jHE1eM6c9961iWZ9s9tmEThJPLcTMT5qLXyi8qCCjH+sLVzOhzxJr7U+46k2n9J9RtgenC02T9wIM+jGGDCfVisLI554b9GaeGIlvsyqbmQJvviBXcVWfun9VLKXML2+sQJltf4M8EkDRVDuFVsRt6URbcMnv/A5qazIiUKaKBbEnw2jt11ROliu1Mqgg8I9nPc3vWv56uGYhfBwvDGJ5KXKWlMvir3APOkElfBAXfN9+fAM3izXeT0RV5Jx6846bTF59BE4xWCvwKenLMlSuTkZCtYBIfqMICx8Wto+lDrGIUpxTbaRA+WwtUyNfWcnlP1Ynd5FQAzsLMmePn94oCwfBo8N00lAIpVpBCt2aSe3kVEJ4gk3k3WY1AFtzrFCFuf3R5A0xbabwBNMwDl9MkE5dGi2jRR+lLLPSRxMAVhlzv32+5RoZ/wEERidGv29Xi3AQ/BmCX3Deq6fI8WyB4sszXFKrix8gP7n/7wy4mMuJRbMu5i1sLCPQn+DWCTghnRaGJ+OOZJl1WY8NTeNRKIVMjhBH3OnLOmpkA39qFdIWlGVE7TltkcCPpe0Jh7oyIFbk+ZbEKsHhAOuzO4hwDRfUCzln1ZHIM8rJ4YvGeypqbSK4+bDpzwWZpTZ7Z0UrBaDDV4huM6qQbxnj8rax9moi8hwli6xm9CMvBF5Vj4VQtT2gluRy8KsFIFSCD23QP2cAHihMu1hO704Af+pXJwjgHQ5f3kRiQZHOmW/5Eq9sv7dKncgMgrAxLYFa2wyTIpGqDMvPqv+ObI4RsEdSScMy3WE17wX0h2W8dT++nKXUCY1RpeCXdGI/sG4dABDA3MRSPWElDu6jbDX8MHUGv+soTWWVkB86rVu5Z88Za0WtUHD0woGCrvgeXCmxVAy4bMEQKDKkfBiJ9slZWSgWw6ayGykmhaFDTAEjJWW+aTlP6NWIDkhq6ZqjqvoBHPMw0sEgWk1O0kn0Z41+fVVnpP9VPBJBso07DD499naN9CihDmCZn1ZWS1m7qOxuED460pQaZrd5tl2Dz4xduxi63oTu6ZWH4MCqqALKJdcwlobKoBUli6HJkP777EJAoI2L7/PZdoY9FxkjirpJr/SgVBZDYbf+p2d15W8R/q8VdsQ8Z5PWSPLp8X/kJ9VykELtZyfpyz45Tuz0BNXXm3+Lj4ISvPOfKfau4RDtEncG5liGxZ4JkKnXq2nMjPySQG2apYX2nzOx9e5z0l/2oPKqMO9j+6mOvs+sMrv4J5DU1iMoTS7r8A4gqeVqH9o+GyUYH601vCXQRibXPqXJHnJ5vhj/AbcvuE/hxWppRGMw1APfMwj0FmpsDXClyMfAa9LKKwba5VDaKz4IkJLw5EM0nQo4IjbidKGMxsDndlgbNZj9nT54zS/kLPLYRUd+y1sAWMuOXWEN3pHXNGIar7V7S+C8DE1xBu5YD6ZgxMzs4ljJw3Bn4prZuwQTyKieZz5gLTEdNqa107hn2GiTKlvNaRn8qRDCxbIg3FSZkbNkLdjQmCoiMI56Ej9uLu+ulyjaeRH32UqKa0bdwLcYqNtd99pOHwQ+asWnNZvRpz/9Zt/4AQsic9jWs2DEwijij7RdVKmbrM0VeiBVx5p//LMksPM1ycFj/jImeEMhoSEsOGHWp4obg6KdgF6JQq43TONh5wuOibhrvfUKcY+WRHWmHqFdJTZ+P+hgv4NbKYTnmvPISs9dvAMPhe19IgVlWB18quTQbWCEuZNMtrP2DQoPPK7YEdaFegoA/9XDL+RxZOyHNvRJeQhHaSg6WlIMaWjNpa3GZiVZf42/Zlnh3PLc44aXcX8Uz4lM2NTieDtQTSO4nqEqVkjDnER9rOnZu0gwC7YAAlHqWHx461amiNv/NOZvWCZBK/21SQoocnaW0D7Vo5ohkMLm1+x0sxoaB+XTII96wMbSw3Zol+z5Xi0F37fOFuwJ1BYrJoEYXUjpA0ejUs/Yonyd0ZwMPTU9yJ+aeNjFgK7tN5ZPhQqHWLsrFhJNzVGaD+2vyi4dq3trErz3mopusdddfw/5haNJHGbx1/DUx1ve8XivfACiC/b8RTKtuMbf5B6LpFtNc6bwPmBUL2L2EXcj8/LGElljNuI+9IyYXVql7hy0ZDv1ADsVV0Qu8qihMaGntz9t1hxU4kEQAwO1PCNOwJW3mzjUemRxaTxk/aZB7UbEH1ItxalhhrCGRdoSCJmOxDbp5VFTcPxliP8l7k3kWDQ6ZryB1NM7Z3DKmcXL40R1wdewcvEJsptN7ldaOFHWj5LiqPTHmL7F3VZGgDhrslKDJY8DuPuMppO7CNe1lxJd0eRxtneekuhhfa8i94SjnwBN4+9F/eN60mMT2qSGa8Q9GRhr1hBD5jrys9khFSPeo/uocyE1eF8+pGQxD/xW88wE4VtwoJa/w7RMsk7raQDTC4XEaAMiXvFFWgRaF7R2f2vnLfZh//ksF52GpdbQR1U9M7bP4tb/w6GMeH38xYFkZhWA8qq9FWmSsR3VwrO0vdygIeNxrEvgbRIslSx0cze/hI8+33nK5nLd/K781Ae+nysVmTHwRjax+niMZPlDy0j9P5usj/tS1qeBLSN7R+OHUmQdnYQKFYjkmJvc+86gCSPDhlvf4hjayEfHv91oEcvyKVHx1orAd6wPUqJ6WIRDiKoVcsWNTvHsGrBAiRgqMq7PWCx8lTQ41hk6efQrR1LAzsI3AwJyy36+qHTogk6nxN83fVq+aFs4zSELfKEzczeqQShZ9DiIM/1vjJbfc2z2tksr57bxTfs+MhUBEC2bMTFMDTmeLlHaof0SHC4B0aygRHVZPlOoVvYrOkqulEBJjmIvfLROhFmMAKvaSpg/I+nuJPYK93TvMBQcI/y2NBqMiAA7limoViNyXAnCIOXufd5i/PiRiybFP9R7YW/3j0vT2cgSTbb13BKDJn186vNzomVAsKZ1GbKe6mwXtn2cIXhFB+Yhq7UyVtBtF38xXb2WgPdQ/BUhUCn+QiewOWK9Ppji0R3da2edHcVm+o8PaMy819dTJTMKBxnH1/7TKjo0f4IvFMgjXhVIv2aEYx8LEYYRZcKiV1CjT5NIA7Pb4G9ywitrP39dcm2ZFZPxgzofc9kZsLwHFYhA92vtK/JDcY4sjpMbNcIiq3LqxLds5tAVCdnoziQ2TU5/V8060Mx+1eji/Hxb1alximXIb7Hh9hWNNzKQhpMJyxxIE4lOm7t5VA/bK0pbtNCROqmg1D2qml6VhsqAi9/gcFBytwFeolxCHCooVeu2+nSUe/Lj4b8o8cRWl1zblmP+2/r3gii475Pp5IVzLkc73/Ykb3p01rJ/LOdEawVF9SG/Dzuj8R7HJBL8lmYtlooEWfcrZIfS0ZjTfWCxw8STKMInTopcmO7i+9Ter3zlm6X0d6jJSR+RC66KOr0F6Yq6a7p+nKne5SlpxzaZBfXvDy4pSbh7LeatEhsrM7XbHWTvS84MVLF/7c/X5zhKGnDUAkSbKcPX7bE/g4CcoZ5NaWmjUJigniVp4SL55+mLcTjVJKrIyV3OleUYHxgRLdtts00fh5bjYivG7bCDdvxteO4dy8K+x7ltHemSm9/maCsTjX3s5d677lwYBnPGnVyhDA4OQoRNDV16c3zF3QteeyO/nL3wf2OcpbO60Mokp273/Qf9nbSHcBUPPqtcfWcHnl0/eDSbLLP66wxSKT8V/aa2a8oxuT3VBl68Qwbhb6EQ2WhRd9Gj2VaSePYqlLDPSiz+IgAxb7sk9gDuyxrOI3hNoN97VYBR9IDIY+q+daGVycTa5kgmsmXEEmQOL1d6XTk9KhPqfaSNIsfcWPAAbxS5dMgU7GmhmeMZ8ZQOgUopUep+SXOnYBCZ8BJhNfW54hVkmOFYMkjg2kc+x32tuR5+YYUV2uz44kIOtVAclasS3kQFuCYj56KayT1krOq4qmLqHZCnUpH2Ht2I5dSAAhxcDQJkE/H7YT94NtBOTOgesmM2bbUyHYx6kR+ej6v0pGdCvJqDSnvQpKYV+rQwOYXsE46Uzv+Gz0nGzgMTUSnW2H9aRnrolpFV1AVDWkimA/uFGXW8j34LB17ZJz/ubdjybjIRPLN2QAUg9KW2uS3Iwd41GJFtnDZ/wEBAgI/RUBCw94Tw5Sg3ZIwRirMZtGQPyJkSS09F3vfzMbqTVqHWjp+DSfoA3AJxdkDeRZbRdebvyGuHakCGISGGcxPGeSgv6ZqUnLi+VgJmOoC6y8+zttwwBUmgB7WQFdbzJDtX0FUQZWZwPgpG9ekBmRlTexXzcbWLPFD8Qg7z4A4yrS/xmG5T6JnnpyddsXNYViGi28OpsvHi5kN+LPOsFhijyncECDQGYhT78acapELYVHWhrRfv4bmjhWLxsuhPtCwfnMqPPRE173wLWheyhIw0SP8dGGIP4rxlVuwKBZVGJ+z++Jn6K5YBjYm4sDpMlPJYgnXCq1KYwz2eg8z9rEGmd2b8D4ggygIrnOlaHlH2NToIIvRC54nj19gm7O9wovfblxX5Krc2hKTk4lkndudfmHq1XxLyb7eQw1lo5XljtiGgYy+q4qMa9SHdm0JuvQHPqFB4YQCboGXHI027DTzfC6hruTbzHPJ13IWm6/eQPvzqcQuyens/eXUi3maOivL8QgTFSdnh0qhWLoyghfHC6oxNnr/hfL33emWX1gPRYIXF0rwn7EAsm4evtDnKHsor69EjDYKVGocNfziilb/2lJrhEY9SpBYpXtTOX1UFI+F0H1jTehuqc2Vdp6H+jfXIqbC6QbrlbrpIa1IoSp1033gCF+9NZJ5UKQJrYkP+Z+/KrtLZNWzLqKhPJ77BgwvgrOR4P4cTHE8/qHQoOcpGF2SOR1qGnEdjCdqfO74+0K+8092Iy6S1rlZTwxYa7jbiq0TT8r1EGhwytPyTpNobNzkxv+Lhoqw2t2gIy4yPFdMNJoDJ+JajEZugYrg2Yrah03fDASqplJmXb/Safrl1hyF0WXU8tJRvsZHUt8cL2uNkS1gQ+z0QQnvuRZ0/ksgkXCcfzhsH9cSG6vr/WLyUOA2IqnwX8jgZJlJzn673Y9071FgfpKwQlza8Jbh6TYQ5l8L8x98E5j1w8Ueb2ycstdGFflaNpiQ1gBaZHnB4fuWTu1sWuKVhSKTkmspt5mG4as1ocA33Xfq7/HFJoRJcUyvphIqFESd8WC4PNK/eYjfQYlmJnuvc6/03EAFruhgEzc3F3GXsx/ZCGHhoScND2nijk/j3/JONyaUk81bh8Fvyic7WTrAk/QVlVk9Fen4e5bT/sds+tswA5nPtqJD3G8cU1CFRge6JFw99lX2GXwXkh4livcZQUlD7EdiKQ6wnDZVmzi3kLMrllu+gOzs4/xsGhGvgPSjz57qglQklDfV9/hNlDdzbVNZHUza9eMSeyyfiA7fIUqtSCNrmFfaDGtbogNUQyFOv9jKK+hdiIxu0Zq61L1IDIw3jRK7HIFu8zmNIsKaWcV6LeNx4mdCzA4dZjlU8zogo0Hp0zl6C1uCGsqtB07fEqssSqEpnEZtqEfp9AG5KongQgwetWgzM03oOBowDFPFVxuW2N7v03U8LljcqG2jy3uu2zOaD9RT1NvtIj3Md+ivlVonNFDy3UgYIBJxdVEegTlaH9kgueK5IAIobM2Aq7L8N3lPvUcJTBh3veDE49tc8y/6iYyOlJ3mNrIi+fNKq5tx6FCHHo1YfitL5fZ4y5o7mG28Z7gji+PvXVF0PJTtff6kj3DsbQSFDJyK74kuZlO3wLbSpBio+OAaCzETn8b1dO8nCtldFAJ98++PLmPVdJ3Vp94rGY2c4ryswlX8oLDbEPsrcJPxyQTBi1+0E/cSznczMgGOf6OnRr/VqF8+9l58pMLFkuXd4EbbK1b4frpMYik1kLnaO/+pbSrdFYEmRlymS8yrvLJbvOjF9TM45uWINCBwAYz5QWTqNQP8cvMqAZJy7bM2wRQ78F4LSmIFHouE6Ve5hJ7EBuNBcgcXTm2MeuPW4UFOcr2xlS8cwEl91m50x/8Gltf4mOOS9Zw7lEWqI5OrzSQDu8XROS7bG0XkWvzRK51ph9AF10jE+2dhv7/97rl4AVLySiA7/bXSEdzVQSBUTJnksmg9mB3+hSkzudqyewB7xcQHviSJr+T0qq1l+9ueNwu+ScQK4oe2N5Bo71wD9dR7EWeh7x9HlpGxRWCTAhWn8ANhcapksOrl4Djkd6cTbyoFQIeH7QzHoNAiKiPFoWiHINcsqZYURAVGjortrmPXhrxm2qjij6zvWFWqdrQCU9o6afv1ndDyaupfCbVxqF2z52eya0OS47CDck6Y1yJbUa7AhfNtvg/Wwc+OpTANLkW0HoOXrrr5T2Wy+ffQ46QHCaWh2hd7s/wIp9uLmR3a/clbT2YE8ovdWx+szI45IAvTxG6/tDJv+HvMxljKGqmZ9aY/ZEAINgxkhE9KTJEy7FzpxLMDbvOnSYdWxPwBTTIS/mfoA9NvKxcOx8ApmGzI7FnCdt/YaS8GF+JX3iL9/+l5XiSLxkM+vagrGn8GYZo1Y7sBlaUyBqCrQR3zidE0CvhjuSKRlTtjttU5de+rtem6FJakE7iVuBuLr+Oza6xgHkMQaWkEW+/zzirHPKeV3acMHwNhbVxNb9TDi3L4L/SDmieEiunfNLWN0qanfPn4D7XB5GDUN3zHDDdHhMfCnrIpX8zqFGoGjdLRo3qvfiDn6e0YmwYVMKHZENanhN2ui3rpRCkiWg0uJSDQFlbGXpvU+N1K7kdJni41G0pKcXkDvAUC807/+wKnaQXRNYMm2csI9CAsNrX84BAr83InyzQSKw5PG2sm90DrytQnsnP4JTstR9DHPwJDKh+L2Nq7tybeWd5AIw0PXxTXvEfM3HGHc/lI594s/9vdPZS9iO0IkeBjqgvb9GuPXHUh/k53Hqr/J+OKIkzHlKm0Esgxj+VhUBvTqXPZQrJN4OXB7Nr/8+OqNk8pil1MU5eT83GQXeZrJPOc0msz3zGq7KWnBVp/JgUE62KLTuGOI0f/dGfce3BRxidiSyYUheVHWw+DydjITTxYshLDmxj9Htmr49w5MlmLohBeZklsAOAjI62MOD+4HTu+6g7r9zbqImm9qFKvwyAsBImQNZ7Sp1Y9liT8Vu2eNg4/o1Rz5nhh866uQ2//yXd7wsI0l520V1dg/zj66RwZ0F6OprJoIgraGBZdPEzKBbgdzq5e/7FZbl1RQdxYtnX06HcyxjkuR5grQFtOq9qLoa+0+gJ1phqBiLzkcGGlxR7aDFZjgE+7mrNNJdHKuncHq9PbIJ2aMQ2cK0RpFrHJqiESbfTan3WdZrX5BAfhnza8eEwSbKBl8GH6AeWeZ21QbINy8IUAYTz5iwYneDBr83esJqi9iplwYRJll136Y4OSf5oE/3FxN8Ny1koe5hYZr6xskDlhtgJnUG5b4pL8/1qyHV3lzAIgaqWSoDPtask1ioYKbz+41nESlbLUl50X676d8UxujYi3IrFDx460V7oN01IKcW6c4FeboWwvsQpIWuAhNTkB56MV9dAc7lPwhXKwjllQ3831o1sL0kijkL08Ox0uhLhJ4CjTtrKMf2VgtWK817hlwIsZ3pKjzqmNFnAQijZaZIsxdcnPL2pIz49UOuiwNnhYrDXWxN5xqQpXjFXFkMJUpn91LaaMZQaNIDt/frKsvZGQfqjpKdhxt5bvxSHBxMg6tQEAmQBt/K/IXntmXnC7WTYb2mJqbosWqDwYbHaXr00RATyHWO2XccKmtibihxf2dzsOm8ptDbD/zER7Jlt429jVxoWc8ZMJUBL0Nf/Qs+a8ZOJBMiB9ZUWE8ikI3UC0kfytWbYs0Ix4kslArq45LMuN9dsyO+W+WLapsvCvZcYKeMZfNfs0rSq1cc2HGUsNg3Pc+rQLGHPw35MM/gOiidTpslcoaY2A6DMgKAbky+2liFxOQiathzOIv/m/CE/2CKWAV8p5b3cDi+lYfC6PD/1I+LeMX/YfUWHrMLhcjLhALXbn8Urx3PfBHLLZaI2JBJJKFJgnXlq7s4eF9wK9aqGvE2am+rMNFk5rckhQHAMhwY7qGvz5ssmNKw9a4IyID74fxPzpJMNAAOxkUWvugmkcLIaxWEZkQej+9NQbW9SF6hc2A9/4yi9jLQvJfLTDOmatLRuVQipuLzcg76fypvlJbNyuGHSXo9XXTaguE6cHn3HjMs6ApblZ0BwpXEr5pgwS/jKP0J5rHbtHF4WTnCwI2oStGnPGd+aZDkN5f//E6qlZPK/lCxaKVZiVvTwt/BULWeHvYNssbwTXdxCs8SVEGc4wlpDWJmajGveJzzqPysG8JmJFoMj7BzrPzcwLLe/nxxRnkB8JOA1Y0UAeZkjhEEv9djLIiwHPN12yJjyWaqkqW6QKIBgjziJg517U2SsZyFaJ0l8/hgQdzH0RrxRjCA4VPIEAeFrIhqMKpnHDN/r1GdDYU3IDiJkO9hgUG93jr7SW4+HQkxpdfEnOII6ifhTMV2uojFQhG4Pkk1zwPHb1MXPYMe6vG/sB4M67LJMqNz5GpdPylsBU08Si1Juc7f2gtNQSnPbJWG4bPm8p1qME0/3MiXHAo1GpKlzf/IY31R6NYQiCD6o3pqqi4cPGGq5nbDTfifFx3Cels/yab3Jri7jui/PtvG9VUaJl2dOLWVREojWbOk9/O4vWsVWvBE5b7gWmAnaPh/AYFcT3DAml6DFM6pXGG9uQXgCRhiwhVilZWr/OAD3EfHg2H4+6uz3T7AoOgMa76RWp80W+dymv1QJ5TGfkCWm5i06DlzTHmtPANjwyP/zKOx0DHkjzo3e09i21bVa4ZgQL40tDox4SuT0tjBeEAwLqMJWRjvrlE4qsrfILNzcrJN+amENPXMpibRJ4QsKOBsYfnK+uOiU2rm5vky5MRYdv/JYNvyUTSj3Xs7+8dGt8sOBdBvymVnwIaA9/1D076o8pYYkVpXuUnynhz8P+neZvSbK36pRSbhv4vS2fJIC9u6aIFxWntIqmtzKAicglJSAOyUquPgaTkEOCDs6w1alY7aApMjrqcWHWjQ7jEFnbvo/5RUJY8uFfJlCqVcQ34k5/BAtI7WvUCqltZYOYWtZ/NUfIKxjPIGDTXY7HSDHg9cXTNrq650vj9iVJK7HjGFZxjehF0WMRo9mwoUeug3ORbNqAe2egLfZBfqJW8tOVZvo3TXS1BgD9knMw3SalM/lxUgY8h4DcPZ9BLZegcc6n/pp5aX2seW+5zwSYSwty2S+yZCQXUfc7qTs0QtYexo0Xc4XKjuMOQgUjtAfMXv+gnPeVbnvSehNE0/RUT5xQlUqqHjg3s1f3qbirezyKXUp9SzoN8VRXyig198xcNcZuDdenoVfobO62sAJLioC3HYLd+0GQ1WXgtsZguH/DGZEBfHldAZ0C+v8FBI4Tf7+xOXnKZOHcJRwLDF26Rh73vxC55LZrKM4vQzFbGHCl4dSvukK+dXqY1hvztrmrM6L84NCxsuEy5Db8vx9iE2ZFi+J4L855DZ1Hq83Z67CsuLG/4+psCstQfgVzhE02+WE6VHpQGCCEJEYll72rUIk1yWIz3ESzhXvGFSeOUdRlVZGzIRqAt8+qNnykDpbSxqOoOB3jtaaiLIyflpx8bMvMG4mmQBLE+2/1rQvihk3RC34OJQwFmCWIlFzX1G/DqZrszjUMllHyR+0KYBh/IHGUKF9QtsoFrfO98KL0bDoSpbnnCsQw3eWngJddTPq1yl8Tkqe2wvEpPiWeIkph2ItLU+vxZSQtgGRjVtYDVhM7koTVnayznyvxEM1FZQkhTrSp1CkE90td2lATLGp77QIiuUebrqJOnhPykr7WcdEfuwSQ6W3Wwls/ULVJa4i8giHB74ubkr9yOOJi6oCnsHW/FzOYIJmpCzRv4KFGrsJMhYAoxeqLxXwCAbqrhgYXAeV3QADU68UunltaMYyIC8RAwcXDaplboz9rXUnzRlFpiKgn8GvtJ0TJGuwIT5dWWHW5Q/hV6PP6CJZ7uoMK/4prUqy5GUgVIkEh14esXmiFdq2e+sQWnkJB5JdXNokxNHFl2lC50AN/UUbX2tC2OITeWM/7jYR1LrJQNrexUFBZhEwhRb9QizH2fhAmaDRt9vzEA0GZWMQ7HKdhy0eZdPxgz3+Idw1koanraMxV29MihyaK86MRKqyAEVths5L/3oyksTOaf3N2nQvcdETrqmhbiKsZAqIPSW4z18HMmozjT2boRSpitejVcX02YoH52gtkULJbQjXifjCe/UTGrGDUHAHG/lHCxRh8uqrIsi7fG7Er3xDSnw/WVLiYq+IOjtoWp39MATG0oKz8pOMIFuY3X1IcFL1dMjk4euCt+O7wqP1bbKk84Nw9Q+cvywlaRz21+w5NOpwEa01Bdw0TxzB0fKVtWAEj7NsIIwkHtO7vrbkpWeUR+fzff1Kfa94S5UQHKkHFdCc1evTVO4TT5cJTaWAhrpsqV8aE4J2+Tl3c/Nq8XFN0emSx/RL/ZhublHGMkVXmj1fGheM934Rvlu9lFvu/yxOzJ4976ep9fLOL2SoLefchAG4oGzR/eNWPdfdtvoMWuxMukh5yJ19h2RmspOIqQA/7wwSKWH3esykqdwWzlqG26hiHFlALAhDkqogjkRuQN2JjkNTPP6cdTqznm4CHORiTk3pkzhb/w1U6jN3vc6ZkIEf3xxejAVYLePIohlIO02kn+bJKLd/qroA8TYyzIPFM28Qy5oEfG4NeIFTEJIWyy0ZIHZllmITqY9GvHjWQKCmyhXZ9zAImepGVP5pd01ut1n0hqfcDMsOGw+LuGOlikHSmvCTVrjgkPlULa+d7SyPEezhqwP4EehsS79TBfhtrjhEyMJQ8Wnedgj+fJELev6zhbv8c4HOu/MF204pyEeghNtbrUqHFrykTz+ISE5PBL2TMsi64ZQDDIhEPZ/1at6SJPXMe2KMFq52p8KEn8Z7FbzEO4GELPzw6fIjXUZkvAv26V8UNIRfCGYBu5bJF7dcH4v900sDwD4H2jY33GKocxiAGNQ46Z6+Y6P8EyvaHuzWUWrE4b8fg1rg89P+gNTQRO/0S9Ft6Pesy4TOIj4EP1+VYN9qYf4tI0FSvhOddWrEOri/ExVigYT6vIgZFlzz2Y2VOffMSjLvdKnKlIVEKqftO60BTysdh7lZVc7kURjK+AKs90TTbLN2VKRdfV4m54Jkrznr1/5kx1Ggpp93qTPyLbJzVbCneOZj1nX2UQ3ykZMXlepTYRlPrJDYq5PrSPSmwo/D+AMpW2GkFmh/qMkyD3NAdo2myjZ2x5YhT5vZRT/a3Gr7psy9rPugE2Q74fqtliQwjQYzsuaE+DPFuNwYwSp3/2EA0QbuxXSvg08Qa1Sarw3FCGuVs4Gvd78LlCbjpXSh3VRyU8rZLTERa7cbU7SmuNIPnBz6l6jpawJ2yVs0JLcP6eBUUrYifSQvO+HOfSbDwOPxdRrtOM6NNv4OyN87ykOjtWRmlNLBaKovA3aCoVHCdsvDgNl8W7UjJktH5kIMnqcGJFzLXQ612bKZDc612LnJKrAmEsK3DU8tea6jJ0OQ7676N2esOAA8/7mM3OEfOsaiEdYG08QjRKK8N7TdgR2aWzW2qbb3jP5bHaLJWdgD4D+PYCeIDJ776nwDfpZXFst8uxKlL/HDKpiCsiqShz2HUIewwL8NXofuCX6Qlqdcwk1dEtJfvlr8h8x6f+3R6jfPf3c09XpsGYyOkcFjOMmXC5ZMMmbF2l9xdctts+qL8E26YYSMaeEl65saSKFhIVeiYCyrX2jFLYiThfvsIh/yg6f65QvV65Tmno8iNIpP9MixZhN5p1MPC/OGivKxbfcC0v0FWir4uvoNmnwCMRQ5+tTWz4VsEeQZL4PPssC2dts2WyYYXjtf8o+wEPouVJtGVTdJ4mANlD/kjzHMTZ3aEykIcotm4Ld5ZbyajLivfHVpHFnQDKqBr67tvmQwSTypymwEO/LLQkX6tgf3QWEExP68bfFhTBFzVbOqXlPBJbc5tifnpAjbj2XX4sJ3DNO5lP6U9MzvjnabqPp8cOZIE00b6Lma5UdzBln5ruiMlFbvqlUxm9MvOb/cVt7KmN6C+OKVCaWPpWHRcyQaEPEz4sQQOXbOTKKS3xnV1qo+V6Mbjca0Cc6wZRjVqPwuelIzFQk38hZ6B4BqMKbyYXGJ1eWndYBtCAZE9DuuJIRgi+SZ8JaC97b9q8KHoVqOjz0uRorcYNku2wUdkhbCFx/9hINV616TAcs2foOZKq5kbxgWKAZPWMG45Cx1RsInTWVzfPAv2Sdu/Xrkp3oouT8T+chGhtgfnJIMBbR98Xi1TWvidYP21RBpFoavhfEUwX1n3+x6eUN/hcjhNSkiEkm4tT1AQalIHM3nYyeKaSUpc5gVavxrcwvTgBoiyWQ16Mp2xj5YtfSvhKaRK5VfofuVq/zCPqIm5Ka01nJMtGPqoUFqDHpnpd7NNqM1A6lxPbZnFiXKvGGHK0ggE7VOWC6Y82P3zg7/XZJVJLSRKxkcfS+m6rxKnAtxDgGlp4r4XAF3+jQFCDL5oyMr43SYHTRCxrvtOvkzzcTwzkvV+RfS2p6V+pFDI9FHG4p5LRiqZrsJaSrBDZTunxhTjoCeiWmhJxjcs6ecTFTuapKVGHMFxRBCLQ6uqTYNkidzGldaIFacXzZOMG/qCaD0dnimXYgiz/Xl37yO+n+7wAvzH3yWoeqVdGvwrKdsdT6jXBVuMsL3SNIUujHiWQSDtCiSOIIFRvRWh+sOxgs+Om4jP9ZF1Upbj3TfK/sTEeommJSUZUtLrIhH4LTyBGJaqzd/XhPi45xOeUWDfFxGwS908eFlmNRNl7YfQp2Y6jiCnMYVJ8asz8u8GUj0eHtApSfU1s70h5h05H8EnRxVrG+QO0M0iSmjyzuVmXvRibD1W5jYq4TdWzgQo/7DGVxVJ62Om6yaGllL6lPGA2cKQU5gUhtxIDfg44ZayxcEb6J+mPaPzC9z6ZpvvGEsS2Aw3tfB7VKkDkO2FWAkzI/U4quyAXcKao6jDblzcDxNH8TkogccLT64Z5SKzAK4ZEQstfpfXAvNlMEM28uT030HQKFEX8J2xR4qEJJwPBJ8a2j/MpIWnv2w5d6Ha/ELTpfgG02+OaBtQkJc8kGZoF8cPiORdnCt7pDhCTEenSerCHZozu1aLdF9Rq9rjPyH9Wwf8zAILjdhyymK9+irXiTCSwuo2Cziw3knQzINfANnlXQ6FyW/jSlT+/zHjpuQ1qB2xd6VRDv7PMZ3v1g8xkVnxJBPvhh92szvegkwyGFyKn3pckudrdY4adiM09sJzSu7FNQWQexXw1wU0+kv57/azUOpH2reze623lV4sYmk6yF39pfQYoit5rEWZkOuq4FlSVZY4cLYdAL2hKSyYNMg+MlocaM5VM1HPsSilyGOlolZEideVcoQ7V4tHXljN1HkjTyjPXeGaImouO+BIoA68+e3dKojaamqYB57kZjLOsUA+ZIoU/AyY7U4dvZ9QZdaA5zF1h9DnzF0G3h+pzAYJG3OWD5OeJPSgjxWBq67P2fR6HRJqZe06k6dMsZwQ8CZCjrxgytblv4b6twXthLQJzv8NbIqTQnhCBLL7w2Bu53eXJFppeI+m4TayEa5ZeHeokA96yH30z+PqiN2Ti9l/1qelXKR8AO++kwLd4RRbDX0xflEl3eRErpfEpZQESkUoQVJyKz6aQyfYyvsaCYXBJP5EYV0Yl9DApdOcWq5hRdkvgYvmx1TnwktFtiSLlATYWDY+Cazh0tGE6kaeWYHzcMGvV/Y2luTAzYvEJlY7XJSLeeqq1PpK3bqb+Py4+bj2Sfd7uUAfzG8/b36uTAg0ELo3a8jWtVBOZWVoh3D94NaT+sSuBJES64sItx74ERDrjzpCSIkkymVDwCG2EDrg8fz9HpNSwPrSHEKVO0YpvDc//zFqUOPFxKMv6DN0/TOe51fwMi2ZMkxy9AHiAYuLVR4wJTCjaLuSwBzHJOOn2sIqjPMNFCjkIg2ALo9laPWqe5O7b4YPCUQ0fDuLnPPN+uB9F00AKyOxE5CzswQPcTLpCytb4PyLoCu1H82cWYqk9Jssj71Pl4Feaw20ho34pfGj5JNS+9i7W4KqoD/dJgO9utB9kbkZFnHAZtr1arbPoQnPNfoge3AnfrCyk8ngwVpi3HFDlbqRrrv6Qh8d7YjWVCwKKjmKT89gtBLzm1jUXVz/fUHcimgPfiBL7g4SemCslPNX+9i+XVAjWVFC67awCpjmDRRh+QyDP8ofiooxY6AjIjWok1EUVUyDy432QkGKlH+MUDahdei1Sbw25IkLmHmhB+2sNeGbSx1IuKOclL5bCwm0j06GsLZXtYmav/cDW9evZhbezV7Fa0aA0ATjZtP7ETTXrGzellBwNgWnrY+l6sZudgKlhEpORFzco+9/dbBLMpwUtkHf+YH6GVtP/1qRhsys74OIfWPgaJhskzuCvP8MdMzqsfji64OZS//iYgDWc2DT58vopzKA6hAcmPdiSvCgZw8njwUUu5ymDV2EElag/yEzkiNONML3DsjF5zr+TiUiXIhCsNHd8xTapFjdRyR1YZwWxGYxgpokFN7FqBmMXDOpT5hhX9Ye51fsboBVjXPJxcbnWb+3LRK62Dxv+0Q7Pcok0Uz2uM3XbCkleR4Ki3wMdZ1dWt2E7qJEhIUGVKuP+6J/8hZZOD7IH8c1W7USuLj/Le1vzN7/6Tt4WVGfH3nTV/6vM6TPuU8yGdseTvSDjd885vyuZcsB4JsK8rBj6Llr0qJeCcGKD4TuB1ojNnjNSgGJKbUhVz18qD9CkSRjsNavph9UP3vu3svE2p+kMHFZS16K7xwxYysjJ2CKxsyep69S1nUzfND8ZisQKDFY9LENuFkthonfoGTeGLbGT86rJ+3T3l4af7Lx3Pc7UuzcFz/PRL36B4i/FcXcoyeqevY4Xk6h96Ed9mVbLtnJvmLve2986T+9c2U5BJS6zb//lY7Q7agtLw3Pmb6ZNCHa94+PALYHY2es1LLwA4rcZ9x4UW2TroGBOtnEl61EQ56UyIU+QyZLGUKfqUB1cWUrLbZL7axCxFAqNcGAMu0S1YmnFmTgk9PdCWF0cPvWwa/ncKVXMwYJJ62o2UJmRFbVi364GJThalU0/aWcTGjXQuZOptAymv6z738bAT4WBj64M/Orgp5dY9oecAMf3pCEskYloQ4ewaQHGLPKRLcZ71mr75g0ZYjEg4SPVy1hD+6krd4z94YyF56CzCcO08F4nRx6f+BOH83JqxmJfru2wiSDKA/i2YC7soRGEEz7QqDkKQI9mUcywrQKLEHYhSQHPhFZvOqjwPc+nFFXilQ80mwjh7C7TNhsuq6p8jZD8GfkZWDjR8sHiLjY0qPqwA0Sf+0XcD1cPdKzhU07kVzcGUg5PyONX7HCXpSGwW3z+2oaJSdV9VvCHL+q3NVlyu1d7GlJ3ERMvC8/EmdVkhS/Sm7HfYmfsMRSEaUNw/zVyTaW7LlfK8Lj47RW3xtiJfnVURJ0KqiJQerZ1FnVgU2sDX+j+n4EY+XffRUFy+OeqzMBKHfFvEfEVt9UphGQI6vNCx1VMoAjiMnIbY0WYVU8mH+sjBrD8aXbkffrlhigqBj8JjJhs+Xl5kDEqBWorc0t5bTe8sc79H2UsMwdCzlbgyv1Be3GoTQgD5+3IC7H97hFfGOLKCzNqNbsh1+f74mi3e01WI/ZXahFY+QL3ChiTdXrMdq2SxuAeplI+UOwsVE6DGQugp3ZAIq+X+PmwO0fcmCcL157zkFgOK1c6GLDrKhZKPWmwtnft0t+H0srd2L+lJ8lUnMzwljwEczg7LNOqdZ6GnVDTWkCjnhZe8+NgWUmdZaTE9YJVkMq2Bg/Hg+EpgPrirl2hOsDYVgHBk7AViVkdMQzIhXyiKQ2sSBDc6BDcowyVavhSAfF5xM65Vr5kKoXGmce21p9A5h4HHYGbwT/bgGslT40xuSfEuGkuOPPU2HVBBOgr8EDowwhR3Mzaed9ri9fNQ71I6K/gBlVfTxZSEMI215+3YgSJ0wnBUGwAhDYIewC29SI/W51NmkcCu5TSNZE13CNI2bcktoJp63R/PHStI+hBlG5REVlsSDimw/6ScIOxLLjhoklDoDOlKKU7hCU+tehnZTad/5Hlv2jc5nN6gHxUjaAuzbY34gjCnis9mZYjxopwqM/nSiqZYyKqxFTTVvW/zZOn0dt8NdTZZ2T7V7y8a8BYJHbLOXr2T0Lm6J+rH5uQNVrUKAu5lQNvwELlLOuAXSzd1r36LSAL/0sUBR3ixpHXEIvjcuM7TSxlQL8VWrQmZxxucI7EowbWk8cUniUS60cYtmTUDsZ2+C1cAhB7GqsDeyGaKEOUg+u9LkZbNINnDxcKyZi0pL9d8/QdGu35Dh0rwg0wkaB1kfBS6CApt0TiT01bSY1b3guBebZ9SGL8u+qzOeiVtfvjD3eVXISPQyJGVsBw/T0pIpkGc7C1jilffJyI+9ichu2gkWzujVDwsJUckPhoxolHrYwaBs9JN3ZmIFYYPhz9LSdNYuYBgf5NoPFEi+OuMRpnNGwAZJRsG5gPm6mqIvfp7Bw4RVjjQV5lXblAjWcCT9ZoAWg49fsw2Rh9LLYYLEzCnZ1jtF+q33HGr2Cluj+hDdRY4mIwBm97UHkrlJAIZKlguYPZU6i6rl7AZjApnlMR3F03/euqO0sJg70WU5dSl378agVhgTz7RuUvZ5ypavVKBDq1yRoIIO8xZeNa79IWOMOy+WJmjZhRPzdqKdu253sjChpd91U6U3lJjLZE+Ssnaj4/d19T2nx2hbSlWmQ7n6WRxWav4U7nbO9Z8lk/I9jsOYzogOBF6gmt1aYwdXdjjvalQzX1I9ynbvy0UltQ/AUcWCCwhrmo+nJC+rj+EcBP61Y84jgIzvykbMZgJgk+7Sp8L450pY/qr4Mh5LPRhV19Npym1QXIaGsmVwl7ADV/vLF+H4myO4qaVWkp+KRl0pBLV/Ub+cdPG5842jztb7pCZqkem1S5qbX0MP0cWM3umYovgRQOTsYFdyGZEwlVGo+onksYLWrTWFtL0WcMeUoakmkGolgiMqwkEkvHLPl6VYQiqJdyHTmbMZ8XpYWfEQ7hgPEsA+hW/Uwb/61soqetmumMz1aAhQB1maGKlhKCNxWKvqoGsOvXzzs0NmV/v2IlzPoEkTHB+dMtCKgDUNs0pPzhtyDzaTn1V0WWsHFkHPCRyYfuAbt4t91lkwOZeY/WmPTJaU5aFYxW/VWH+9JjQgfl0Z6SJdtkS61XYLzAUxWS2h81bHpMz3iPdg2yHgWfASMy5sK2sdj/4CuI3+ij+XGHDWSt7SJq3VN3b8FVTDtN93QnHG3rSi/wk904yTMLfZSJPFXylEQi1EmlQhiZxB2VhLJt03E4f8xHmr8I0claSsdpLIpxNQhb1moqWntEgGhAO0yiTahyswbMOU1Q/qp2ucTf2L7HIx1w7Sy7jleLl+BQFVUX1g6lrH/y/MGvF8wlOrNfbYruf8WDfK+uKQPlfTU52R+z88/aKFloUppolYXTzW5I4xBK4iSYTOf7mS2eWWIliHE2Svo6IBOkNRXldVH95w0W/RpL6N6ajCW9UtiJr7LTcfupb+hNjORyPFfuW9KmNAXs9CKy+k15ySWffCgK7rsj66G9719ksXVMgH9Np9SI5FQntGkdQ8FYIEfaC6zei+WixgJQ0cj24I0AtTH1MAMOv7omafkiT0UmurIm9xWJqWiwsUmSlPlDlwEwfH6+lG6v+zc85ZDgHJzacSM2RpwIUNZyIQnMxamZdEpZ5vi72oiXqFSoCjQyrQjB/WpCjwCxhdY6mXXdPVsqz1tEg6JQHD8E9XHE8/XP1+wL+qx6ox8SIafX7gPPP551qra6ivWwfDlHcqQNUYkZhmt8zrnE/sbWftmwW/oWF5odtO8U6bd9lLQxWvk6qmKCFLDd21ZMiklNbXp72c5jUk+CyXR83HYkeplSDuBVZNMNZz3X6HhBQC+3EHn1xqVFSAOWr2sA7jkky1rtYj6q4O/tTk1MDw9BgNoZCXSwqQypmdnTIqzoyhqqcnbQFp78snM9lwInwjhiKpbrC14wKIRQu5MRi95EKuB/FP0f4dNwSaIOmcRNcuzvYHmlwHO/EYZvIdggrpnsT0DrUVr2qKt2y6P8FSSeghOJSnSoWzGM8Y+MBsTd6OBBIcljVR/GfZMfDF6iJ0ml5oLaM855C9FkNdpYMcmJA+rX9Ytz3WEvj08i3Tfk9UaasroMxgC1KtQWdkZwTbxkxI53dbAbdZNoOVvb7ZpDZOpiWfeVJF6SZYzdXhEfXIWrIa5HR3Nf3BQS3Tf8A2m7/PFskYrH8937OEZbIOmaM9yekyDSjBKYW0dZ9vjHnm8ctlnOvh4kPagJmhBH+Ro1WYiAfutEY7mRoVXSWbaBYvc1e3JgfznHPn91Ii7nDRsP0Mzqi3gPnWpYqtjSTNl3gR4RDPMP83g4v9rRlFOJTXbIm73eFJSCPMWashhrHGHekEIjEJW2Ph3hh2U5EA+7c9HcCEKPwK0OOMxP1hlfLLnZN0zNzydkzQgutEySwnEkdUQXPQJEzWo0zMZF5b0JzM+BtkVCnHxzU1hnfGtUBtrahSW4nCTVUMpwNCgyJNOMhFXrFGLDMFrWuxNqXzaJRrMN3vN4DPNBcEA/RPFucWgH4kKf6LXOZFpEIC0zVayDmu96MFYcsEFGtaa0xwf17fbbhsI1eJ1B1cunKy/tJIjWvlpAYJuRCCa6Njb5MbmM/RJv9NSci3Gllf/iqcnwPuxqyoZ86q6AKhwQTrHb4/OI3zXg2LUPVadRSj9r5QlYdhskx9d8r2pRrWZuDeIgk7X2yNm8iXDpjIT3U06eI+xA/Yihj8XSkpRwDLWtnYZG00U9F/TkcKgUOC8PGrZnsuZbEeqDICbNtGay8IaryOphOMzW5lBwB0DbXuRetPPZWy0q83bH++zt/wBQEhIk8VugHPpLIGBS+DHSj0mrc6UiNNGaYAHHrsX1APHZAPDb4caj13jBN1BEOH/lIYiojoQR71kRIXCMnztP/6tNABTxK1U0QLfrjVoNAC2Qol/a3J0n7I9+XCYslrwjK1xZA6FhIQey9DgIvjlqSKSNtz9YPw/hSU0vU1RWMwfVpkzv4WnqaY+Zqu3pNFXbszdFvI0SPfM3fFGds7fMYo6uPWt8DdhhrsS8rqGcUk0ybR62WmDVXJuiqeOseOofBtXtRkrlUUqwiA6JaZPvlc8SpFCJmlHFHvLCReOhdq4YzI81i8GyztsVZiAoFe880EWfWwfhWgZa5qZOr7cBDiPL192WpqaJR1/yNLNu7NOq4rJbQ5Ze4FsU7aNZ2UTbaK1QI7ey08q6H3Trk/Dk4bm+sG6PgBbPED3kL7RAZhPGG1E3Mu+bWZLA9n9KKu8QSZGkaursHyq0x54XtIrC8QL4y2x/UK6zMn9BDzxkwwV5NJPuhDHBQ9N39z2rAV7GsWkurzOq5Js+4zWDnjWCXkPTYTNvSb/p4N2WC9lV2MF1v5vnVBKXyFERrQb7FNt3yK8k+b53tgA7XO/rYtmLjtw9ezz9T4LHDBJ8gLBvfvi0NubD/FyNTiRfUw5El1gcYydjpN97jYwv6a4VJ+HTsv3a4UKwHkw0mLNmkg3mQ/MG1cWOJ9Dt81xVP0GzoGCKopcANTg0wXsO89waDw8osRubVApOEjUpUAnTr9hORCNnuIDwf2xe9crBr20y1gY3HfSZreWfZYwbv3GBMZ8ifx3UrKuIrqvLrP59iA3UVzAKmRkbW1NcASfP67a9LHVWLpiyBFp16gORgCm5kfFf3pgVciSYr6u1hZxlCJn9nptsBZtKGBWDaEbz2oQGgpboZncZW88NbXZxwaYz3NNT4YT5gb5pvCC465QCkZDJLJuPAXeqC5QnafUHGJ6Qz2BLgM8P1sNvX1LYoFSlE/F5VjtcDG0ze2s+CftFFND+bRwpSsTvNmVqgQowbrNiXQo9Il7D/w/djm4W2Kxo8d3Y1laUMNhx54XEd4fgEYKEBrFaEGL8ZNUairlQLOg3U0ebSZF05TxoAZ27pltFS2KXZa1CjEFAAkK7zQCNKDwvLqTOhC39qyhsY1n45qN+U3I8vg17ZgmkOoz7eNcMYlAT4BmzNqu7LKYA27m+bkraLXZi7a2nYeib0IUEjcQC4pTYrIvIRjAuOjdLcD6oeufY+rCNLTUWGCR88IplXg+2n7pSvswTWv9wwlMnZ94wjm0xHnpw2mfK5al3DlfUNoqYRNs62BH2zYF405XRxJsyslRLgLCITq2smcDcmp/UfkZUwnjcfpcQnlXpCHZZRbhyAgKQsBcY2cpUmkv3x4kJI7j4ljuMmSVoN+5hjGX25vtyX3LLw8nU1SEMvTC7mGjr3KAqLhHywEN0pzL4fjowhv03qRBDBX0nWpKX7TGySXasAijqcMqkprahtO/2AmcVE67Y/QUs2CxXR4ZgYtPKh51cLp+PZ0N+HSOl9v3cQOigFOT3taljRCcA5ZphL9T7B9MN2JDOfNkRXW0aBfhxUy08qcFDpSAdUGRhnl04d48A68SASvt1ioHQTcCFp/I/QSLkEq2hJUqMVYsYd0vxg+M8xu1d7+v4eJngYfYT8xBFDZP9P7W+XfLomrU05xwTGEUxIQo/B4SpVZPHwC+x2YWQYvhxihJ9yssR2OQOOq7rOLoq+RI/rIE4to4NxLoqC9raenN3QZSZ/be40aFZ97nd2bBN4iHxGskcY8Pc2lKH1nfkQTnvBB9GjxVYTFJaw+XnvcxycXooa2ScNzgtmeRmyLs0pBv7Ok+giPw+qW+v7ypOj4DbATkdUHcm+weWoncaInSkjBeP1JwkBwTUlduhZcDUOyk6zeGJkPnKFmsnqcfuukB2zTPei3+3ih4BHprAqm2E+eY5WR1BVpT+s+HJLX2XaMrdjPFtQnJc4LS126TsJH8quWXyapWVyT2PWIHtqRd1qVnR7jZBRhCIJq5Wt6fZ+m9hyq1mHKviD510vi/6Oq60SqMeL9QfSW9VONZKbRXA3sW7BpBY5A97H+mPzSJOwrggWg+OepguafErFAi7suDrr9FSnr6YpgtPzyGjD7WW/osINKR2JgFuvPo4ptounTureB6Foq+NohkVWLajVRm6XZFx6oiWKlSIcNdg+0J0VGg4YdnGS6rxH2RvTDhckql/gLSt0zjg8dx1NMauXbeaK/8fQr7lbIPXfPZbrFtlfB0VZqapFdGRHTlCXOs8i9+fWegAWSlerBsDey1Ni0RnJJJBm53bJ6u9D5YUyHSAfmXkBoA2VcbJIubqaeL1oFlYLjXeCraoTwIjIGarJAuO84TmFyqHCztD6qpdyqb9pEFRfIksEulbgANdW7W2pAoSUmq+zMY3co5mGnSnwBMPn6wWmpCRiFNn9blk2oO1wGv20GYsYljIerVzKV9/FipIdpt3BiebQ/XJzKT3Y/uwtnwfGE302ez32Y8FjedldklOfr2b/5KaCdVPcePNUsBD7n6wgW9uV57xfucWKdLrFKz9EdBV9OoAbAizNtpu0ta13BXXnapJtYyBrw13ZojGz4L3kTeZ+tJkWKgIY9ghl6IAmMAnN73l+QINKUxp4XiV+aSu6ver9DjybgJyVDMzmUFJOGLsL8rWKP5aAmnz3K3XSpZCGhnygHtp3J1m6wpVOTOhkMWx/XDNIoyO9wGSe8UhhhbDu+blo1513PKnq5PD4yqznHDcR1/UXJqtrRi+Mq96UNS8liRFxY46FV9/EqzLyyK2Ri7j7IzF3vve3p2fi35yGELPMMV1m3n4c92j1NPE6BUocklCd/DzkDl1zKS9dL/nBWgQA80twokxnsItoP+O3/2E7JB7KXuOEB8lpUE345b7SHAgCBlbvzJ/ro45JtxNQ9kwKW0mXG8FMxrfrPF4wXnANl3Dji8p5gDYzo4HXyaG0zhyRS867XjYZMAF5yuse+znLhUEk7yfFEK7sly7IgIpLYh0kqP6mYkWtBqmOEWegc6XFHQ6vgECLbqYazCJu2mj1Qj4aKdR2qr5daLvZgBvDuhKk6EI3W+0m3KuYbRbx2ZvltRZD/dldH2Fojm/VFBt6hQpMcLnEZDGdjnJyn9gr7krYHok535o8UE7TleMedbYx+Xohluxun8kgmUrUHvemEL5B7eDSjgWGeeEW8auIaG2DBlDBZAU7YyuhW4lflbAbiix8KkMzKh9T1U6Jb+GIDfxIpNsF4TnHwlsqo622JApJde60p15lst3f2j8yWTtU6hC83j9lSIrGTnqtWu+deeqY82L0PUOh7V4AWiR90NfQ3uwUwolmDqJasRBbW6MLfvnhRdNCPUTSbGiHwiuZPuOGvTS4zZh3pi7BMr50PY7I48BTo8vNPJJzk0lauG06YAnRebARj5sZIWod7ZXXX0pLygBfAeb7S0JGT4fN6MecvBHNGwb7BZhcPnwN9QfhIv8pVYJ6YVZiUJxlJ6RCzfRDmm0jUVf4CD+UG0zr3U6B8fHZaHG6eKvn/0b+T/eDyabRr8wJ34lzGh2DNiiq2I51qdeGDyUlb8CXhOFrCYoWPN7wfeIBiDKsf53vNgrK5TPg72064/GALanYUFbdozRRNQ8aLGPKA68ZF65NpE3DOdx6L/lYJxf8T1uimmkYP31UnrLqkj+XdMk0/SSENtimu2SQhNf/QRyDfC6yrSrvFrNU4b4Vi+OPMUXuU9FrcSNR+1OzrwbGC1Tn/kglP3Rl0qaVfEWXlWnUVX1iMDdcm7TwCY2YzTEVnZ1E8YG4t49nr2dh2+FH+HQJ2buoYc7vcVMwscZ5BBrnUE9ZQA1Q3PPChTwMJS0Xr2onnBcmZSKK3liLzoCAMgcU3LzGNIlG35bO1h2TTWvMWJ8XzfEfHeB2AI3KKw8wMkYKT7VBAxdf9fZNTkazqdYE3MjamV7b1VvxHICl3qGZNTP2SHnQAwA/nuHd0/3UlrYL21yutsQoeUS7/euYaO+TPaaZWrJbMWgIiC1DQdEobEBvA9Y0vG+q5i/jlqSieREyn1U4eHlwdNhCViSKpFRM9KQAvSZA2WGPWUG8TWx8JlfFLD9KR+XuYJbtenWq57/rSvsgznQlRthn9wDPY6YjznJdbhH59uG8p0au4f88GijvmziL31KPxeT7Y/PeWrnJ9JEmsZnDp0LcP0c9aNj81kw67Ica8y2pbmOj4JqNRvn966Zo1Z0cGZCE7k+1uq3SPBqs4cnt91JzTRlbLQjwyYeNsDOWIr7FgtXUY6p/HvE1BP8G8+Y3mnQRVSj9/V2tXxgPYJ681mjMnV3ohO7gwuUvXYlrtO921FzkLxBFm6tSIKK4tO/f7RFowImZStDJRC7LAODMFqt3SSn93lOOOpmtMinQRW12A5ebS5nRWDb7vHrBRdp08f4caUP0dQWyOnMoxqjjAlkejcVAojsDEt5sEzMYaX5ZWZCOR61lu8rwnDOugW+EtPTwG6TMf0VHSYfFIMZsDHfMdZfmOOd19jXYvQWd5KwcswoE5MFaSLdSvbG65DID0a7MWQDC3FX3BrkWRNQd+1wyIxtcLOoLaLkuJhEnjenxbejCuEtwU2Fhf7HHkTb1C/u/C19ObuE4augnsAUsdDdsMmyRIB4DVAejZuCbUdEwaQgvfmYZ5DZqsUpPlD3T2DaIcgfwI6w95GNIPWh5mGQVb+pVx4N1uFCmbGrIxHy5NHWH8ztdyLBfslddNbRtiYWugqNCTvzjZbswdWtTveb6oZD26SNKeKmy73rPXCRq/O0qVt5IdrH6zzqUZiSCbGkn/l/ZXLgLQohbOuumnPOUxyjLNcucz3C5T2CtQ0Pg9mZJNcopRNlQ9S9dFsf7GEI6At/m0yGt4mnotoK8vxriNarcpT/pdviYWZLcfDJjD5feh9kUlWwEt0INqXGufTiXVp/KhzArSEO86W7G7hLwFJYU1yQQBK6y19ZYOg+HHKG3HPpt5DpEheFxq5alsQ7OooW137Oq7FvduabR3Qf6NXQKaerpOKeiezYD5R99SLvKF7yR2Cm5WZQH41RKcOrculHeKxBmt8X39lzDnN2Awv7AwG9MVI9X9313o5bhO1me2CZ3c0s7nZCKZzSCTTDO1hrnQHvWhyPuawG/wqRpcFlJoTVG+mJi/J0i4CXgNtG/2OsI2Aje+uk0jIH+ciTi828AKzCRcgkopXIha5w/W2sfCKfEOECpYkPiOMC/tPbxEXUXlaxYgQodwAbFkgIjIdKP2sS3jEe/XI1jB+EGRwUB1t5bBp6CaGyG5nyIgiwwpyd1/VVTmp3OTmM74FTbErhGflfmLuzcrRFOD/End9d/VmRMBxBdqxmH3bSZycQxFWh74iSwHBoafNashoqbFZx5bu50uDl2aLynvIv+pI2q16RyniCE1rLxVu8VzaAx+ZFN+GHyoadvRW7ZQNWf03IkKs5Ot1NNFfu+kKncCXmz/yb8/VAKqUh80Xf1j31Skh7PsvWPJMCi2mDNJ4HxdaotyJyjAQfvHbllcnf+KnZ68QlzGbStPGuSTA7qm3f5VuCjUncIdfHX6GjEkXPLVnIwlkLqO7NU8R6BHGE9IcGyG2VeKWt70DC+hWgTiN5SGXqM/bOxk6fKzYPUI+hqq8ttSg/V8ya3MqRs3vNeAGcfRvcWE7nBy7Pq3Ck5H+bju4kCnN+irAuTt8W8j2f8h2CJlD8QG0hCY7BsyLxekK5vXzMXp20Yl35TqZpL1tG/u4V/Ll+LhzQiXAhXoZLDcL07zj4cc0QHONPbYK79Rrt7fdTziiW0Fu5c1Fld+54FlouPfENPpiLP3HH4UmZBIhB6xDKlNqNuj9KY3w7VA0JKcxtvZY3Vk0lZUNQ+k+zpT2+naWTkvdCfRrX7XXADOzi37RSZ+U40aumfAT45djQv8nHGrONnEfaB6He+Vnm0/6dngqqQryBl4/vY5jF7YH1e/838O62tJWDMBvLTbgnonPudig596x+WIpDCgCKtxAgimLhAWyiK2h/5gclIf8gwO0973Ddu9WYo0221eLuD3laUqIxtaJD29QUD51F0THDFhyvAusjDlPO5koMF9FepoLkCpjPcT81qNCIauTo7iNdp0dEcc+g39GS7PqbIQu1Q3JYgg1mzZDtbLa59AbQ4p3Fgg5WT8AO5l87HkDDKaijyJ5583th2q5ai543Mi9fBiaMEKg4zM/FiocQ6b2GYuIHQEQD4AzmkIcGNdLpCsxG2SJP/KwkFeNyLzI+GEnD4QUTF+2SloejXJnUrNl4vask3ZPjcmn+N8Wal8gehMSuPw56OvKUzbz2kORgti7esmOxKHntgEz38uzPttLLy7lvpAZQ+ZDZfDRnLXirswBPe9hQs9MHKMpb26OZ96r0YsR35MN4M9bs317gZdXLzd06BC8qbaLvTvm7L0M4AOv9BTNUU7dfvH9BYcwohhhUPSpUX8hktEMQioQ8tqm40bonfQtJHkmy7/hU0v/xhJXy2Ubirdq1kUzudouZF0U314XUUNttd2b9fT7ZXjEPs8AI+DMy8Pg5iP65GcxHEd62YtW0zgXwia1rD6dxYKqTuxN5KIpEgqkXd6nk9NU+icXGbZXFuDKvAD/YabBbvUyuKb+Dtv5gEd2Meqx76CrwUSm59OC/QManba3RSYovcTiYVYahFkHhSK+B8BKjYb1EySn5nHKQv0mhhbrZGeRgu+FYHGfvzlBokTcGyjn/d7S9WSi5yUU2ojtm+0S1agdRLYejPq5xiLSeHIRaurSbCDdsnsN1318KyWqZtgNdJQmjwQxdy6dKihDeUqDbBDUjs+Spdcn7iraVrxEl89N/6FTDOsq0bItb8OvzWILBsDhIVtgAoX235Go4voK/Z57tt3sutBqUW/jl2lKeDXLmqeKyTkgYomK68rsK9UhYAa32IP9cxlspUwutQyvRV120k9NJN","categories":[{"name":"Investment","slug":"Investment","permalink":"http://jeff-chung.com/categories/Investment/"}],"tags":[]},{"title":"Real estate investment","slug":"investment/real-estate","date":"2018-08-23T02:28:21.000Z","updated":"2019-05-06T04:24:36.276Z","comments":true,"path":"2018/08/23/investment/real-estate.html","link":"","permalink":"http://jeff-chung.com/2018/08/23/investment/real-estate.html","excerpt":"","text":"Future,prediction个人感觉 m2 没跌破 8 之前，房价还不会急跌，阴跌概率大，造成房价没跌的假象，继续高位接盘。照现在的速度，临界点估计在明年春节前，叠加年底流动性不足的惯性，这个年有些人看来是过不好了。 到底是空调还是真调，你看看有没有缩减房产信贷总量即可，他对房价影响所占据的权重非常大，同时房价崩盘有千万种可能，但是唯独没有政府主动出手砸崩这种可能性。链家 左手要维持金融市场稳定，右手要维外储，加息这个筹码实在太重，一不小心就翻下去了。其实加息倒不是多少利息钱的问题，主要是怕改预期。万一真让很多人觉得 ZF 要收割了那岂不是自己制造混乱？所以国家也不是啥都能控制的到，就像 15 年股灾一样。现在堵外储堵的这么严，你自己去银行换点美金就知道，我感觉是要硬扛的样子。 股市高手在熊市里一样赚钱，然而你猜对了牛市依然可能买不到最赚的那支股。 房地产投资目前 99%的形式，都是直接投资，实物投资，没有什么指数基金之类的东西，写几万字研究 2018 房价这种虚无的问题，意义何在？ 就算全国跌了，高手买的房子在 2018 年依然会涨。 m2,加息 所以適合入市的時機，應該是政府收緊供應，金管局放寬對銀行的管制，銀行又開始放水出街。對上一次發生是 2009 年初：停止賣地、可以借到九五按、銀行降息搶客、連收租物業都可以借二按！這種情況未來都會發生，大家要多加留意。 Hong KongHow much can I borrowat least 60% in first loan for second house 85 % for first house 95% + 58% off from Hong Kong government 綠置居(don’t need to give up your old house) 95% + 48% off from Hong Kong government 一手居屋 95% + 48%(according to renting date) off from Hong Kong government 二手居屋(don’t need to give up your old house if 白居二) Calculator:http://www.centamortgage.com/v2/Calculator/Index Purchase flowPossibility綠白表比例和今年一樣是 5：5，即各 1,060 個。最終綠表申請人數為 1.25 萬，白表為 9.21 萬，雖然同為超額認購，但綠表平均約 11.8 人爭一個單位，白表卻是 86.9 人，比例有明顯分別。 Execution: View all second hand house(especially that close to 凱樂苑,啟天苑.Don’t consider those oversea ) Draw 凱樂苑 If not draw successfully,immediately buy second hand always look for 白居二(next year 2-3 月) planalways look for 綠置居(未有期)) plan 首置上車盤(2018 年底 申請 未有期) Location 資助置業計劃資助置業計劃 PropertyLadder 公屋住戶今次發達了 OwnershipOwnership,you can always be the owner when you have the name and all people signed https://cecimak1995.blogspot.com/2016/09/blog-post_27.html MeasurementCCL 綠置居【「 綠置居 」恒常化】公屋戶買樓 4 大須知 居屋一手:買居屋全手冊懶人包 Newest 綠表抽新居屋 After selection 二手:上車懶人包 Steps 白表居屋第二市場計劃 2018 首置上車盤馬頭圍道 煥然壹居煥然壹居 CTNCriteria 30-56 meters. 1-2 room Term Down payment Interest rate NetworkBrotherClassmate ReferenceMillionaire Real Estate Hong KongCriteria400 至 450 萬一房，二房都可以15 分鍾步行到火車站不要向西中高楼层对吧10-20% discount還有最好比銀行估值盡量低(20%)小學，中學對我來說不重要，幼兒園反到好點Rent contract Ratio(25 years),租價比(4-5%)15 年楼龄ocean view is not necessaryGood traffic to Shenzhen 廳細房大不用大廚房不需要放洗衣機及晒衣服的位置 Location奧運站 傳統商業區如中上環、灣仔、銅鑼灣、側魚涌、尖沙咀等，擴散到佐敦、旺角、觀塘、九龍灣等，以至被譽為「新中環」的九龍站，結果帶動了附近的地價以至樓價。 九龍邊緣：深水埗區+黃大仙區+觀塘區 大圍 vs 長沙灣 沙田區（不包括馬鞍山） 新界西 - new high way and hong kong bay zone朗屏站(future 旺,便)朗庭園新元朗中心 yuan long YOHO Town YOHO midtown 南昌站(旺,便)沙中綫大圍站(便) 金獅花園名城 East way紅磡至金鐘段 Fanling粉嶺名都 Shatin沙田中心好運中心 楓林閣偉華中心佳寧大廈 Tai Po 逸雅苑 PotentialFirst hand: 朗城滙 Second hand: 好發洋樓 宏發大廈 安寧大廈 郎平 8 號 Shenzhen280 至 320 萬一房，二房都可以15 分鍾步行到火車站不要向西中高楼层对吧還有最好比銀行估值盡量低(20%)小學，中學對我來說不重要，幼兒園反到好點Rent contract Ratio(25 years),租價比(5%)15 年楼龄 廳細房大不用大廚房不需要放洗衣機及晒衣服的位置 精明揀樓 Skillhttps://tokuhon.blog/?p=5595精明揀樓 居住價值、投資價值。購買長遠有價值提升的物業，才是致勝之道。 實用：空間能否盡用、設備是否方便、沒有危險位 實際：間格能否靈活變化、面積有沒有被浪費在間格牆、走廊等https://tokuhon.blog/?p=5419 https://tokuhon.blog/?p=12778 https://tokuhon.blog/?p=5320 http://hk.centanet.com/findproperty/zh-HK/Home/Detail/?ID=50561389-05ea-472e-acf9-47b112cac368&amp;src=S all new house need 2 year","categories":[{"name":"Investment","slug":"Investment","permalink":"http://jeff-chung.com/categories/Investment/"}],"tags":[]},{"title":"Why we need to study data structure and algorithm,the answer is definitely not only Performance!","slug":"program-design/why-we-need-to-study-data-structure","date":"2018-08-23T02:20:15.000Z","updated":"2019-05-06T04:24:36.486Z","comments":true,"path":"2018/08/23/program-design/why-we-need-to-study-data-structure.html","link":"","permalink":"http://jeff-chung.com/2018/08/23/program-design/why-we-need-to-study-data-structure.html","excerpt":"","text":"Reason that we need to study data structure and algorithmBecause we want Good data structure(more important then algorithm) and algorithm improve the program Readability Maintainability Performance which can significant reduce the development and maintenance cost.In fact,if a program have good data-structure,normally people can understand the 70% of the program by just seeing the data structure Prove Funny analogiesWriting program is about writing good story.A good data structure(Character design) is determining 70% of the actual story Bridget Jones’s DiaryFor example,let me give javascript object in 2 program to demonstrate what is good data structure of good guy and bad guy(classical character from) to make it more fun to read and write:). 12345678910//Good guy,Colin Firth&#123; age: 30, name: \"Colin Firth\", hobby: \"Reading\", girlfriend: &#123; name: \"BJ\", hobby:\"wine and movie\", &#125;&#125; 1234567891011121314151617181920//bad guy,Hugh Grant&#123; age: 30, name:\"Hugh Grant\", hobby: (lady)=&gt;lady.hobby, girlfriendsByName: &#123; BJ:&#123; name:\"BJ\", hobby:\"wine and movie\", &#125;, lucy:&#123; name:\"lucy\", hobby:\"photography\", &#125;, angela:&#123; name:\"angela\", hobby:\"dancing\", &#125;, &#125;&#125; In a good guy data-structure,it is definitely to see their is not possibility for cheating(multiple girlfriend) in his program. In a bad guy data-structure,it is definitely to see their is possible for cheating(multiple girlfriend),and his program always need to find proper girlfriend by her name and he don’t have actual hobby,his actual hobby change according to his girlfriend. You see,I can guess 70% of his program(love story) by just reading his data structure! What mean good data structure? Informative Easy manipulation High Readability How to create good data structure? Now the definition of good data structure Study common data structure Always prefer complexer data to represent knowledge of program: Rule of representation,because human always remember and understand data structure then procedure,like you always remember Colin firth is a gentleman but easily forget the actual story of Bridget Jones’s Diary ReferenceThe Art of Unix ProgrammingBridget Jones’s Diary (film)&gt;)","categories":[{"name":"Program design","slug":"Program-design","permalink":"http://jeff-chung.com/categories/Program-design/"}],"tags":[]},{"title":"My Awesome stack","slug":"front-end/my-awesome-stack","date":"2018-08-23T02:20:15.000Z","updated":"2019-05-06T04:24:35.486Z","comments":true,"path":"2018/08/23/front-end/my-awesome-stack.html","link":"","permalink":"http://jeff-chung.com/2018/08/23/front-end/my-awesome-stack.html","excerpt":"","text":"PresentationPPT Spectacle - React Based Presentation,support convert to ppt Email Markdown here Communication Tool Slack Editor Visual Studio code Extension SPAUtil Lodash Recompose Framework React Redux Create React App Create React App TS Create React Native App Web worker Workerize-loader Multi-language react localize redux Editor Draftjs react-draft-wysiwyg Formatting [Prettier] AssetSVG SVGR POST-CSS Styled Component Captcha React Google Recaptcha Route React Navigation Event React Click outside Admin React Admin Map Google map React Network Redux Api middleware Redux bees Redux query BackendFramework KOA 2 Authentication Passport Dependency Injection Inversify JS Typescript TS-Path Deployment Docker Docker compose AWS Godaddy API Swagger GraphQL Source Code Management Git Bitbucket TestingUnit test Jest UI Phantom js slimer js Script Writing Shelljs commander chalk inquirer glob","categories":[{"name":"Web Development","slug":"Web-Development","permalink":"http://jeff-chung.com/categories/Web-Development/"}],"tags":[]},{"title":"From 7 fps to 37 fps-How to use web worker on create react app(CRA) project","slug":"front-end/from-7-fps-to-37-fps-how-to-use-web-worker-on-create-react-app-project","date":"2018-08-17T02:20:15.000Z","updated":"2019-05-06T04:24:35.445Z","comments":true,"path":"2018/08/17/front-end/from-7-fps-to-37-fps-how-to-use-web-worker-on-create-react-app-project.html","link":"","permalink":"http://jeff-chung.com/2018/08/17/front-end/from-7-fps-to-37-fps-how-to-use-web-worker-on-create-react-app-project.html","excerpt":"","text":"Understand the problemSurface problemIn our medical project,when importing segmentation(it was a compute intensive task).It feels freezing of UI. Actual problemHow to implement compute intensive task in Create React App without causing the freezing of main(UI) thread. Devise a planRelationConcurrent model of compute intensive task in webWant to avoid Traditional(setTimeout) give us Web Worker give us Web worker property Provide running script in background thread Not only concurrency but also parallelism Web worker restrictionBrowser restrictionCan I use Restriction by designNot allow to use DOM Local Storage Only allow to communicate with main thread via message api(we will use worker to simply following process) Plan Push compute intensive job to web worker in main thread Web worker will notify main thread once compute intensive job done. The notification interface better be promise instead of callback for code readability Carry out the planToolWorkerize-loader Adv: that don’t need ejection of your Create React APP. Before12345//index.jsreadSegmentation(segmentation)&#123; return computeIntensive(segmentation);&#125;readSegmentation(s1); After123456789//segmentation.jsread(segmentation)&#123; return computeIntensive(segmentation);&#125;//index.jsimport segmentationWorker from 'workerize-loader!./segmentation.js'; // eslint-disable-line import/no-webpack-loader-syntaxconst segmentationInst = segmentationWorker();//the message interface is convert to promiseawait segmentationInst.read(s1); VerificationOptimization ResultBefore Intensive CPU usage only existed in main thread fps drop to 7 fps After Intensive CPU usage only existed in dedicated worker thread fps increase to 37 fps MiscReference http://javascript.ruanyifeng.com/htmlapi/webworker.html What if I need to support IE9 which don’t have web workerI suggest you to use setTimeout break down your task to achieve concurrency to avoid freezing the main(UI) thread Writing MethodologyThis is written according to How to solve it","categories":[{"name":"Web Development","slug":"Web-Development","permalink":"http://jeff-chung.com/categories/Web-Development/"}],"tags":[]},{"title":"How to implement in your web application when your application is supporting REST","slug":"front-end/how-to-implement-graphql","date":"2018-08-14T02:20:15.000Z","updated":"2019-05-06T04:24:35.478Z","comments":true,"path":"2018/08/14/front-end/how-to-implement-graphql.html","link":"","permalink":"http://jeff-chung.com/2018/08/14/front-end/how-to-implement-graphql.html","excerpt":"","text":"Understand the problemSurface problem How to make a call to GraphQL Server How to provide an api in GraphQL Actual problem What is the graphQL api model? How to describe the api and it’s query ? How to implement a graphQL API server and how to implement the query? What is the common implementation of specific api problem? Devise a planRelationGraphql API ModelRest: Entities based apiGraphQL: Tree based api GraphQL is still server-client model http protocol request body&amp;response body is json Description of API and it’s query in graphQLServer API is a tree(Graph). Each node correspond to a field and it’s argument. Server api description language - SchemaThe syntax is TypeScript like but looser 1234567891011121314151617input bookFilter &#123; id: ID title: String author: String isbn: String url: String&#125;// The Actual GraphQL Treetype Query &#123; # arguments filter for filter is just an convention allBook(filter: bookFilter): [Book!]!&#125;type Mutation &#123; createBook(title: String!, author: String!): Book&#125; Client Our query is a tree-like query language which describe the data it’s want based on server GraphQL API Client api query language - QueryDefine fields and field parameter 123456query &#123; allBooks &#123; author, title &#125;&#125; GraphQL Documentation about common api problemQueryPaginationAutomatic Aggregation Plan Write the Schema for application Implement the graphql api in server side Write the Query for client to query Front end application implement the query of graphql Carry out the planGraphQL server and client implementation.ServerYou need to build schema resolver Serve it as http api endpoint I suggest use appollo-server as our tool to build things above,The following is the simplest server demo Simplest Schema WritingOnline Schema and query playground,Online schema &amp;query editor Resolver developmentResolve Helper(Create 80% of your resolver automatically)graphql + sequelize(an orm) Graphql + PostgreSQL P.S GraphQL’s strength is that it gives the frontend more power in determining what data specifically is returned. Some of what you write in GraphQL will be the same as what you would write for a REST API. Client implementationYou need to build query select proper query tool query it using proper query tool Query WritingOnline Schema and query playground,Online schema &amp;query editor Select proper Query ToolApollo ClientRelayGraphql-request P.S Apollo Client &amp; Relay are mostly sacrificing the predictable state change for simply api usage,(for complex front end application,predictable state change is very important). I prefer using redux-api-middleware &amp;&amp; Graphql-request to call the graphql api Final Step Use Online Schema and query playground to write schema Use Graphql + PostgreSQL to implement backend Use Online Schema and query playground to write query Use Graphql-request to implement query Verification For graphql api,define unit test for graphql api End to End test for front end application that utilize graphql api MiscToolGraphQL API to Static Pages,Generate API DocSwagger to GraphQL,easy migrating from RestPublic GraphQL API,very strong community(facebook,github)Rest to graphql migration api on github Writing MethodologyThis is written according to How to solve it","categories":[{"name":"Web Development","slug":"Web-Development","permalink":"http://jeff-chung.com/categories/Web-Development/"}],"tags":[]},{"title":"Why we choose graphql","slug":"front-end/why-we-choose-graphql","date":"2018-08-14T02:20:15.000Z","updated":"2019-05-06T04:24:35.489Z","comments":true,"path":"2018/08/14/front-end/why-we-choose-graphql.html","link":"","permalink":"http://jeff-chung.com/2018/08/14/front-end/why-we-choose-graphql.html","excerpt":"","text":"QuestionWhy we choose graphql api to solve our problem? Why GraphQL is the future – Apollo GraphQL In summary,we have critical problem Over-fetching Too many round trip on api network layer We also want to solve problems like Versioning API Transparency RelationGraphQL documentation have show the ability Ability to avoid over fetching of field Ability to describe nested api Ability of versioning API transparency is very high ExecutionStart to use graphql in a mini project that have our existing problem VerificationCheck whether the problem still exist when using graphQL as our api layer","categories":[{"name":"Web Development","slug":"Web-Development","permalink":"http://jeff-chung.com/categories/Web-Development/"}],"tags":[]},{"title":"Program design guidance and code standard in a React project for intermediate developer for effective development","slug":"front-end/effective-program-design-and-code-standard-in-a-react-project-for-intermediate-developer","date":"2018-08-09T02:20:15.000Z","updated":"2019-05-06T04:24:35.442Z","comments":true,"path":"2018/08/09/front-end/effective-program-design-and-code-standard-in-a-react-project-for-intermediate-developer.html","link":"","permalink":"http://jeff-chung.com/2018/08/09/front-end/effective-program-design-and-code-standard-in-a-react-project-for-intermediate-developer.html","excerpt":"","text":"Design Principle KISS DRY single source of truth no repeat code Single responsibility principle Open close principle Implementation standardReact Smart Component1234567891011121314151617class SeriesPage extends React.Component &#123; render() &#123; return &lt;div&gt;&#123;this.props.hello&#125;&lt;/div&gt;; &#125;&#125;function mapStateToProps()&#123;...&#125;function mapDispatchToProps()&#123;...&#125;export default withRouter( connect( mapStateToProps, mapDispatchToProps )(SeriesPage`)); For more,please reference blog React dummy component12345678910111213141516// badclass Listing extends React.Component &#123; render() &#123; return &lt;div&gt;&#123;this.props.hello&#125;&lt;/div&gt;; &#125;&#125;// bad (relying on function name inference is discouraged)const Listing = (&#123; hello &#125;) =&gt; ( &lt;div&gt;&#123;hello&#125;&lt;/div&gt;);// goodfunction Listing(&#123; hello &#125;) &#123; return &lt;div&gt;&#123;hello&#125;&lt;/div&gt;;&#125; For more,please reference airbnb","categories":[{"name":"Web Development","slug":"Web-Development","permalink":"http://jeff-chung.com/categories/Web-Development/"}],"tags":[]},{"title":"前端团队的技术成长","slug":"it-management/technical-growth-of-front-end-team","date":"2018-07-30T02:20:15.000Z","updated":"2019-05-06T04:24:36.302Z","comments":true,"path":"2018/07/30/it-management/technical-growth-of-front-end-team.html","link":"","permalink":"http://jeff-chung.com/2018/07/30/it-management/technical-growth-of-front-end-team.html","excerpt":"","text":"為什麼要有定位和反思什么样的团队能有 话语权？很简单，被依赖的团队。我目前带的团队服务公司许多业务，在大部分业务上前端比较有话语权，并不在于说那个业务或者整个公司有多么重视前端，而是通过长久顺畅的合作，让业务方了解和认知到这个前端的团队是不可替代的。 Astri 数字病理诊断前端的定位我们创造什么样的产品? 新一代病理诊断 Web 应用 对病人 新一代病理诊断 Web 应用意昧令病人随时随地知道自己的病情 对诊断人員 高性能 和 人机高效交互 的病理诊断 Web 和移动 Web 应用,這令诊断人員 随时随地高效工作. 对企业主和 IT 部門 高 維護性(maintainability) = 低成本維護 容器化(dockerize)部署 = 快速、可重复和可靠的部署 = 快速赶上市场变化 Web 和移动 Web 应用 = 高覆盖面 + 無安装成本 + 快速更新 Astri 数字病理诊断前端的反思好的管理者会特别注意成员的 潜在价值和 成长空间 我能做 + 我想做 + 需要我 = 核心价值设计人机高效交互能力知识 人机界面设计 学习模型(心流,刻意训练,学习密度,快学习记忆和回忆,费曼方法) 管理和实现复杂前端逻辑的能力知识 定义问题和解决问题的能力 深入理解程序设计（原理、复杂性模型、数据结构和算法） 严格编码约定(airbnb) 测试驱动开发 TDD 开发人员之间共享知识的文化 愿意选择社区良好解决方案 工具 Jest React Redux Prettier Swagger 快速、可重复和可靠的部署知识 容器化(dockerize)部署 AWS 开发高性能 Web 应用程序的能力知识 深入理解 Web 渲染模型 深入理解(React) 渲染模型和哲学 深入理解浏览器事件模型&amp; 事件委派 深入理解 HTTP 协议 深入理解 Web Worker 领域知识医疗 病理学 MRI 文件格式 DZM DICOM NII 我能做 + 我想做 + 不需要我 = 潜在价值我能做 + 我不想做 + 需要我 = 例行工作我能做 + 我不想做 + 不需要我 = backup我不能做 + 我想做 + 需要我 = 成长空间人机交互操作反馈改进方法知识 A/B Test Analytic 对于人机高效交互操作有循序渐进的学习曲线,知识 学习曲线 具有高网络效率和低时延的网络模型设计与实现能力問題 Over-fetching (Overall entity) Too many Round-trip (Different end point) 知识 GraphQL &amp; Rest Pagination Filtering 快速、可重复和可靠的部署知识 CICD 高协作性的 Web 应用程序知识 Web socket 开发高性能 Web 应用程序的能力知识 Service worker 我不能做 + 我想做 + 不需要我 = 自我追求我不能做 + 我不想做 + 需要我 = 无法胜任我不能做 + 我不想做 + 不需要我 = 无需关注","categories":[{"name":"management and cooperation","slug":"management-and-cooperation","permalink":"http://jeff-chung.com/categories/management-and-cooperation/"}],"tags":[]},{"title":"Efficient and high readability transfer protocol","slug":"program-design/efficiency-and-high-readability-transfer-protocol","date":"2018-06-27T02:28:44.000Z","updated":"2019-05-06T04:24:36.483Z","comments":true,"path":"2018/06/27/program-design/efficiency-and-high-readability-transfer-protocol.html","link":"","permalink":"http://jeff-chung.com/2018/06/27/program-design/efficiency-and-high-readability-transfer-protocol.html","excerpt":"","text":"Basic knowledge and problem Selecting format is selecting proper container for your lunch,it just contains all your food properly without taking unnecessary size and it looks good – Jeff Chung BasicAll data eventually sent in binary format.Binary don’t necessary means program memory,it can be transfer protocol ProblemConsider you need to transfer 1[255,0,128] ImplementationJson255,0,128 is uint8.It take 2 bytes to describe one number in array Reference Serialization : Array(e.g 255) =&gt; Json([i][4][int8][i][16]) =[browser json conversion] &gt; binaryDe-serialization : binary =[server json conversion]&gt; json =&gt; array Http Implementation:Normally specific content-type is json will make the browser automatically serialize in json format Byte Array Transferwe use 1 byte ,8 bit to describe 255,0,128.It take 1 bytes to describe one number in array Serialization : Array(e.g 255) =&gt; Blob(1111 1111) = [browser direct send] &gt; binaryDe-serialization : binary = [server direct get] &gt; Blob(1111 1111) =&gt; array(e.g 255) Http Implementation:Data is already binary(as serialized byte array),don’t need conversion by browser 12345678Content-Type:multipart/form-data; boundary=----WebKitFormBoundaryJQc4u8OmWvQ1hqcB------WebKitFormBoundaryJQc4u8OmWvQ1hqcBContent-Disposition: form-data; name=&quot;wadouri:http://localhost:3000/demo/IM**00005.dcm&quot;; filename=&quot;blob&quot;Content-Type: application/octet-stream------WebKitFormBoundaryJQc4u8OmWvQ1hqcB- Form datawe use 1 byte ,8 bit to describe every character in 255,0,128.It take 1 bytes to describe one character array Serialization : Array(e.g 255) =&gt; utf8 (1 x 3 byte = 3 byte) =&gt; binaryDe-serialization : binary =&gt; utf8(1x 3 = 3 bit) =&gt; array(e.g 255) ConclusionByteArray always has higher performance but json has higher readability.","categories":[{"name":"Program design","slug":"Program-design","permalink":"http://jeff-chung.com/categories/Program-design/"}],"tags":[]},{"title":"Rest VS GRAPHQL","slug":"program-design/rest-vs-grapth-ql","date":"2018-06-27T02:28:44.000Z","updated":"2019-05-06T04:24:36.486Z","comments":true,"path":"2018/06/27/program-design/rest-vs-grapth-ql.html","link":"","permalink":"http://jeff-chung.com/2018/06/27/program-design/rest-vs-grapth-ql.html","excerpt":"","text":"Solution Special API - by backend developer e.g series/labelMap/?user series/labelMap/?statisticalCountTotal=labelMap Adv: Opportunity to optimize specific api More predictable api behavior DisAdv: Require manual development lack of typing&amp;Meta Data API that support specific queryLanguage,e.g Grapth QL Adv: Once development,most of special api don’t need manual development Typing&amp;Meta Data Good Discoverability DisAdv: Naive implement of graphql may take many server resource Learning curve for both backend and frontend SummaryIn a facebook use case(Solve over-fetching &amp; round tripping for countless api and client application that use them),graphql is a good place for them to solve their problem.And the discoverability &amp; typing increase the development speed of api consumer. If you organization only support specific api and client application,develop special API - by backend developer is still a good solution.","categories":[{"name":"Program design","slug":"Program-design","permalink":"http://jeff-chung.com/categories/Program-design/"}],"tags":[]},{"title":"Improvement es6 react project to typescript project","slug":"front-end/imporvement-es6-react-project-to-typescript-project","date":"2018-06-04T02:20:15.000Z","updated":"2019-05-06T04:24:35.486Z","comments":true,"path":"2018/06/04/front-end/imporvement-es6-react-project-to-typescript-project.html","link":"","permalink":"http://jeff-chung.com/2018/06/04/front-end/imporvement-es6-react-project-to-typescript-project.html","excerpt":"","text":"Total Effort evaluation for progressPredict react element to changeGlobal Search Number of React Element 30/99 Minimal effort to see effortEffortChange one fileAuto complete in one file Relevancy to new taskZero","categories":[{"name":"Web Development","slug":"Web-Development","permalink":"http://jeff-chung.com/categories/Web-Development/"}],"tags":[]},{"title":"Optimization of creating svg","slug":"front-end/batch-load-optimization","date":"2018-05-23T02:20:15.000Z","updated":"2019-05-06T04:24:35.441Z","comments":true,"path":"2018/05/23/front-end/batch-load-optimization.html","link":"","permalink":"http://jeff-chung.com/2018/05/23/front-end/batch-load-optimization.html","excerpt":"","text":"Performance recordLoading ~450 annotations Count avg requestAnimationFrame time usage(ms) Total Time(s) 1 50 13.462 3 65 11.802 5 73 11.917 10 114 10.881 20 230 10.959","categories":[{"name":"Web Development","slug":"Web-Development","permalink":"http://jeff-chung.com/categories/Web-Development/"}],"tags":[]},{"title":"CMS development flow","slug":"it-management/cms-development-flow","date":"2018-05-20T02:28:21.000Z","updated":"2019-05-06T04:24:36.276Z","comments":true,"path":"2018/05/20/it-management/cms-development-flow.html","link":"","permalink":"http://jeff-chung.com/2018/05/20/it-management/cms-development-flow.html","excerpt":"","text":"","categories":[{"name":"management and cooperation","slug":"management-and-cooperation","permalink":"http://jeff-chung.com/categories/management-and-cooperation/"}],"tags":[]},{"title":"Regular expression tutorial & Tool","slug":"implementation/regex-expression-useful-tutorial-and-tool","date":"2018-05-16T02:28:21.000Z","updated":"2019-05-06T04:24:35.492Z","comments":true,"path":"2018/05/16/implementation/regex-expression-useful-tutorial-and-tool.html","link":"","permalink":"http://jeff-chung.com/2018/05/16/implementation/regex-expression-useful-tutorial-and-tool.html","excerpt":"","text":"Before ReadingWhat can you learn?Regular expression tutorial &amp; Tool How many times it take to read this article?25 mins Tutorial正则表达式 30 分钟入门教程 Tester Toolhttps://regex101.com/ Capture &amp; match example in javascripthttps://stackoverflow.com/questions/432493/how-do-you-access-the-matched-groups-in-a-javascript-regular-expression","categories":[{"name":"Implementation","slug":"Implementation","permalink":"http://jeff-chung.com/categories/Implementation/"}],"tags":[]},{"title":"Don't make your software engineer happy,make them strong","slug":"Don-t-make-your-software-engineer-happy-make-them-strong","date":"2018-05-10T09:17:20.000Z","updated":"2019-05-06T04:24:35.422Z","comments":true,"path":"2018/05/10/Don-t-make-your-software-engineer-happy-make-them-strong.html","link":"","permalink":"http://jeff-chung.com/2018/05/10/Don-t-make-your-software-engineer-happy-make-them-strong.html","excerpt":"","text":"Before ReadingWhat can you learn?Must know function and keymap you should look for IDE for Coding Factoring (for react&amp;node js) to double your coding development speed from pro software engineer How many times it take to read this article?25 mins Read and coding","categories":[],"tags":[]},{"title":"全香港最大的P2P葡萄酒网上销售平台 - www.vy.hk","slug":"product/vy","date":"2018-05-10T08:09:02.000Z","updated":"2019-05-06T04:24:36.483Z","comments":true,"path":"2018/05/10/product/vy.html","link":"","permalink":"http://jeff-chung.com/2018/05/10/product/vy.html","excerpt":"","text":"www.vy.hk - 全香港最大的 P2P 葡萄酒网上销售平台 Success Over 500 vendor Over 10k wines Business FeaturePlatformAllow different vendor sell and wine collector to quote and purchase high class wines. Multiple VendorFor different vendor,their is a admin panel for reply quotations and fulfill orders. Wine collector quote and purchase wineWine collector can quote specific wine and purchase quoted wine. Notification by emailThe entire quotation and purchase process will notify wine collectors and vendor by email,web notification Complex SearchWine collector can search over 10k wine massive wine by complex wine conditions in 1 seco Wine price historyProvide previous wine price trend for wine collector to decide whether should purchase wine. Multi-languageSupport Chinese and English Technical FeatureTechnical CloudRun on aws elastic beanstalk,highly scalable using mysql on rds and php on ec2 Tddphpunit,100% test coverage on Search Quotation and purchase flow What I can help you?I can provide detail consulting services on business requirement technical To help you build successful business!My email master-craftsman@jeff-chung.com","categories":[{"name":"我的产品","slug":"我的产品","permalink":"http://jeff-chung.com/categories/我的产品/"}],"tags":[]},{"title":"定點、電腦及手機自助廣告播放一站式平台 - www.abshare.com","slug":"product/adshare","date":"2018-05-09T08:09:02.000Z","updated":"2019-05-06T04:24:36.482Z","comments":true,"path":"2018/05/09/product/adshare.html","link":"","permalink":"http://jeff-chung.com/2018/05/09/product/adshare.html","excerpt":"","text":"www.abshare.com - 定點、電腦及手機自助廣告播放一站式平台 Business FeaturePlatformAllow different user to create advertising design and select advertising location online DesignerThe advertising designer is a power-point like web-based application that allow user to create advertisement online Multi-platformThe website support desktop and mobile version. Approvement flowFor different advertisement,here is an approve/reject flow in admin Multi-languageSupport Chinese and English What I can help you?I can provide detail consulting services on business requirement technical To help you build successful business!My email master-craftsman@jeff-chung.com","categories":[{"name":"我的产品","slug":"我的产品","permalink":"http://jeff-chung.com/categories/我的产品/"}],"tags":[]},{"title":"中国龙头第三方医学检验数字化病理诊断工具","slug":"product/kingmed","date":"2018-05-08T08:09:02.000Z","updated":"2019-05-06T04:24:36.482Z","comments":true,"path":"2018/05/08/product/kingmed.html","link":"","permalink":"http://jeff-chung.com/2018/05/08/product/kingmed.html","excerpt":"","text":"Success KingMed Diagnostics is the largest independent diagnostic laboratory and pathology service provider in China Business FeatureDevelop a pathology image data analytics platform including distributed pathology image data storage and management system parallel computing engine and function library for pathology image analytics Develop two computer-aided diagnosis applications through the medical image data analytics platform, with measurable performance benchmark comparison to existing systems Develop a standard recommendation for web-based digital pathology information exchange in tele-diagnosis including an annotation and markup data model a cross platform image viewer interface supporting large data visualization and statistics What I can help you?I can provide detail consulting services on business requirement technical https://vimeo.com/267182668 To help you build successful business!My email master-craftsman@jeff-chung.com","categories":[{"name":"我的产品","slug":"我的产品","permalink":"http://jeff-chung.com/categories/我的产品/"}],"tags":[]},{"title":"Double your development speed in visual studio for Javascript","slug":"implementation/Double-your-coding-and-refactoring-speed-must-know-function-and-keymap-you-should-look-for-Editor-IDE-visual-studio-code-example","date":"2018-05-04T02:28:21.000Z","updated":"2019-05-06T04:24:35.491Z","comments":true,"path":"2018/05/04/implementation/Double-your-coding-and-refactoring-speed-must-know-function-and-keymap-you-should-look-for-Editor-IDE-visual-studio-code-example.html","link":"","permalink":"http://jeff-chung.com/2018/05/04/implementation/Double-your-coding-and-refactoring-speed-must-know-function-and-keymap-you-should-look-for-Editor-IDE-visual-studio-code-example.html","excerpt":"","text":"Before ReadingWhat can you learn?Must know function and keymap you should look for IDE for Coding Factoring (for react&amp;node js) to double your coding development speed from pro software engineer How many times it take to read this article?25 mins Read and codingSyntax HighlightVscode has syntax highlight JS,JSX,TS,TSX by default. Show Definition when function callNeed project configuration when absolute import is used Find in one fileVscode Command : actions.findVscode Keymap : Ctrl + F Replace in one fileVscode Command : editor.action.startFindReplaceActionVscode Keymap : Ctrl + HSuggested Rename Keymap : Ctrl + R Find in files(or a project)Vscode Command : workbench.action.findInFilesVscode Keymap : Ctrl + Shift + F Replace in filesVscode Command : workbench.action.replaceInFilesVscode Keymap : Ctrl + Shift + HSuggested Rename Keymap : Ctrl + Shift + R Quick FixVscode Command : editor.action.quickFixVscode Keymap : Ctrl + . Move LineAlt + arrow up/down Multi cursor editingAlt + Shift + arrow up/down File navigatingNeed project configuration when absolute import is used Open FileVscode Command : workbench.action.files.openFileVscode Keymap : Ctrl + P Go to symbolVscode Command : workbench.action.gotoSymbolVscode Keymap : Ctrl + Shift + OSuggested Rename Keymap : Ctrl + O Go to definitionVscode Command : editor.action.goToDeclarationVscode Keymap : F12 Go to LineVscode Command : workbench.action.gotoLineVscode Keymap : Ctrl + g Go to next EditorVscode Command : workbench.action.nextEditorVscode Keymap : Ctrl + Page Down Go to previous EditorVscode Command : workbench.action.previousEditorVscode Keymap : Ctrl + Page Up Go to specific EditorVscode Command : workbench.action.openEditorAtIndex1Vscode Keymap : alt + 1 Close current editorVscode Command : workbench.action.closeWindowVscode Keymap : Ctrl + w ReferenceFile Navigation RefactorNeed project configuration when absolute import is used Rewrite function/variable nameVscode Command : workbench.action.closeWindowVscode Keymap : F2 ReferenceRefactoring Command terminalShow All CommandsVscode Command : workbench.action.showCommandsVscode Keymap : Ctrl + shift + P Project configurationYou need &#39;jsconfig.json&#39; or &#39;tsconfig.json&#39;(when you use typescript) with following config for import absolute path 12345&#123; &quot;compilerOptions&quot;: &#123; &quot;baseUrl&quot;: &quot;src&quot; &#125;&#125; SettingFormat on save1&quot;editor.formatOnSave&quot;: true, ExtensionGrammar CheckingCode Spell Checker PrettierPrettier MarkdownMarkdown all in one","categories":[{"name":"Implementation","slug":"Implementation","permalink":"http://jeff-chung.com/categories/Implementation/"}],"tags":[]},{"title":"Typescript & Flow in React&Redux SPA Development","slug":"front-end/type-system-javascript","date":"2018-05-02T02:20:15.000Z","updated":"2019-05-06T04:24:35.488Z","comments":true,"path":"2018/05/02/front-end/type-system-javascript.html","link":"","permalink":"http://jeff-chung.com/2018/05/02/front-end/type-system-javascript.html","excerpt":"","text":"PurposeIntroduce type system to our application and library project. discover and remove type error in compile time Increase the ease of refactoring help developers to use function easily as the project size/complexity increase RapidlyDevelop new empty project as explorer tool One application that have type system One library that have type system and can be used by application we develop before Both of them need to support type in Helper React Redux Styled-Component Works Well With Jest Absolute Path ExploreCandidates: Typescript Flow Compare Typscript-vs-flow is a good general compare Type Systems: Structural vs. Nominal typing explained Flow Typescript Author Facebook Typescript IDE &amp; Language server Atom(Slow&amp;High Memory consumption) VS studio code(Fast) Build tool Babel Typescript Start tool natively built in at Create React App Need to use Create React App Typescript Ecosystem Flow Type - Medium Size Typescript - Large Size Application Example Create Good Library Example Flow Type - Medium Basic Syntax equal equal High Level Concept structural typing for objects and functions, nominal typing for classes Mostly Structural Knowledge about type systemNominal TypeStructural Type Typescript CompilerOptionhttps://www.typescriptlang.org/docs/handbook/compiler-options.html Path mapping when you use absolute pathhttps://www.typescriptlang.org/docs/handbook/module-resolution.html#path-mapping Debug skill1npx tsc --traceResolution | code - Absolute path problem when export libraryFacttypescript module resolution don’t rewrite path when export Compile source code solution https://www.npmjs.com/package/@coldmind/tspath https://www.npmjs.com/package/convert-root-import Webpack solution for absolute=&gt;relative when exportinghttps://decembersoft.com/posts/say-goodbye-to-relative-paths-in-typescript-imports/ Babel solution for absolute=&gt;relative when exportinghttps://github.com/entwicklerstube/babel-plugin-root-import React Redux Typescript Coding Guidehttps://github.com/piotrwitek/react-redux-typescript-guide Use library with babel RegeneratorRuntime when your build tool is typescriptProject like git@github.com:agraboso/redux-api-middleware.git regeneratorRuntime as babel async,we need to rebuild by typescript version https://github.com/wmonk/create-react-app-typescript/issues/88 Use create-react-app-ts to create library&amp;applicationhttps://medium.com/@stokedbits/adventures-in-creating-a-react-component-library-with-create-react-app-and-typescript-26d1116a7d87 Create Library Referencehttps://github.com/DimiMikadze/create-react-library https://github.com/alexjoverm/typescript-library-starter Existing Famous library using typescripthttps://github.com/ant-design/ant-design Jest Install ts-jest to compile .ts file Tell Jest for module resolution like this in package.json 123456789101112131415161718&quot;jest&quot;: &#123; &quot;transform&quot;: &#123; &quot;^.+\\\\.tsx?$&quot;: &quot;ts-jest&quot; &#125;, &quot;testRegex&quot;: &quot;(/__tests__/.*|(\\\\.|/)(test|spec))\\\\.(jsx?|tsx?)$&quot;, &quot;moduleDirectories&quot;: [ &quot;src&quot;, &quot;node_modules&quot; ], &quot;moduleFileExtensions&quot;: [ &quot;ts&quot;, &quot;tsx&quot;, &quot;js&quot;, &quot;jsx&quot;, &quot;json&quot;, &quot;node&quot; ] &#125; FeedbackTypescriptBuild application using typescript - DoneBuild library using typescript - Doneresolve absolute path issue with typescript lib - Done Solution for different issueAbsolute path problem when export libraryCompile source code solution is adopted for no configuration for the library user. Coding GuideAirbnbReact Redux Typescript guide is adopted Testts-jest is adopted for running .test.ts file EliminateFlow very slow ide performance when using atom very slow/buggy language server resolution RecordSuccessfully substitute our stack to typescript for project that have large scale Main-Advantage Simplified build tool chain for lib &amp; app Extra BenefitGeneral VSCode support make Unit Test &amp;&amp; Refactor Faster API generation styleguide make Dummy Component Development Faster Function(jsx nested called) calling faster due to auto complete Discover type error in compile type Specific Library generated in Common Js format instead of big umd file so significantly increase Readability of library Able to generate test coverage Able to generate style guide Remove export file that reduce code redundancy(because the user is directly utilize the code)","categories":[{"name":"Web Development","slug":"Web-Development","permalink":"http://jeff-chung.com/categories/Web-Development/"}],"tags":[]},{"title":"Highly complex network,media,calculation front end architecture","slug":"front-end/highly-complex-network-and-media-layer-application-tool","date":"2018-05-02T02:20:15.000Z","updated":"2019-05-06T04:24:35.476Z","comments":true,"path":"2018/05/02/front-end/highly-complex-network-and-media-layer-application-tool.html","link":"","permalink":"http://jeff-chung.com/2018/05/02/front-end/highly-complex-network-and-media-layer-application-tool.html","excerpt":"","text":"Purpose:Find architecture that have NecessaryStorage Unlimited storage Network Custom Connection pool Socket Connection Media&amp;Graphical Control Ability to control each pixel(custom render engine) Calculation Good parallelism support Bonus Cross platform (Ability to run in different OS)","categories":[{"name":"Web Development","slug":"Web-Development","permalink":"http://jeff-chung.com/categories/Web-Development/"}],"tags":[]},{"title":"Code Review 做法和好处","slug":"code-review/general-review","date":"2018-04-30T03:43:00.000Z","updated":"2019-05-06T04:24:35.438Z","comments":true,"path":"2018/04/30/code-review/general-review.html","link":"","permalink":"http://jeff-chung.com/2018/04/30/code-review/general-review.html","excerpt":"","text":"阅读前 阅读这篇文章后你能学到什么? Code Review 做法和好处 你将用多少时间来阅读这篇文章? 25 分钟 好处 分享知识 提高代码的可读性 做法 在每次 Code Review 和 解决 bug 之后,我们都會发现新的有效做法并写在 CONTRIBUTION.md 上,共同维护最佳做法 定期地 - 每个星期五我们都會做 Code Review Code review 做得好和做得不好的信号好 团队成员知识增长 Team member knowledge increase 团队成员接受培训而不是批评 Team member feel being trained instead of criticized 团队成员知道代码评审何时发生并期待它 Team member know when the code review happen and look forward to it 给定特定的代码块，您无法判断是谁编写的。Given specific block of code,you cannot tell who write it. 相同/相似的 bug 不会重复两次 Same/similar bug don’t repeat twice 不好 毫无理由地批评代码——当你指出一个代码写得很差时，你不能指出相关的代码 on CONTRIBUTION.md criticize code without reason - When you point an code written poorly,you cannot point that related implementation on CONTRIBUTION.md 例子 Code Review - General(Javascript) React &amp; Redux Code Review - Action Code Review - Reducer Code Review - Helper Code Review - Smart Component Code Review - Dummy-component Code Review - Middleware Code Review - Network Code Review - Asset","categories":[{"name":"Code Review","slug":"Code-Review","permalink":"http://jeff-chung.com/categories/Code-Review/"}],"tags":[]},{"title":"Code Review - Dummy-component","slug":"code-review/dummy-component","date":"2018-04-28T08:09:02.000Z","updated":"2019-05-06T04:24:35.438Z","comments":true,"path":"2018/04/28/code-review/dummy-component.html","link":"","permalink":"http://jeff-chung.com/2018/04/28/code-review/dummy-component.html","excerpt":"","text":"","categories":[{"name":"Code Review","slug":"Code-Review","permalink":"http://jeff-chung.com/categories/Code-Review/"}],"tags":[]},{"title":"Code Review - Asset","slug":"code-review/asset","date":"2018-04-28T08:09:02.000Z","updated":"2019-05-06T04:24:35.438Z","comments":true,"path":"2018/04/28/code-review/asset.html","link":"","permalink":"http://jeff-chung.com/2018/04/28/code-review/asset.html","excerpt":"","text":"","categories":[{"name":"Code Review","slug":"Code-Review","permalink":"http://jeff-chung.com/categories/Code-Review/"}],"tags":[]},{"title":"Code Review - Network","slug":"code-review/network","date":"2018-04-28T08:09:02.000Z","updated":"2019-05-06T04:24:35.439Z","comments":true,"path":"2018/04/28/code-review/network.html","link":"","permalink":"http://jeff-chung.com/2018/04/28/code-review/network.html","excerpt":"","text":"","categories":[{"name":"Code Review","slug":"Code-Review","permalink":"http://jeff-chung.com/categories/Code-Review/"}],"tags":[]},{"title":"Code Review - Action","slug":"code-review/action","date":"2018-04-28T08:09:02.000Z","updated":"2019-05-06T04:24:35.437Z","comments":true,"path":"2018/04/28/code-review/action.html","link":"","permalink":"http://jeff-chung.com/2018/04/28/code-review/action.html","excerpt":"","text":"","categories":[{"name":"Code Review","slug":"Code-Review","permalink":"http://jeff-chung.com/categories/Code-Review/"}],"tags":[]},{"title":"书单","slug":"me/booklist-for-2018","date":"2018-04-28T08:09:02.000Z","updated":"2019-05-06T04:24:36.302Z","comments":true,"path":"2018/04/28/me/booklist-for-2018.html","link":"","permalink":"http://jeff-chung.com/2018/04/28/me/booklist-for-2018.html","excerpt":"","text":"爱与生命 如何不喜欢一个人 - 2018 不完美，才美 - 2018 荒野生存：阿拉斯加之死(2013 珍藏版) 每一个不曾起舞的日子，都是对生命的辜负 耶鲁大学公开课：死亡 你就要很独特 管理 部落的力量 - 2018 领导梯队:全面打造领导力驱动型公司(原书第 2 版) (领导梯队建设) - 2018 商业 22 条商规：美国 CEO 最怕竞争对手读到的商界奇书 (定位经典丛书) - 2018 增长黑客:创业公司的用户与收入增长秘籍 - 2018 原则（完整图文版）- 2018 咨询的奥秘 格调（精确而刺痛人的社会等级指南，畅销 30 年的品味评判毒舌之作，告诉你真正的格调超然于等级之外！）- 2018 方法论: 学会提问(原书第 10 版) - 2017 to 2018 系统思考（白金版） 演讲和写作* 演讲的力量（完整图文版）- 2018 编程(implementation) 代码整洁之道 - 2018 编写可读代码的艺术 (O’Reilly 精品图书系列) - 2018 Google 软件测试之道 程式设计: 领域驱动设计 软件核心复杂性应对之道 修订版 - 2018 冥想:* 盗火：硅谷、海豹突击队和疯狂科学家如何变革我们的工作和生活 - 2018 投资:_ 房债：为什么会出现大衰退，如何避免重蹈覆辙（比较译丛系列）- 2018 ~~~~_ 买个好房子：知乎徐斌作品 (知乎「一小时」系列) - 2018 小说＊ 老人与海 - 2018 ## 人际关系 卡耐基说话技巧与人际交往 - 2018 别对我说谎:FBI 教你破解语言密码 FBI 教你破解身体语言(白金升级版) 人性的优点全集 人性的弱点全集 社交天性：人类社交的三大驱动力 ## 政治 观念的水位 送你一颗子弹 民主的细节：当代美国政治观察随笔","categories":[{"name":"关于我","slug":"关于我","permalink":"http://jeff-chung.com/categories/关于我/"}],"tags":[]},{"title":"Current salary and expected salary","slug":"me/currentSalary","date":"2018-04-28T08:09:02.000Z","updated":"2019-05-06T04:24:36.303Z","comments":true,"path":"2018/04/28/me/currentSalary.html","link":"","permalink":"http://jeff-chung.com/2018/04/28/me/currentSalary.html","excerpt":"The article has been encrypted, please enter your password to view.","text":"Please enter the password to read the blog. Incorrect Password! No content to display! U2FsdGVkX19d7AsgxPSOsxABEHcJq1uItFC3/GLmhCEL+n6Rudpy88OI9X65iuQsSWEfYzuPWat3f79U05F4dreeStQpTVOZZc/jNc28mPJrLXyWibteDuCs+9IVmxaN5iU0PCpB8qwygPUNL0KKnwpyBU+ev+gBI7tYo4nL5Ua4HJiEyOmKJMGwRPHnIfd4quPQyjOvHL9wWS1BanahbeRtuSj7PK6Vfx5A33IglWUtuU5Wqu6iTsvK+Z46NVNqbaoZi8m9buXvmOnvjCdALmtswMxSo0M7S9SP0KxuOiJ3P92+vKjGpCIm/0DipVajW3rJfNxVEbWVKaaC2pUJPmLU3hPOZ/Ckaqvzd7K73nhlJGpfN6rD5Qv8Gpd2BkghlvZzgxvhEVOpBL8N4k4RfHCTKBlFmBPs1hY1/DRJu5cpglhirGCFL4CYN80tOBsnBhct00t+p/B9vk6FWocT2Cf72p1MmxGGC1q8tDXt8hkoMQK+lig3cVKO5JIv/so4tGN7wsAVJm3ludR2TnMFZ6b9uJRgkD5b64RZeYypDk6sy9igfplwaxFA7OyOqxkqJvGu4z/9jsaqysSRpSQdnMF4uZpYe3NB+3pB4pyZkHHpvvm5+hSdl19QBPsNbfi7d6i8RQJdmrPfMFG2lQrLcteBxR3kVapCTQ5GONArsEyRxbee8LaWCIJulUfM8xApEI1VtY+ORnTsSL4JSZ9m/dENDjXSZu9zHmq6PMPDH3bAMln3Rz/uCZb3vaQMA0mqQVh75RVeJ6d+zV65YnozTVRmY+9QvyKYukCHlJKAMrWTZLzvcf4ITp5bOrpDuOCCFkWuxoCkROb6NIinUX/IXXJErr5ueTa+/MZNRjZ6dziSUxgdLXv4Rsc8G8XiZuJA2vU+f6ZQh0TMPu8ky+AJ6UxLFleDmviOJ3b5g/e+SzKijPnZU43PFXgl2SPnQtTpqRJVJlMjH74dWMUKMQs8aIqBilW5itpjK9FA5VN8DTV8wRyP6TJstolH11emTTq4t+yJbFNtIADZAPPLAXeVVLSQ1i+x4CcUkkhLlLD7g/6wLhAd3RQZmiLmgYTHO1T8d6UjbV0gdz4Y7S7bcUxtVY+2/QsHzbsZn1+ZpuiVUMQcG0UJiKSqQS9RxSEgvcIeLbDT5R/IyCtjb6zDkvVUt37tY2D4beFenoKLEXEJI28dfD1cUan+t4Hlj3dBxKTELaxyIOBHBkGQhr0QfF8+mWD9y1RGdo0jLc2gjsoMBiVSENA1F9Fp+oCiH/Qv6Mc+ECw81umSFa7E62lf7S46ZU8CeR2+fSaSpCOfriujdkaK18qYH2jeqJxShh5mPo3b73hJ7gEEe9eLFxZWrazOYVAGqM6OZxv1uxyG2QuNt+N5YaeYHKs5j/tRw72y+IF55qaRBLfC0OAzwAWMySGmUHaQ7kdlGmcg6nUQES9G+us2yQDzu1s0tl/nc/bhhBj+eJ4aOtg6jJwclfpSmJYhRlGkmRJwfgVBscEK3IUTAAiVoYYv+iDMqLFxJIb5SKFnzOZU43ymisYFOSI0AvJs3tj1TqCFkX+5xZRkwUhA+yUpzC5lNbRh6l3oVqxT/nhYKsLdUlBI+baxN76kXAcyqDIMLAf2NJHCp9qRLr1HB4scnU05bmfgVeHtmxKQWfwa0XqDHLZNXaC22mnCJC2ERHVyTuMrIPViAOjqWzbqu1+MOOyRVT0ZWewJU0cbV5DU70ryViMIISx3Z39S4/vUI3SOaxyttOzhoCOlk9HuhEcx+sVvyZTRq7oaIJ+i3KxztTsVFe5LtTt9fGknVncp5m6/X1xFH3gabujXiR4G41Sv9sv5Hm9tFZReJhyOWdelXiiafidW0VlWQ+ZQSAJlEaDIqizYZRpwo28a65vFl4PmpyKxZPWVUR4Xw3iA6lzyNYKMpoD+MSRL/YBEeBnvgr43e1Wi9mbG+g+TYzPClgpd88PLzTqoDjCRZr5YrAKvUNnjcRTPJgQxPHrTlnrmhTzbHU/ZZNckeT60yHPvgN4kSC8akSgGEilq2prdHcuSVVqpoNKn18rKHFQ5Q9qqE+MlYq7LOVm0Xj9ELffd6Fh20vCG/YkrBCotUYNtg0y0O70ORiRUAnN6V/d3xGdlNIDHkSxW82OqHAmV+K/xKrOyKlRZnfkzV7wyxHoV2PRkgfIek6rYy0u47TwZHzXE1N6Ej2edBh6/RUCy58X34kICJ35PknRsaLheeKks7liw2talxWhTQkBiutWAEF+XgVO+LBXscrZsMxKTpEaAGWosL9eBsXrweTkM1+J0ou4tJTQuE1Hp0KeD8/hQN8RzwY26q6CBUDenIEsC5i6vlQ75LQkorqT19MluMINNqAFpjv38UByZ5/kKIgWxVbjyhsQLz5jgi1ji1S7Vsvt+siRmUQrudTLCjP4+JSsd5AS4QzknbysvxA97xQvpDr4CB8tYjpkcCyWkZh14NdH3j/HDsQ2euGboTYsqOZcDZe16bZnIgVY4v3egSYzty5C0GO60FKOBVDQcmw9Jt2PmhIdAbeg1A/KGq2GoyaBrTr2L43Fb9iMVVajln+9P4TZ1wRyhf6es98DGdynqTvj9vVwzFaYMvHIeStT2gCe67S84WLOhX3HmNO3UPLcKMGYyq9JbcrTR4WeGanbuUS38wuiSS5pqgoWGelmgGyUmP+mG/EyMqvSuftPOrphVT7NdePDqLfk3nLiWLm5DjuHro9ggDAvuYLItEgomHT6VzD0wbjfdy0DrR0c2NeGfF517hMZXhRFXm+SjEOLKNnfKfoiD0LT2yGX+y+nN0IaCQc+OLTOEnVDdK48IRY4sQC327B2drq/fNX25jXkYc3Jsy+x/vv6vw0tLpbC5QSIaP3tYoh7C2s4gppmkjFjJ8QmfZroyGCFeGSRqgjuAU/ufuNAny8YIZ/3NXoXVHj7l2uzGljBP4xUObj577oxKhkUYVrgbfC5hQeLeT+bt5sPNY74RG7Vb3vkCR+6ApJROlPpzF9b+zANprdzFisSXMhF9KqxPX/QovtE3AXZ5JL5gfdmE24eRy4zY89zFVxza7Z5lN8jgGWsX9/nwpUjCw1S6LudL63S9ukEAmQmSqful40/n+1wSAW580fOR0Zsc4Cey3yqJZ+E/0WA5+jvn57e25gyYxAPjME2ga9vwTw1DTkIIaij6xo3mLLP5+SnNw7f64VinLsEBpsGmI2oSqpYwH/mPI9ySiWwOiV2FIJ7oLLoPyMC/f6Awq5eScPpdBy3aLyHAq7me4AoW+SfdToMwXwhNsT5rDBWFbkw//RQsQrdajdyojCxGMrvpm7L9h0mNFQAG03PCpMRL/y/PLmssk7eij2d+GEovtMyhcLQSKOW7SDFteUUB2Aj5BOE3/kJMucvq+MGRqo9WtiR6fGEi/JVqY4teTotP5Yq+n/15Utj4L+UuQw6E49dmostaRY7XGThs4pbYMzfgVuIyh3uLsQfGozdRBtXB+Ea1w7X9n1GNpiY2tvGsDvT3MBmyw0p7iS180yyix942LUVd4A4w1iINlvvw3q2VDP7bNW5/LK71shdb6LEgbOMaWMRoJbyk+FnxZ/U9nowoj8jfJkDFL6Ac8Mz0MgkDbaGp0EKoQ2k7YzuyDKRzYhz2mZSRUPJAoUZnWqYQlgXHRUl6Izb+7Q/k5sEL6056VUS8uXlcGCxNrTSW4Mb8wHexCTy5GtXisrqSy5i8D/1S8jfechdUpCohI5t3mK6R0m6R7JvkfrylHoyyxgpTH2r8l3CnVNyEIDGx35s96LoLrhKR0mdfnnd1zZxNzYuPXCvCKTa02tMHu1erFYZGNk/nGCJ2tAFhW1WIxsIxkaMBoVCQq5JqPEUj0Wl2yqMZcAEl7tvJctHFLpET6Q8LdOhI0ee/T6p20xQlefT2c02uyRiMnzi8Fg1+Yufod9f4OFgPdfF7ltvx064FgLNvXE8narNtlqxWmkLpXlcisRxV52lD2K5JXyft1ojHnfZAuvF0EuhQGY/wdIysJLjQdarIcm0KsU4N5DUT1WwZPG2ArU/rQPdie4xVQs6AXU0mOO+YBnCrywoV1B5mmausQKYeDwkbx3ZUTloNBl1a/LVoKRKPaI1+6ZRHC7VoN/v8s9pwKLv5MXb93Vh9Y3CZuNNTRVL7G9MaFyH0cP8TLbN0FAi6Dj81OKw7hiQPubyR2JHaQUqsDUmU0OFahyaIEarXAsA8R6VFYdoPpsmPrDp+vcQUU2BCxQpkk8xf6nHjjn1pur/fNh4bVHDm5je4WFJU29lMxKJuMV2iCT8g1u6Lvnwe76KHDUdizrW+fIDNSUgu7vOvbvk=","categories":[{"name":"关于我","slug":"关于我","permalink":"http://jeff-chung.com/categories/关于我/"}],"tags":[]},{"title":"面试准备","slug":"me/preparation-for-interview","date":"2018-04-28T08:09:02.000Z","updated":"2019-05-06T04:24:36.482Z","comments":true,"path":"2018/04/28/me/preparation-for-interview.html","link":"","permalink":"http://jeff-chung.com/2018/04/28/me/preparation-for-interview.html","excerpt":"","text":"English雅思和托福就是语言类考试，GRE 在大类上算是学术能力考试，基本上就是“美国研究生入学考试” 托福 for US =&gt; language ability testGRE for US student =&gt; language ability improvement My plan is 托福 =&gt; GRE =&gt; USA AlgorithmHow to solve it by computer + Leetcode(assume how to solve it by computer can help me solve 70% of problem) Book《JavaScript 高级程序设计》：这本书我前前后后看了五六遍，真的是好书，遇到的面试题上面都有的 Technical Knowledge hints 设计原理。如 VueJS， ReactJS 熟悉模块化、前端编译和构建工具 对网站性能优化有研究并有相关实践经验 ES6 如何判断一个数组是否是数组（这个很简单，回答了两种方法） 如何创建 DOM 节点（这个很简单），追问：元素节点和文本节点有什么区别（只回答了他们的 nodeType 不一样，元素节点是 1* 文本节点是 3） typeof 和 instanceof 区别（这个感觉没怎么回答好） display 有哪些值 双向绑定原理是什么 快排的终止条件是什么 数据库 b+ 树（懵逼…） 自我介绍 什么是预加载、懒加载 双向绑定原理 自己的 nodejs 项目 问了一下可以的实习时间 最后给了我一个智力题，差点就做出来了 自我介绍 正则表达式（问了几个问题），如何去掉字符串开头的空白字符，其他的记不清楚了，问得很灵活 cdn 作用 浏览器缓存 你是如何理解原型继承 cache-control 中 public 和 private 有什么区别 三列布局 http2 首部压缩 get post 区别 跨域 问我对 ant design 的理解（我将它和 weui 进行了对比） 移动端兼容性 es6 generator 是什么，async/await 实现原理 《JavaScript 高级程序设计》：这本书我前前后后看了五六遍，真的是好书，遇到的面试题上面都有的《深入浅出 nodejs》：这本书讲得很好，也看了很多遍，虽然面试一个都没问《web 性能权威指南》：很好的书，讲了很多 web 性能、http2 相关的，也看了几遍《TCP/IP 详解 协议》：看了 TCP 那部分《高性能网站建设指南》：讲了很多网站优化准则《http 权威指南》：感觉有点老，选择性看《ES6 标准入门》：选择性看的，比如 es6 一些比较好的新特性《你不知道的 JavaScript》：github 上有英文原版，也有中文出版了的《JavaScript DOM 编程艺术》","categories":[{"name":"关于我","slug":"关于我","permalink":"http://jeff-chung.com/categories/关于我/"}],"tags":[]},{"title":"你好，招聘人员!","slug":"me/to-recruiter","date":"2018-04-28T08:09:02.000Z","updated":"2019-05-06T04:24:36.482Z","comments":true,"path":"2018/04/28/me/to-recruiter.html","link":"","permalink":"http://jeff-chung.com/2018/04/28/me/to-recruiter.html","excerpt":"","text":"优势领域软件工程领域能力 程序设计 Api 设计 前端 spa 开发 后端开发 unit test TDD 技术选型,如 Redux,GraphQL, 项目管理 需求分析 源代码管理 缺陷(Bug)跟踪 提供高可靠度和高性能的软件 技术管理 平衡技术增长和业务需要去实现双赢 根据当前团队优化开发周期 能够培训新员工 已在工作中培訓出 2 位专业前端工程师且加速项目開发速度 工具 React Redux Node JS Koa Typeorm Php Laravel Mysql Git Bitbucket AWS 跨领域能力 沟通 社交能力 关键性思考 谈判能力 精要主义 学习能力 刻意学习 心流 启发式的思考 演绎法 性格 专注 认真 黑色幽默 現實主義的 風險愛好者 劣势 大规模的 Infrastructure 問題 根据商业调研,提出對公司有幫助的项目需求 快速的部署周期 拒绝常态化加班 我是否在找工作？虽然薪水不高,但我对老板和同事很满意,但如果真的有一份 更大的平台 做自己的产品 的公司. 更大的商业潜力 有竞争力的薪酬 让我对工作做出 更多的决定和更多的控制 我的领导者可以创造一种 我们很棒 和 持续改进 的文化。 谢谢阅读联系我如果你阅读后仍然对我感兴趣，请发邮件给 master-craftsman@jeff-chung.com，题目是向真正的用户提出真正的问题，解决真正的问题！，我保证会在 30 分钟内回复你。 简历我的中文简历My English CV 当前工资和期望薪金点击","categories":[{"name":"关于我","slug":"关于我","permalink":"http://jeff-chung.com/categories/关于我/"}],"tags":[]},{"title":"Code Review - Smart Component","slug":"code-review/smart-component","date":"2018-04-28T08:09:02.000Z","updated":"2019-05-06T04:24:35.441Z","comments":true,"path":"2018/04/28/code-review/smart-component.html","link":"","permalink":"http://jeff-chung.com/2018/04/28/code-review/smart-component.html","excerpt":"","text":"","categories":[{"name":"Code Review","slug":"Code-Review","permalink":"http://jeff-chung.com/categories/Code-Review/"}],"tags":[]},{"title":"全香港最优惠的自助餐预订平台 - www.okibook.com","slug":"product/okibook","date":"2018-04-28T08:09:02.000Z","updated":"2019-05-06T04:24:36.482Z","comments":true,"path":"2018/04/28/product/okibook.html","link":"","permalink":"http://jeff-chung.com/2018/04/28/product/okibook.html","excerpt":"","text":"www.okibook.com - 全香港最优惠的自助餐预订平台 Success Over 70 high-class restaurant Over 10k customer Over 67k fb like Reported by famous media OKiBook 訂位實測| 香港酒店自助餐優惠最低 6 折| 食買玩| GOtrip.hk 邊度訂自助餐有折扣？ 全新網上 Book 枱平台，天際萬豪酒店 75 折、洲際酒店 6 折、美麗華酒店 75 折、數碼港艾美酒店 7 折！ Business FeaturePlatformAllow different stores sell their buffet with best discount on specific time(Date + Meal Period) Multiple role for manage storesFor different stores,there is different role to manage stores e.gsenior manger,junior manager Allow visitor or creator book table hereTo allow maximum ordering of buffet. Seperate inventory model for authorized/anonymous reservationsUse different inventory model to balance maximum ordering of buffet and reservation ensurance of authorzied user. Storage of operation recordsEvery operation will store as operation record Platform chargingAllow platform to charge restaurant by reservations of each store made atlast day of that month. Multi-languageSupport Chinese and English Techincal FeatureCloudRun on aws elastic beanstalk,highly scalable using mysql on rds and php on ec2 Tddphpunit,100% test coverage on Search Researvation flow Commission Model What I can help you?I can provide detail consulting services on business requirement technical To help you build successful business!My email master-craftsman@jeff-chung.com","categories":[{"name":"我的产品","slug":"我的产品","permalink":"http://jeff-chung.com/categories/我的产品/"}],"tags":[]},{"title":"Code Review - Middleware","slug":"code-review/middleware","date":"2018-04-28T08:09:02.000Z","updated":"2019-05-06T04:24:35.439Z","comments":true,"path":"2018/04/28/code-review/middleware.html","link":"","permalink":"http://jeff-chung.com/2018/04/28/code-review/middleware.html","excerpt":"","text":"","categories":[{"name":"Code Review","slug":"Code-Review","permalink":"http://jeff-chung.com/categories/Code-Review/"}],"tags":[]},{"title":"Code Review - Helper","slug":"code-review/helper","date":"2018-04-28T08:09:02.000Z","updated":"2019-05-06T04:24:35.439Z","comments":true,"path":"2018/04/28/code-review/helper.html","link":"","permalink":"http://jeff-chung.com/2018/04/28/code-review/helper.html","excerpt":"","text":"","categories":[{"name":"Code Review","slug":"Code-Review","permalink":"http://jeff-chung.com/categories/Code-Review/"}],"tags":[]},{"title":"Different methodology and practice to achieve goal of different software we write","slug":"it-management/different-methodology-and-coding-structure-to-get-good-result-in-different-software","date":"2018-04-28T08:09:02.000Z","updated":"2019-05-06T04:24:36.276Z","comments":true,"path":"2018/04/28/it-management/different-methodology-and-coding-structure-to-get-good-result-in-different-software.html","link":"","permalink":"http://jeff-chung.com/2018/04/28/it-management/different-methodology-and-coding-structure-to-get-good-result-in-different-software.html","excerpt":"","text":"Technical explorationDuration:1 week PREFER Purpose Rapidly Explore Feedback Eliminate Record MVPDuration:3 months Fast Feasible Speedy development cycle Global Search Number of React Element ProjectDuration:1 year General KISS 原則 Component Design S.O.L.I.D 原則&gt;) DRY 原則 MethodologyMany object - OOPMany function - FP Structural Pattern MVC Redux Data structure Design and Implementation Single Source of Truth for data component Unit Test100% unit test coverage on component of reducer&amp;helper http://learntesting123.blogspot.hk/2015/03/21-practical-guide-to-software-unit.html https://github.com/ghsukumar/SFDC_Best_Practices/wiki/F.I.R.S.T-Principles-of-Unit-Testing Maintain code standardhttps://github.com/shimohq/react-cookbook#%E5%AE%B9%E5%99%A8%E7%BB%84%E4%BB%B6https://github.com/airbnb/javascript/tree/master/react ProductDuration:2 year Refactor 實踐Tdd 實踐Pure function 實踐Curring 實踐Naming clean code訂立 coding 約定並每䢛决定 實踐 UNIX 编程艺术 Improvement(Paying technical dept)e.g es6 react project to typescript project Total Effort evaluation for progressMinimal effort take to get visible resultRelevancy to new task","categories":[{"name":"management and cooperation","slug":"management-and-cooperation","permalink":"http://jeff-chung.com/categories/management-and-cooperation/"}],"tags":[]},{"title":"外表","slug":"basic-social-ability/outlook","date":"2018-04-28T08:09:02.000Z","updated":"2019-05-06T04:24:35.435Z","comments":true,"path":"2018/04/28/basic-social-ability/outlook.html","link":"","permalink":"http://jeff-chung.com/2018/04/28/basic-social-ability/outlook.html","excerpt":"","text":"头发梳 - 早晨 牙齿刷二次","categories":[{"name":"基本社交技能","slug":"基本社交技能","permalink":"http://jeff-chung.com/categories/基本社交技能/"}],"tags":[]},{"title":"Code Review - Reducer","slug":"code-review/reducer","date":"2018-04-28T08:09:02.000Z","updated":"2019-05-06T04:24:35.441Z","comments":true,"path":"2018/04/28/code-review/reducer.html","link":"","permalink":"http://jeff-chung.com/2018/04/28/code-review/reducer.html","excerpt":"","text":"","categories":[{"name":"Code Review","slug":"Code-Review","permalink":"http://jeff-chung.com/categories/Code-Review/"}],"tags":[]},{"title":"加入夥伴當中","slug":"basic-social-ability/joint-friendly-group","date":"2018-04-28T08:09:02.000Z","updated":"2019-05-06T04:24:35.423Z","comments":true,"path":"2018/04/28/basic-social-ability/joint-friendly-group.html","link":"","permalink":"http://jeff-chung.com/2018/04/28/basic-social-ability/joint-friendly-group.html","excerpt":"","text":"步骤夥伴规则与文化 合作 友好 规则 公平 尋找友好夥伴先想一下說什麽e.g 我們能做一些什麽呢？ 日记 這個星期你有沒有想加入的夥伴嗎？在可以做和不要做的清單，你做了什麽？你自己的正面評語","categories":[{"name":"基本社交技能","slug":"基本社交技能","permalink":"http://jeff-chung.com/categories/基本社交技能/"}],"tags":[]},{"title":"Code Review - General(Javascript)","slug":"code-review/general","date":"2018-04-28T08:09:02.000Z","updated":"2019-05-06T04:24:35.439Z","comments":true,"path":"2018/04/28/code-review/general.html","link":"","permalink":"http://jeff-chung.com/2018/04/28/code-review/general.html","excerpt":"","text":"不必要的额外的逻辑层1234567function getUserAccount()&#123; if(Auth.isLogin())&#123; return Auth::user(); &#125;else&#123; throw Error(&apos;get user when user is not authorized&apos;) &#125;&#125; 错误 程序员需要额外的一层才能知道程序会抛出异常如果用户不满意。 123456function getUserAccount()&#123;if(!Auth.isLogin())&#123; throw Error(&apos;get user when user is not authorized&apos;)&#125; return Auth::user();&#125; 改进 程序员知道调用者必须确保用户需要确保用户需要登录才能正确地调用**这个功能 Retrieve array of items from indexed data object when already have indexed keys1234567function getUsers(usersById,targetUserIds)&#123; return _.filter(usersById, user =&gt; targetUserIds.includes( user.id ) );&#125; 错误 low performance and readability 123function getUsers(usersById,targetUserIds)&#123; return targetUserIds.map(targetUserId=&gt;usersById[targetUserId])&#125; 改进 better performance and readability Unnecessary extra logic layer when processing overloading function1234567891011121314function getUser(idOrIds)&#123; let relatedUser; let predefinedUsers = [ &#123;&quot;name&quot;:&quot;jeff&quot;,age:&quot;20&quot;,id:&quot;id1&quot;&#125;, &#123;&quot;name&quot;:&quot;mandy&quot;,age:&quot;20&quot;,id:&quot;id2&quot;&#125;, ]; if(Array.isArray(idOrIds))&#123; return predefinedUsers.filter(user=&gt;idOrIds.includes(user.id)); &#125;else&#123; return predefinedUsers.filter(user=&gt;user.id==idOrIds); &#125;&#125; 错误 Should separation the type conversion and only have one process logic 改进 123456789101112131415161718192021function getUser(idOrIds)&#123; let relatedUser; let predefinedUsers = [ &#123;&quot;name&quot;:&quot;jeff&quot;,age:&quot;20&quot;,id:&quot;id1&quot;&#125;, &#123;&quot;name&quot;:&quot;mandy&quot;,age:&quot;20&quot;,id:&quot;id2&quot;&#125;, ]; if(!Array.isArray(idOrIds))&#123; idOrIds = [idOrIds]; &#125; //One processing logic only let results = predefinedUsers.filter(user=&gt;idOrIds.includes(user.id)); if(Array.isArray(idOrIds))&#123; return results; &#125;else&#123; return results[0]; &#125;&#125;","categories":[{"name":"Code Review","slug":"Code-Review","permalink":"http://jeff-chung.com/categories/Code-Review/"}],"tags":[]}]}